[{"title": "Why is it so difficult to send crypto via wallets?", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz3r21/why_is_it_so_difficult_to_send_crypto_via_wallets/", "selftext": "I’ve tried 2 different wallets with good reviews on reddit/App store. Both wallets would give server errors all the time, would take hours to actually send the coins, etc. \n\nIf crypto is supposed to be the future why on earth do the exchange methods suck so bad? \n\nI’m new to crypto but good lord I feel like this shouldn’t be that difficult."}, {"title": "Crackdown on crypto currencies in Turkey", "score": 2, "url": "https://www.cnbc.com/2021/04/26/turkish-bitcoin-exchange-vebitcoin-collapses-amid-crypto-crackdown.htmli", "selftext": ""}, {"title": "Turkish court remands 4 in cryptocurrency case", "score": 2, "url": "https://www.aa.com.tr/en/turkey/turkish-court-remands-4-in-cryptocurrency-case/2221501", "selftext": ""}, {"title": "Know Your Place in the Market", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz3pv7/know_your_place_in_the_market/", "selftext": "Hi all,\n\nWe've experienced some very volatile markets over the past year, and it is very tempting to try your hand at short-term/day trading.  Before you get too caught up in chasing the charts and the latest moon shot, you should consider the competition you are up against.\n\nShort term investing is a game of poker.  Here is my rough tier list of your competition at the table:\n\n1. **Exchanges and Brokers** \\- The only guaranteed winners in the market.  They will take 0.1-5% of every trade, win or lose.  They also have huge access to the trends and decisions everybody is making, which can be used to bet against you.\n2. **Governments** \\- Just because crypto can be \"decentralized\" does not mean you are free from paying taxes and following regulations.  Expect to pay a big chunk of each winning hand to these guys.  While the rules vary country to country, you will likely pay them a much larger chunk for your short term gains than you would for a long term investment.\n3. **Illegal Traders (Insider Trading, Pump and Dump groups, etc.)** \\- These guys have very strong knowledge of the market, and are pretty much guaranteed to take your money if you play the wrong hand.\n4. **Whales** \\- These guys have massive influence over the game, and they can swing the market to their favor as needed.  Unlike you, they can afford to take short term losses repeatedly, as their influence will eventually net them gains no matter what.\n5. **Trading Bots** \\- Evaluate charts, social media trends, and various other resources to make programmed decisions about the market.  By the time you've read a positive news article on your favorite crypto, thousands of these guys have already made trades based on their expectations of its impact.\n6. **Professional Day Traders** \\- These guys are working with all of the above resources to make decisions.  Their full time job is to find ways to take your money.\n7. **Amateur Day Traders** \\- You.  Bottom of the food chain.\n\n&#x200B;\n\nOverall, the odds are stacked heavily against you in every way possible.  Your chances of winning the game their way are slim to none.  Studies show that over 80% of day traders end up losing money.\n\nSo how do you win?\n\n**Time.** You may have heard the saying \"Time in the market beats timing the market\".  When zoomed out to a few years on the charts, market growth is positive and your hand is winning! Long term taxes are smaller as well.  So stop worrying about chasing the peaks and valleys! Do some research on long-term strategies and relax!\n\nThis is not financial advice, just my perspective of the market.  Make your own decisions!"}, {"title": "Uniswap uninstalled by PlayStore due to security reasons", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz3jwg/uniswap_uninstalled_by_playstore_due_to_security/", "selftext": "As the title says, I had Uniswap app on my mobile. I had not created any account or anything. Was waiting for the day..\nAnd today...out of the blue, received a notification from Playstore informing the app was installed as a preventive measure due to be malicious and able to steal my personal details. \n\nDid it happen with anyone else? \nWhat changed in the company policy to warrant such behaviour? \nWere they victim of hack or something?\n\nThanks"}, {"title": "I just realized that I actually know nothing.", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz3htu/i_just_realized_that_i_actually_know_nothing/", "selftext": "Doing your own research, due diligence, listening to both biased opinions and fud.\n\nAt some point you think you know enough that you won't get killed by this viciously volatile market. In the end the market will do what the market wants. First it was GME, a rallying call for people to finally beat the rigged system. It was glorious and I thought it had nothing to do with me. Then came Doge. It was made as a meme. Everyone called it a meme. I called it a meme. How I wish it was just a meme. The Doge is here to stay. Who freaking knew? Use case? Market Cap? lol\n\nI'm a scrub, noob, neophyte, amateur, plebe, conscript, recruit."}, {"title": "[Unpopular opinion] Let people buy whatever the f*ck they want, it's their money.", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz35kg/unpopular_opinion_let_people_buy_whatever_the_fck/", "selftext": "When did this sub become so toxic? Who cares if people want to buy Doge, Safemoon, DogeElon or whatever. People have to do their own research on the project. And just because you like a coin and believe in the project, doesn't give you the right to incite people to buy it.  \nI've met people who've made incredible profits with these types of projects, and even though I feel a little bit jealous because I'd rather invest and hodl, I didn't attack and told them they're wrong. Because they're clearly happy.\n\nBottom line, let people do what they want."}, {"title": "Top 5 things to look out for before trading crypto futures ✋", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz347b/top_5_things_to_look_out_for_before_trading/", "selftext": "#**1.Understanding Leverage**\n\n\nWhen it comes to trading futures, an understanding of [Leverage](https://www.investopedia.com/terms/l/leverage.asp#:~:text=Leverage%20is%20an%20investment%20strategy,firm%20uses%20to%20finance%20assets.) is very important, \"It allows traders to make a large investment in a commodity using a comparatively small amount of capital, \"This is one of the great things about the futures market. You often have to commit no more than 10 percent of a futures contract's value in order to take a long or short position.\"\n\n\n#**2.Only Trade Money That Can Be Considered ‘Risk Capital**\n\nTrading futures can be risky, as it’s possible to lose more money than you put into your account.\n\nIn turn, it's recommended for traders only trade with funds they can afford to lose, which is also known as “risk capital.”\n\n“You should not be trading futures with money reserved for necessities, such as housing, food, transportation.\n“Work with a seasoned broker to help you develop your risk profile and discuss what asset classes are right for you.”\n\n\n\n#**3.Use Stop Orders**\n\nWant to know the key to winning trades?\n\nDiscipline. Traders need to know when to get in and when to get out of a trade. In other words, have a game plan. \"That's what stop orders are all about. Formulating a plan on how much you are willing to lose and how much you are hoping to make, \"By placing a stop order, you're taking the emotion out of the trade.\" A stop order can be defined as an order to buy or sell at a specified price, which is used to lim.\n\n\n#**4.Rolling’ a Position**\n\nBeing as futures contacts expire, holders of futures positions will need to make a decision: do they want to close out or extend their position to another expiration date? If a trader decides to close their position, they can either sell the futures they own or purchase the futures they're short.\n\n\n#**5.The Trend Is Your Friend**\n\nTo be a successful trader, it probably doesn't help to be a contrarian because as the old saying goes, \"the trend is your friend.\" \"If a market trend is higher or lower, don't try to step in and run counter to what is going on. Try to get in at key entry points and follow the trend,\" Adding that there are ups and downs in both up- or down-trading markets. \"Rarely does something go straight up or down, so know where to get in and catch the trend.\"\n\n\n#**Bonus Tip**\n\n**Never Get Married to a Bad Position**\n\nFor anyone interested in futures trading, it's important to understand that no one trader is right 100 percent of the time.\"It is hard to admit you are wrong, but I have seen traders hold positions that kept going against them all because they could not admit they were wrong,\" Grisanti said, admitting he's been guilty of this himself. \"If the trade goes bad and hits your stop points to get out, then get out because only a moron puts more on.\""}, {"title": "Pre-Proposal: Ban Safemoon Shilling on this Sub", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz3340/preproposal_ban_safemoon_shilling_on_this_sub/", "selftext": "After seeing many informative posts warning users about safe moon, and they are 💯% correct. it's probably best to just Ban any Safe moon Shilling outright. \n\nEspecially with leaders of that community on youtube straight up telling everyone it's a pyramid scheme by saying those who are the first to cash out will profit and those who are late to do so will lose. \n\nIt's stupid.  It's like having a container where everyone who puts in cash will get a percentage of everyone else's cash that goes into it if they take their percentage out before others do. \n\nIt's like an honest ponzi scheme game that tells you how it is.  However, obviously not everyone shilling it is telling people about this and all these noobs will see is price going up instead of doing research, and buys into it thinking it's legit. \n\nNot only that, it's steering people away from Legit Moons making this subs crypto seem like the lesser when in fact Reddit themselves says they plan to continue distribution of moons for several years, and these are legit talked about on safe exchange sites like Kraken. \n\nI hope everyone votes from the right thing here so maybe we don't even have to have an offical poll. Mods will see it and act accordingly.\n\n[View Poll](https://www.reddit.com/poll/mz3340)"}, {"title": "Turkey's cryptocurrency nightmare worsened after a second exchange collapsed - stoking fears about bitcoin's risks", "score": 2, "url": "https://markets.businessinsider.com/currencies/news/crypto-exchange-collapses-turkey-bitcoin-risks-btc-vebitcoin-thodex-2021-4-1030346376", "selftext": ""}, {"title": "Turkey’s cryptocurrency crackdown gathers pace as lira falls", "score": 3, "url": "https://www.ft.com/content/e5d6513c-f06f-4451-a36b-f0ac622e783d", "selftext": ""}, {"title": "Recent Turkish Legislation Banning Crypto in Turkey - 2nd Exchange Rug Pull in Days (Vebitcoin)", "score": 2, "url": "https://interestingengineering.com/four-arrested-after-another-crypto-exchange-goes-dark-in-turkey", "selftext": ""}, {"title": "JP Morgan is not your friend. They spread FUD drive the price down to buy cheap then offer BTC fund. Take down the corrupt banking system", "score": 12, "url": "https://www.marketwatch.com/story/jpmorgan-may-offer-actively-managed-bitcoin-fund-report-2021-04-26", "selftext": ""}, {"title": "Oh no! The entire market moves together! It must be a scam!", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz2ooa/oh_no_the_entire_market_moves_together_it_must_be/", "selftext": " Bitcoin is the main powerhouse if the crypto world that drags everything else with it. If Bitcoin goes up, the market goes up. If Bitcoin crashes, then everything crashes. This is pretty much common knowledge, but I have encountered quite a few people lately that are new to crypto and did not know this and occasionally they even wonder how is that even possible that the entire market suddenly drops, all at the same time, following the exact same curve? It must be a scam and all manipulated because no way this is a “natural” occurrence. But actually, it is. \n\nThe below is a rough explanation of one of the reasons, amongst many, why this happens. There are other reasons too, some may affect it more some may affect it less, but this one gives a good idea about why it is a logical consequence of Bitcoin pulling the market so that it is not caused by some unknown Great Manipulator in the shadows, but it is a natural phenomenon.\n\nIt is all basically happening because there is a trading pair (BTC/USDT) that have both its coins traded with most other coins, like when there is a new coin added to exchanges it is very likely it will be set up as trading pairs with Bitcoin and USDT so by now, there are trading pairs on most exchanges between any coins and Bitcoin (BTC) and any coins and Tether (USDT). This means you can trade your coins for Bitcoin and for USDT amongst others. So if there is a sharp move on the BTC/USDT pair, it imbalances the price of other coins that also trade between both coins, generating a pressure to follow.\n\nSo first, let’s assume we have 1 Bitcoin (BTC), 1 Tether (USDT) and 1 Tabby Cat Token (TCT). They all have trading pairs with each other, so there are BTC/USDT, BTC/TCT and also USDT/TCT pairs.\n\nFor simplicity, let’s assume 1BTC=1USDT=1TCT meaning you can buy 1 Bitcoin for 1 USDT or 1USDT for 1TCT or 1 Bitcoin for 1TCT. This is the balance state.\n\nIf Bitcoin drops to half of its value against USDT because someone sells a large amount of it for USDT pushing down the price, it is easy to see that suddenly the TCT/BTC and TCT/USDT price will become imbalanced. Before the deal it was 1TCT=1BTC and 1TCT=1USDT but when Bitcoin dropped to half its price against USDT it created a market price pressure on TCT since at that point 1TCT did worth 1USDT but also did worth 1BTC directly but 2BTC indirectly through USDT. So indirectly TCT went up against Bitcoin resulting in sell orders driving the price of TCT down too following the price of Bitcoin.\n\nSince the above happens quickly, pretty much in real time, all we can see is that when Bitcoin moves, most of the market also moves with it. \n\nOf course, this is just one of the reasons, probably not even explained very well or accurately, but I find it simple enough to make some sense in the “everything moves together” events so some people may sleep better when they understand that it is just a logical consequence of the aligned stars (Bitcoin and USDT) and not an elaborate market manipulation of some major scammer."}, {"title": "Are Musk and Taleb testing us?", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz2jrs/are_musk_and_taleb_testing_us/", "selftext": "Just a simple thought. Read, think about it and tell me if it makes sense, but don’t take me seriously, it’s just an exercise of thought.\n\nI have two short (true) stories to tell you:\n\n-\tElon Musk tweets about Dogecoin and buys Bitcoin for himself, Tesla and (maybe) even SpaceX.\n\n-\tNassim Nicholas Taleb says Bitcoin is a Ponzi and does not openly short it, after writing so clearly about BTC in the past and openly telling us in his books that we should **follow portfolios and not words**.\n\nDoes that make any of them immoral, hypocritical, incoherent or evil? I don’t think so. Let’s think about this kind of action and what it could really mean.\n\nBoth are intelligent (I can’t quickly deny that). Also, both have large amounts of money, so they are in a position to play games with their followers: entertaining themselves and testing who is really thinking. \n\nI don’t mean they are doing it together, but I think both are testing their followers in their own way for their own reasons.\n\nMaybe, just maybe, the answer is they are doing a [Francisco d’Anconia](https://www.cliffsnotes.com/literature/a/atlas-shrugged/character-analysis/francisco-danconia) move. Signaling in one direction and testing who follows blindly, without giving any thoughts. \n\n-\tMusk is signaling in one direction and openly moving to another one.\n\n-\tTaleb is signaling in one direction and not betting against it. \n\nThey know some people will follow them blindly, just because “they are intelligent and rich”. \n\nWho is following their words and who is following their money?\n\n^P.S. ^Who ^is ^Satoshi ^Nakamoto?"}, {"title": "When a Shitcoin moons, I feel like I am a fool", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz2dti/when_a_shitcoin_moons_i_feel_like_i_am_a_fool/", "selftext": "Whenever an unknown coin or some coins like Dodge shows a 50% up in a day, it is a very bad feeling. I don't hate those are making profits, but I feel like, why I am playing with things like Fundamentals, real life use, technology and community support.\n\nI really want to try out those coins but then, again something keep me away from that.  Not only that, but I also don't want to lose everything that I have earned with established coins."}, {"title": "Shoe shine boys", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz2cn1/shoe_shine_boys/", "selftext": "im massively enthusiastic about crypto.. I work and it makes me happy to put fiat into crypto.. I believe in it. I hold ada, tron, xrp, eth, btc and some small alt coins.. because iv researched the whitepapers and founders of the project and I see a bright future for digital currency and anything that battles gov control and corruption imo is fantastic. \n\nI realise everything is speculation, crossing the road speculates that no cars will run me over.. eating food speculates its not poison, ect\nI enjoy researching, reading and enjoy the feeling of confirmation when a coins price starts to rise after careful dd and investment timing.. \n\nJust wondering if this shoe shine boy principle applies in crypto investing.. \n\nI have a neighbour who I haven't spoke to in over 18months.. until yesterday.. partly because of covid and partly because they are a little bit of a sponge.. they don't work, don't really say interesting things atall and rarely do anything other than complain and watch youtube/ play video games. my point is that we need to balance our lives against confirmation bias and dopamine addiction and simple wanting confirmation on bias only..  or it seems to me.. they are not a bad person but don't have much ambition or belief in life..(trust me I tried to help) fast forward to last night and they are telling me about binance and crypto and how I should invest 🙃.. I should start mining because he saw a youtube video about it..( In the UK btw where electricity is around 20p kwh) then they are telling me how they have no money for food..  im not sure how I should feel about it.. maybe its time to diversify the portfolio or get out of the market for a while like the old saying. (atleast until the dip is over?) \n\nHey I hope we are all going to be millionaires because of crypto and believe its possible with wise investmentss but is it realistic for people who just follow youtubers and invest gov. hand outs? \n\nidk I'm a relitive begginer myself just seems like everyone is getting onto crypto - its probably a good thing - maybe I'm being pesimistic because of my attitude towards this one persons past behaviour who knows..  \n\nA friend of mine has staked on crypto.com and made decent gains this year but he works,, he doesn't check his portfolio everyday and try to day trade with 0 experience.. there's so much to learn I hope everyone can keep up and not get anxious.\n\nany way good luck and happy speculating."}, {"title": "Cryptocurrency latest - Ethereum at record high but Dogecoin and Bitcoin plunge", "score": 0, "url": "https://www.thesun.co.uk/tech/14764800/bitcoin-news-live-ethereum-price-safemoon-dogecoin-cryptocurrency-updates/", "selftext": ""}, {"title": "Mining and environmentalists", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz21qs/mining_and_environmentalists/", "selftext": "Okay newbie here, \nOn social media I keep hearing especially during the debate whether artists should get into nft's or not that it was bad because the mining part requires a lot of energy which is bad for the environment. But in the long term, excisting banking systems also need to secure their systems. Can in the future be distributed mining as efficient if not more efficient? Especially if people mine at home and save money on heating their house? \n\nWhat do the people here think? What will the future of financial systems be if crypto's are done right?"}, {"title": "[Mental Health] Crypto has made me depressed. Let's take care of yourself.", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz1rlc/mental_health_crypto_has_made_me_depressed_lets/", "selftext": "I hate to admit this but ever since I got into crypto, my depression has gotten worse.\n\nWhen the market dumped over the weekend, I was so stressed and practically glued to the computer.  I would find myself watching chart and 2 hours would've gone by.  It was so consuming, because when my coins moved against me, I feel like I am stupid that I made the wrong moves.  Constantly comparing myself to other people who know how to pick winners and become independently wealthy, while I just picking them losers.  \n\nYou think when the market goes up I would feel better, but actually I still blame myself for not going in heavy enough, not taking more risks during the dips.  \n\nSo even when I win ... I lose.\n\nIt's so defeating and debilitating.  \n\nI hope you guys are having a better monday."}, {"title": "How I got through the 2017-2018 crash and how you could get through the upcoming one", "score": 79, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz1idx/how_i_got_through_the_20172018_crash_and_how_you/", "selftext": "I got into cryptocurrency back in November 2017, right before/during the bull run that had BTC and many altcoins' prices jump to ATH.\n\nMaking profits was so easy a lot of people, myself included, got too confident and took many risks investing in random coins as if they were the \"next big thing\". When the crash came, I saw my portfolio go from profits to -75% of my initial investment. Here's how I dealt with it and came back into the green in 2021.\n\nI am sharing my story because the same situation might happen to many newcomers when a crash comes (and it will). Don't fool yourselves, BTC will not reach 500k just like that. We might enter another 3 years of bear market that will result in:\n- People selling at loss\n- Loss of public interest for cryptocurrency \n- Enforcement of the \"Bitcoin is a scam\" mentality\n- A lot of people losing money\n\nSo here are a few tips I learned and gathered through the years which helped me get back into the green:\n\n1. \"You haven't loss anything until you sell\". I read this advice here on r/cryptocurrency and it really stuck with me. Even if you bought at ATH and are now facing losses, you shouldn't neglect the possibility of your investment becoming profitable once again during a future bullrun. Some of my assets took 3 years to get back into the green but still ended up being more profitable than if I had placed that money in the bank for the same amount of time.\n\n2. Invest MAINLY in projects you believe in and keep the \"get rich quick\" ones to a minimum. This was one of my biggest mistakes. I was seeing shitcoins take massive gains in days while my favourite projects were stagnant and FOMO got the best of me. I ended up losing A LOT in coins that were overhyped and never recovered from the crash. Don't be fooled by high % gains, they don't mean anything when a crash comes and your quick earned profit disappears never to be seen again.\n\n3. Don't be afraid to reorganize your portfolio even if you're in the negative. When I was down 75% from my initial investment, I started feeling like my money was already lost and didn't mind taking \"risks\" with it. I sold some assets I didn't believe in anymore and used that money to buy more of the ones I still believed in. That allowed me to buy my favourite coins at crazy low prices without injecting more fiat. That alone brought me back in the positive in 2021.\n\n4. TAKE SOME PROFIT OUT. I understand a lot of us are hoping for life changing gains and live by the hodl mentality. But one thing I learned in crypto is: sooner or later prices will go down. Having profits ready to be used when a crash comes is what will save your initial investment. Don't be afraid to set some profit aside in stable coins ready to buy a TRUE dip. Not a -15% but one that would bring your portfolio value to almost nothing. Knowing you have some profits ready to save your ass when a crash comes will make dips easier on your sanity and future bull runs much more profitable.\n\n5. Be patient. If you really believe in cryptocurrency and believe this is just the beginning, don't let dips and crashes get the best of you. BTC went from a 20k ATH to 5k in 2017-2018 only to come back to 60k in 2021. \n\nOnce again, keep in mind that bull runs make us all too confident. It's easy to joke about hodling through the storms but it won't be once they come for real. Be ready and rational when it happens."}, {"title": "Beware of the FUD...", "score": 3, "url": "https://markets.businessinsider.com/currencies/news/bitcoin-market-liquidity-recover-btc-price-crash-futures-derivatives-jpmorgan-2021-4-1030344438", "selftext": ""}, {"title": "How Does Taxes Work When It Comes To Crypto?", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz1a4s/how_does_taxes_work_when_it_comes_to_crypto/", "selftext": "Note: I'm In The US Guys, NYC Specifically\n\n\nGood afternoon everyone. \n\nI'm new to the crypto world and I just wanted to know if anyone knows the ins and outs of how is crypto taxed? Especially when it comes to trading one crypto coin (bitcoin) for another (dogecoin or safemoon for instance) is that taxed? \n\nThanks in advance"}, {"title": "Crypto Tubers with dramatic thumbnails and faces", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz18jb/crypto_tubers_with_dramatic_thumbnails_and_faces/", "selftext": "I have realized over the past few months that these people's advice are as worthy as the real value of ponzi scheme cryptos. \n\nI found, actually, that doing the exact opposite of what they tell you to do to be quite a bit more profitable. \n\nThere are Tubers out there that are actually helpful, but I am talking about the ones that post 1000% gain projections with \"OMGs!\" and \"SERIOUSLY?!\"s.\n\nI was thankfully never duped by them, but I do hope newcomers do not get duped... There are so many of them and I fear for the new dollars getting lost."}, {"title": "Am I just dumb?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz11sm/am_i_just_dumb/", "selftext": "I just watched the Silk Road and a bunch of interviews about it and such. It got me thinking. Could one make a new silk road written as a decentralized platform thus exonerating them of any culpability? I mean of course it would still be illegal (and depending how you view it immoral) and I am not suggesting it but couldn't it work like that theoretically? Am I missing something?"}, {"title": "I got into an argument with a No coiner employee of mine that was spreading FUD. Here's how it went.", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz115u/i_got_into_an_argument_with_a_no_coiner_employee/", "selftext": "Hes more of a temp helper for a job I just got.  \n\nHe Does ductwork. \n\nHe already knew I was in crypto.  \n\nI was telling him about these moons I get for shitposting so He made a comment about the market dipping...\n\n*So I was reading bitcoin just tanked from 65K to 47K*\n\nMe: Yeah just a market correction, things can't pump forever\n\n*Yeah but If I bought into it at 65K I'd be at 30% loss already*\n\nMe: yeah If you bought in within that 10hr time frame, and no you'd be at 18% loss not 30%\n\n*I did the math, it's 47K now*\n\nMe: it's about 55K actually \n\n*I just saw the price yesterday it's 47K*\n\nMe: well it's already back up so.\n\nLooks at his phone...\n*Holy shit it is... How is that even possible?*\n\nThat's just how the market works bruh.\n\n*Yeah but that has to be a big fluke, sounds like a pump and dump scheme going on* \n\nPump and dump ?  You realize how much money btc has to be sold while everyone is buying into it?    The CAP is too high to Pump and dump bitcoin like you can with a low cap alt.      It's adoption. \n\n*Yeah but I don't see this lasting, it was 47K yesterday so something is way off obviously\"\n\nBruh... You don't understand crypto\n\n*But I understand thr stock market, and it's pretty much the same thing for any investment*\n\n\nNo it's not the same thing.  Totally different ball game.  This is a 24/7/365 world wide market..people in asia are loading up when america is sound asleep in bed. \n\n*World wide? Yeah but it's regulated , you can't just buy it anytime that's why wall street closes certain hours... the Market can't be like 7-11* \n\nI can't believe you just spit fud at me by saying crypto can't be like 7-11.  You can't be serious with me right now.   \n\n*What does Fud mean?* \n\n\n\nThat's when I told him what it meant and he got SO FRUSTRATED about it...\n\n. ..*Uhh..I don't have fear! I'm not afraid of bitcoin!* \n\nThat's not what I meant. It's just a term used whenever someone has doubt. \n\n\nI kinda just gave up and switched the subject after that.  \n\n\nBut just to give you a peak of what some no coiners think about crypto.   That's it right there.      Remember...these are the types of people that are on social media and twitter arguing politics like they have done loads of research on the issue at hand. \n\nTBH, If you think crypto can't be open 24/7 because the american stock exchanges have set hours , then I hardly think you do any adequate research on anything.    This might explain why this guy is almost 50 and still banging out sheet metal.   Because he knows nothing else. \n\nHey I'm not judge . Not a perfect life. I've been irresponsible many times but don't go around thinking you know the way, the truth, and the light simply because your opinion on subject is different."}, {"title": "Should I take my money out to help me move?", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz0xfd/should_i_take_my_money_out_to_help_me_move/", "selftext": "This may be a stupid question but I’m moving soon and had this question. Does taking my crypto out somehow ruin the progress I’ve made on it? Is it better to never touch that “savings” account? I haven’t touched it since I made it and have only been adding to it and watching it grow. \n\nWhen IS a good time to take from it? What’s it like to put money back in afterward? Am I starting from scratch? Should I wait for the next dip to put money in? Should I wait for the next peak to take money out? \n\nThanks community!\n\nEDIT: I don’t NEED the money to move but it’d certainly make things easier ;)"}, {"title": "How to spot scam shitcoins", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz0oh6/how_to_spot_scam_shitcoins/", "selftext": "1. Go to CoinMarketCap or CoinGecko\n2. Go to description \n3. Count number of buzzwords (bonus points if it’s a phrase/word/abbreviations that sound really techy but you have no clue what it means) \n4. If it’s over 5 it’s a scam \n5. ????\n6. Profit \n\nSafemoon had 8 as an example. You could tell it was a scam because it was trying to be 8 different things, like both a Defi coin and NFT marketplace when those two are not even remotely similar. Maybe someone can make a natural language processing algorithm to read coin descriptions and assign a scam likelihood."}, {"title": "Haven't seen this scam yet. Introducing... the magic Bitcoin address and wallet!", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz0k00/havent_seen_this_scam_yet_introducing_the_magic/", "selftext": "Going through my spam folder and found this email. \n\nIt has the classic \"return to sender header\" as if you sent an email to someone and it got returned back to you. Makes it seem a little more innocuous, I guess. \n\nIt continues on and says: \n\n>A month ago, I accidentally discovered a very interesting bitcoin wallet when I was sending to a friend just 0.05 BTC, but when sending, I mixed up a few letters in the wallet address, the money did not come to my friend, but an hour later 0.1 BTC came to my bitcoin wallet, 0.05 BTC I sent to my friend again and the other 0.05 BTC sent to that amazing bitcoin wallet to check if the same amount would come to me, and lo and behold, I jumped almost to the ceiling when 0.1 BTC came to me again!\n\n>I was very happy when I realized that I had found a gold mine. Every day I started sending to that wallet many times exactly the amount of 0.05 BTC, since it does not matter more or less the wallet does not work with other amounts. A month later, sending 0.05 BTC to that wallet many times a day, I earned 837 BTC, at the moment it is about $ 51 million, I have provided my family and my children for life.\n\n>I'm tired of making money this way, so at the moment I'm busy building passive income in three different directions.\nI decided to give this wallet to everyone who wants to make money in this way 19L7ERnxwNRVAmZzDJwxMgR4MF45FP3zZQ .\nIn fact, I don't know whose wallet it is, maybe it belongs to Satoshi Nakamoto himself or it's an unknown error in the Bitcoin system, but it works and made me a millionaire.\n\n>If you want to earn the same as me, then do the same as me, to this wallet 19L7ERnxwNRVAmZzDJwxMgR4MF45FP3zZQ send only 0.05 BTC, no more, no less, and then within an hour you will get back 0.1 BTC.\nIn fact, everything is very simple. I wish you all financial success.\n\nHe/she is \"tired of making money this way\" so they're so *very* generous and giving it to people! It's a magic Bitcoin address/wallet! \n\nI looked at the address on the explorer and it doesn't have any transactions yet. Hopefully it'll remain that way."}, {"title": "This is a bounce not a rally", "score": 35, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz08w5/this_is_a_bounce_not_a_rally/", "selftext": "Hello \n\nThis post is targeted at people who are thinking of Yoloing into the \"BTC Rally\". First off this isn't a rally, yet. BTC hasn't broken out of the downward trend. It will need to close above $56,000.00 on the daily to even be considered a breakout \n\nRegardless of YouTube gurus spouting FOMO nonsense about a 10x boom in Alt-coins. We aren't in a euphoric uptrend and the possibility of a re-test of the 21 EMA at $45,000.00 is very much on the table\n\nBased on my daily TA without speculation. There was a rapid and short fall in price to $47,000.00 yesterday. This triggered buying ( most likely limit orders). That just as fast pushed up the price. There was some market participation around this sudden increase. However it was and isn't currently enough to push BTC out off the downward trend.\n\nIn fact a quick look at the BTC order book on my trading platform suggests the bulk of orders are still in the $47 - $43k range. With a small portion in the $51k area. \n\nIf you are thinking of a 100x leveraged BTC trade I suggest you look at the current order flow and participation. If BTC clears $54,000.00 today then its $58,000.00 tmw. Then we can say we are back on track to the upside \n\nUntil then the downside risk still stands, more so than the weekend as entry prices are now higher with lower returns. \n\nWe will breakout of this trend; but currently the evidence doesn't point it being today"}, {"title": "Crypto bull & bear market history lesson for those new to crypto", "score": 29, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mz048f/crypto_bull_bear_market_history_lesson_for_those/", "selftext": "Bitcoin halving 2012  \nCrypto market Bull run 2013  \nCryptomarket crash 2014\n\nBitcoin halving 2016  \nCrypto market Bull run 2017  \nCryptomarket crash 2018\n\nBitcoin halving 2020  \nCrypto market Bull run 2021  \nCryptomarket crash ? Likely 2022 unless this time is different. \n\nAfter every bull run most alt coins has fallen about 90% or more and Bitcoin about 80% or more from the top. Just a reminder that at some point in 2021 one should consider taking some profit, and buy back at a fraction of the price from the paper hands selling at the bottom of the crypto winter. \n\nGood luck and may Satoshi be with you...always..."}, {"title": "Korean tax officers seize $22M in crypto directly from exchange accounts", "score": 4, "url": "https://cryptoslate.com/korean-tax-officers-seize-22m-in-crypto-directly-from-exchange-accounts/", "selftext": ""}, {"title": "Ethereum Is Not Decentralized or Digital Oil", "score": 0, "url": "https://bradmillscan.medium.com/ethereum-is-not-decentralized-or-digital-oil-981b61467d9f", "selftext": ""}, {"title": "Best ways to cut down on fees?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myztq3/best_ways_to_cut_down_on_fees/", "selftext": "Currently, do to my bank not playing nice with Plaid, I am limited to Coinbase basic purchases via PayPal.\n\nWhat is the best way I can minimize fees so that I can transfer to places like Binance or Voyager to make trades to aquire Coins not available on Coinbase?"}, {"title": "Impatient: A Self Review (so you don't have to)", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myztjw/impatient_a_self_review_so_you_dont_have_to/", "selftext": "edit: tl;dr moved to top\n\ntl;dr - Do your research, listen to those more experienced than you, manage your risks, record your profit / loss, and don't let your ego keep you from profits.\n\nSelf reflection can be a difficult task in any pursuit. It is one that I've found especially difficult in the crypto realm. As a relatively new investor, I found it difficult to push my ego to the side and acknowledge my shortcomings which were holding me back from profitability. Maybe it was the constant reminders of individuals banking 1000x returns, maybe it was the allure of the gamble, or maybe it was something else entirely, but for my first 90 days in the market, I was completely incapable of admitting I was making every mistake that more experienced traders warn about here; constantly shifting funds to chase the hyped coin, buying into shitcoins 3/4 through a pump, failing to do thorough research on positions before entering, and the list goes on.\n\nI have finally broken away from that ego that was holding me back for so long in this realm, and wanted to share the reflections that brought me into profitability so other new crypto investors might read this post and avoid the stage of unnecessary losses or losing hope in the crypto space all together.\n\n\\*\\*Key Lessons Learned\\*\\*\n\n\\*\\*1.) Get Rid of Your Ego\\*\\*\n\nCrypto is not the realm to believe that you have what it takes to figure out everything on your own. This market will chew you up and spit you back out with a completely empty wallet before you can say \"get rich quick\". Listen to the more experienced members of the community, there is a reason they have lasted as long as they have or seen the profits that they have.\n\n\\*\\*2.) Record Everything\\*\\*\n\nIt's extremely easy to lie to yourself when your sights are set on the massive returns of some obscure coin that social media influencers will swear is going to the moon. Your memory is short and only becomes shorter the more common longshot opportunities become for you. Record every dollar, coin, transaction, trade, etc. that you make and keep an accurate profit and loss spreadsheet. With an abundance of separate wallets, exchanges, networks, smart chains, etc., the details can become lost in the whirlwind. Take a step back and create a ledger in which you can monitor your overall profitability. Analyzing this is the best way to \"plug holes\" in your strategy, realize your biggest mistakes, and keep yourself motivated when you finally see that P/L rise.\n\n\\*\\*3.) Be Honest, Be Patient\\*\\*\n\nThis last lesson was the result of my combination of the first two methods. After losing a significant amount chasing moonshots and quick gains, I found myself internally refusing to admit how much I was losing due to being impatient. After applying the first two lessons, I was unable to avoid this final truth, being patient and trusting in your fundamentals is the only way to get to your destination in crypto. Bitcoin didn't hit 50k overnight, and neither will the new alt you invested in last week. If you believe in a project / coin / investment, give it the time it needs to grow.\n\n\\*\\*In Summary\\*\\*\n\nI know many of you will not have faced these problems as I did, but I wrote this partly as a reminder to myself, and partly in the hopes that my experience will save someone the months of difficulty I faced in coming to these realizations."}, {"title": "\"Influencers\" whom promote certain Sh*tcoins are cut from the same cloth as \"Influencers\" that promote gambling to children. Regulations will take time. It is our responsibility to stop them.", "score": 33, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myzgoy/influencers_whom_promote_certain_shtcoins_are_cut/", "selftext": "I know people are here to make money and nobody will probably care but here it goes:\n\n&#x200B;\n\nDon't know how many of you are familiar with the insane gambling indoctrination one is exposed to when playing almost any kind of game these days but from my own personal experience this has peaked \\~2016 and since then regulations worldwide have been put into place to protect mainly children from that, if those make sense/work is left for another debate.\n\nTo give some context of how this is relevant to crypto, here is an example:\n\nCS:GO, a online shooter game with \"skins\" that make your weapons look a certain way. These skins can be freely traded and have real $ value, in certain cases up to MILLIONS of USD, yes millions. Since these \"skins\" are virtual items that can be sent in between users, 3rd parties have created 1:1 clones of real online casinos in which you can gamble by using skins rather than USD. This directly introduced a lot of youngsters/children to hardcore gambling practices. If that isn't already bad enough, so called Influencers that are prominent figures in these communities will lure their fanbase by showcasing how they win thousands of USD in these casinos while some of these Influencers are secretly owning said casino and have access to the backend ( able to manipulate odds, ect.. ).\n\nAll of this is old news and there have been a lot of positive changes in that regard over the last few years but its still pretty bad, if you want a thorough explanation, watch this: [https://www.youtube.com/watch?v=\\_8fU2QG-lV0&ab\\_channel=h3h3Productions](https://www.youtube.com/watch?v=_8fU2QG-lV0&ab_channel=h3h3Productions)\n\n&#x200B;\n\nThis fiasco has left an undetermined amount of people, mainly very young people and children with a massive loss of capital, gambling exposure or even addiction. It took the masses forever to grasp what's going and regulators took even longer to step in.\n\n&#x200B;\n\nI don't have to explain to people using this sub how certain individuals are tainting the beauty of blockchain technology for a quick cashgrab by creating some sh'itcoin+insane marketing. But there are more sophisticated operations like SafeMoon or Bitclout that need real experts to dismantle their fraud/ridiculousness to the masses to save as many people as possible.\n\nIf you are just here to make money and can't be arsed with anyone else, I understand and respect that.\n\nBut if you have an ounce of empathy in your body and believe in a basic set or morality, please ... use any chance you can get to expose these people crippling the public perception of blockchain technology with their \\*\\*\\*\\*-projects born from nothing but greed, that will not only taint the entire crypto industry but destroy many of individual life's in the process."}, {"title": "A second bitcoin exchange collapses in Turkey amid crackdown on cryptocurrencies", "score": 0, "url": "https://www.cnbc.com/amp/2021/04/26/turkish-bitcoin-exchange-vebitcoin-collapses-amid-crypto-crackdown.html", "selftext": ""}, {"title": "What happened to Bitcoin this week and how to prepare for the next flash crash fakeout", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myz5br/what_happened_to_bitcoin_this_week_and_how_to/", "selftext": "You have to look at the data. Who is trading BTC? Well, it turns out its not retail investors, but institutions. See exchange data for btc trading and you will see this is correct. The whales are in control.\n\nWallets with 100-1000 BTC control the market. Maybe BTC will become more mainstream in future but currently to retail investors it is seen as too expensive. That's why a lot of newcomers look at something like Doge with more interest even though its fundamentals are weaker. \n\nSo what happened? First, exactly a week ago there was a $3 bn long liquidation. I've never seen anything like this before, it happened to ETH too. The thing is, the data from exchanges is public so whales can plan for these downward movements. Then, you had the Biden tax scare and a planned fakeout. After almost 7 months of green candles, the largest holders let the price drop before accumulating. You can tell this by looking at who is buying Btc during this time and another crucial piece of data, Tether (USDT) deposits which increased dramatically right before the \"correction\". Then last night, BTC went from 47 to 52k in around an hour. \n\nJust be careful, folks. There are indications these things are happening all the time and as regular investors we should be prepared for them. If you are going to hold a significant amount of BTC in your portfolio then you should follow the indicators mentioned above to foresee price movement in the future.\n\nSources: \n\nLongs liquidation on 4/17 exactly when BTC started correcting. Remember this is public information: https://www.theblockcrypto.com/data/crypto-markets/futures/btc-liquidations\n\nHere are charts for BTC, if you compare wallets from end of 2020 to 2021 you can see retail investors have levelled out: https://www.lookintobitcoin.com/charts/wallets-greater-than-1000-btc/"}, {"title": "Doge/Safemoon is not the problem, the community setting unreal price expectations and trapping newbies is. Hate the community, not the coin.", "score": 16, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myz2h6/dogesafemoon_is_not_the_problem_the_community/", "selftext": "Coins like Doge or even tokens like SafeMoon, SafeMars or whatever new rugpull you wanna create is not the problem. If anything, the fact that anyone can come up and create their own coin or token is a win and something we should be proud of. \n\nThe problem exists with their community. Doge is a fun little meme coin to have, something to give 1% of your portfolio to, but the community is unbearable, the problem starts where the community starts putting up and spamming unrealistic price expectations and trapping gullible newbies in the name of get rich quick schemes. The people who know what's up get out close to the top and the newbies end up becoming worthless bag holders.\n\nI personally thank Doge for introducing me to crypto some months back, after the initial Elon tweets and hype. It was the first crypto I bought and also ofcourse my first loss since I was new and paperhanded. However thanks to this community and me myself being a programmer, the tech kept me interested and introduced me to a whole new world. Now I am at a point where I have started writing small dApps on Ethereum, from Doge to here, so I definitely thank it for the introduction, however as a newbie at some point, I definitely dislike its community, it really manages to lock you into an echo chamber, creating unreal expectations.\n\nEven with possible scams/rugpulls like Safemoon or whatever, the community is what makes the scam possible, no simple newbie would take the daunting steps of withdrawing BNB to MetaMask or Trust Wallet then executing swaps on a DEX, but the community and hype manages to trap them in a way that they put blind money into these internet coins they understand nothing about.\n\nThank you for coming to my Ted Talk."}, {"title": "TIL People are moving to Puerto Rico from mainland US to avoid paying as Crypto much tax", "score": 3, "url": "http://www.cointracker.io/blog/the-puerto-rico-crypto-tax-loophole#:~:text=Only%20the%20gains%20related%20to,rate%20until%20January%201%2C%202036.", "selftext": ""}, {"title": "Scams, Pay Atention! [For Newbies]", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myyyim/scams_pay_atention_for_newbies/", "selftext": "Many people put cryptocurrencies in wallets like Atomic Wallet, Exodus and Jaxx Liberty. This wallets are not scams and you will not lose your money in them but you have to pay attention when you need to contact the support, make sure they are official.\n\nWhen you ask for costumer support, lets say on reddit, many people with mean intentions will private mensage you saying that they are the support of this wallets. They already stole many peoples money and with this world of crypto increasing in number of people more more attemps they make. They at first appear harmless and listen to your problem then they will present you a solution that is backing up your wallet in their servers by putting your seed phrase in a website that is almost like the official. Remember your seed phrase is your key to unlock your money, you should not give it to no one. Non of this wallets customer support will ever ask you for your seed phrase.\n\nThe best you can do is ignore the messages from this people, don't let they fool you. This may sound like a obvious situation but i have seen so many people fall for this on the recent days. I think this happens more to people that are new in the crypto scene.\n\nRemember keep your seed phrase safe in a paper or better something that isn't destructive. Never give it to no one, everyone that asks you for it are scammers believe me don't fall for this.\n\nBest Regards"}, {"title": "PancakeSwap Lottery is EXTREMELY Suspicious", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myymvw/pancakeswap_lottery_is_extremely_suspicious/", "selftext": "So I wanted to play the PancakeSwap lottery and before everyone starts screeching about how dumb lotteries are and odds, etc. I just want you to know thats not at all what this post is about and I just wanted to try it out and was willing to lose 1 CAKE for that.   \n**SO PLEASE DON'T MAKE THIS POST ABOUT ODDS.**  \n\n\n**Why I find it extremely suspicious:** You pay 1 CAKE to stand a chance to win 50% of the entire pot of CAKE contributed to the lottery (for that draw). Looking at the amount of CAKE that is contributed to the pot, it's extremely attractive to spend 1 CAKE to potentially win 10,000+ CAKE in return.\n\nThe lottery section on PancakeSwap also shows you recent winners and this is where it gets sus...\n\nTHERE ARE SO MANY GRAND PRIZE WINNERS WHO TAKE 50% OF THE POT **AND** THERE IS ABSOLUTELY NO EVIDENCE OF ANYONE EVER WINNING. (Not to mention that PancakeSwap is anonymously run...)\n\nTo put this into perspective these grand prize winners are sometimes winning CAKE that is worth **hundreds of thousands of dollars**, but there isn't even one guy who boasted about this online somewhere? Not one screenshot? Not one pic of a wallet balance with thousands of CAKE in it after winning?\n\nThat to me seems so unrealistic. Go look through the past draws and you will see how many winners there are, there's more than 10 grand prize winners in the last 15 draws and they've been doing this for a long time...\n\nNow some may argue, only a fool will make a post online about winning the grand prize as this makes him a target. But considering how many have \"won the Pancake lottery\", there should definitely have been one guy dumb enough to post about it online for people to see. As a matter of fact there isn't even evidence of people winning the smaller prizes (getting 2 to 3 numbers out of 4 correct).\n\nWhat do you think? Sketch or nah? Have you ever seen evidence of a grand prize winner?\n\n*Or is everyone who plays in a lottery smart enough to keep their winnings a secret? (*<-- *thats a joke btw)*"}, {"title": "Crypto Cops Coming for Us?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myydrr/crypto_cops_coming_for_us/", "selftext": "\"It’s unclear exactly what the top crypto cops, Yellen and SEC Chairman Gary Gensler, have in mind to rein in the market. Wall Street executives tell me they expect increased enforcement actions on specious claims made by crypto sellers and its use in illegal activities.\"\n\nhttps://nypost.com/2021/04/24/new-federal-regulations-could-spur-cryptocurrency-crash/"}, {"title": "Brave browser. Be careful", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myy4h5/brave_browser_be_careful/", "selftext": "I just lost all my BAT on my phone because I cleared the cache and data from brave. I had maybe 3 or 4 bat earned so I was unable to verify the wallet which I'm assuming would have allowed me to recover my BAT? Not all is lost tho I've been earning BAT on my PC and phone seperate. 3 or 4 bat is no biggie considering it was free but it still sucks. I'd hate for this to happen to someone with 24 BAT (since you need 25 to verify) \n\nOr am I missing something and is there a way to backup your bat before earning 25?"}, {"title": "As a long time Nano fan, brick and mortar shops accepting Doge is like getting kicked in the nuts", "score": 56, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myxt26/as_a_long_time_nano_fan_brick_and_mortar_shops/", "selftext": "First of all, just to say I have nothing against DOGE. I am beyond pumped for all the people that made (or are still making) money on it. Hats off, guys. \n\nI honestly believe there is place in this crypto sphere for a plethora of coins that do different things, and why not have a selected few meme coins that are there for the kicks and giggles. Doge being the first major meme coin, and a couple of other ones (e.g. Banano has a strong community and is actually teaching people about crypto). \n\nI'm not here to shill Nano. It has it's faults (last month we've been painfully reminded of that). \n\nThat said, I believe that fees and confirmation times are the key elements in bringing crypto to the masses (for online and brick and mortar shopping). Which is Nano's main point. It's IMO the best candidate for being a pure digital currency. No smart contracts, no auto staking/lending features. Payments fast and feeless. That's it. \n\nThen to see news here that a meme coin is being accepted as a means of payment in various Mom and Pop stores, while Nano is sitting on the curb, like an adopted ginger, is nothing less than devastating. BTC, ETH I'm fine with. It's what majority of people knows, and people accept the transaction times and fees (little cost for bringing traffic to the store and being one of the adopters). But DOGE?? You have got to be kidding me.\n\nSorry guys, just needed to vent/rant a bit."}, {"title": "Can anyone give me a good reason to buy LTC?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myxqu2/can_anyone_give_me_a_good_reason_to_buy_ltc/", "selftext": "I see people throwing LTC into their buy recommendations all the time and have no idea why? Is it just name recognization at this point? I’d much rather throw money into a a potential up and coming project than something that’s not going anywhere and will just sink into the abyss."}, {"title": "Just for a laugh, what's been your worst investment you've made and are you still hodling?", "score": 22, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myxp4q/just_for_a_laugh_whats_been_your_worst_investment/", "selftext": "I'll start. I like to throw $15-20 on random recommendations I see pop up on reddit. Some pay off, others don't. My worst 3 are NoFomo that I put $20 on and is now worth $0.97, moonelon420 (420) that I put $15 on and is now worth $0.17 and my favourite Axxa.ai that has just now relisted as \"new\" that I put $30 on and went to cash out at its peak which would have net me well over $200 but turned out to be a super rugpull and was worth something like $0.0000024 last time I checked.  \n\nLet's have a laugh at the misfortune of others and see just how harsh the learning curve can be.  \n\nI'll add that if you don't have anything nice to say, don't say it. I'm not about that.  \n\nEdit: I'm still hodling all mine as it'll cost more to sell than they're worth. 🤣"}, {"title": "Top 5 crypto scams and how to avoid them", "score": 6, "url": "https://buybitcoinsmart.com/top-5-crypto-scams-and-how-to-avoid-them", "selftext": ""}, {"title": "Unpopular opinion: All \"Unpopular Opinion\"-Posts are made to farm moons, including this one.", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myxhwj/unpopular_opinion_all_unpopular_opinionposts_are/", "selftext": "oh look at me, i believe \\[popular/obscure/literally any\\] project is \\[better than btc/a ponzi\\].\n\n&#x200B;\n\nAlso, as a citizen of Uranus (GDP of the whole planet: 0) even a single moon is an infinite increase to our GDP and i am so grateful for it!\n\n&#x200B;\n\nEdit: \n\nThis hasn't worked as expected and now sadly has to escalate, this is now a robbery, PUT THE MOONS IN THE VAULT, IM NOT MESSING AROUND!"}, {"title": "Dogecoin army’s campaign to drive crypto to $1 was a bust", "score": 3, "url": "https://www.marketwatch.com/story/dogecoin-armys-campaign-to-drive-crypto-to-1-was-a-bustso-why-do-bulls-still-feel-vindicated-11619024046", "selftext": ""}, {"title": "Is it me, or without media and known people hyping bitcoin it would stale with price, and mostly thanks to bots?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myx4q4/is_it_me_or_without_media_and_known_people_hyping/", "selftext": "There is something underneath that I just saw during latest dips.\n\nThe first thing - majority of people have money to buy only the first wave of dips, at best get into second. This is overall an investment awareness, but fact is a fact. Just buying crypto does not make people good financial advisors out of the box. The overall results of that were going straight down (VeChain that I follow went from 0.22 to 0.20, 0.18, and then to 0.13 iirc)\n\n The second thing - when people run out of resources to pump the charts up then more media activists shows up, at least I got more of the \"bitcoin is good\" type of news even if these were fake (Georgia passing cryptocurrency teachings in school)\n\nThe third thing is a bigger players greed. I refuse to believe that the presence of good crypto news is not correlated with how much money people from the street has. I feel like this time the good news were shown when reddit was full of comments like \"i have no more money to invest now\", or \"waiting for my stimulus\"\n\nI will observe if this will happen again during next dips"}, {"title": "Is Solana (SOL) a legit project or is it yet another centralized pump-and-dump sh*tcpin?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywz8o/is_solana_sol_a_legit_project_or_is_it_yet/", "selftext": "Hello everyone,\n\nas the title asks, what is Solana actually?\n\nNeither from their website or from their subreddit (r/solana) I can clearly understand what SOL is all about. \n\nAdditionally, it‘s been pumping properly in the past few weeks (bull run, I know), but it kept pumping even the last days when BTC and ETH were in the red.\n\nCan someone enlighten me?\n\nIt may be an amazing project with huge potential. I just can’t seem to understand it."}, {"title": "PSA: Don't get emotional if you didn't \"time the market\" perfectly.", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywswg/psa_dont_get_emotional_if_you_didnt_time_the/", "selftext": "This issue always seems to come up immediately before and right after we start an uptrend after a correction. The truth is that unless you're a professional trader, you probably shouldn't be sweating your \"entry price\" as much.\n\nYou bought at the top? It's ok. Zoom out and think about the people that bought BTC in December '17. They felt the same way for a long time. Those that kept their cool and held through the bear market are in great shape today.\n\nYou didn't buy the dip? It's ok. Google \"bitcoin dead\" and look at how many major corrections have come and gone before now. Those that shrugged and bought even though they missed any of the \"dips\" are in great shape today.\n\nI'm certainty not an expert and these aren't new ideas, but they've worked for me. Play a long term game instead of chasing the next moonshot. Buy and hold coins you've researched and believe in rather than what's trending. Think about setting a limit sell for a portion of every buy to force yourself to take profits at a price you're comfortable with. Set up recurring buys to force yourself to DCA rather than trying to time the market.\n\nFinally, and most importantly, DON'T TRADE WHEN YOU'RE EMOTIONAL. Whether it's exuberance or despair, step away and clear your head before pulling the trigger.\n\nGood luck out there everyone. I hope each and every one of you can join me on the moon in a few years 🌝"}, {"title": "This might be an unpopular topic, but shouldn't people be considering the importance or their country's Cryptocurrency regulatory framework before they invest? The Govt doesn't necessarily need to be seen as the enemy. A collab with the industry can mean HODLer & traders are better protected.", "score": 2, "url": "https://www.bloomberg.com/news/newsletters/2021-04-25/turkey-s-cryptocurrency-boom-turns-to-bust", "selftext": ""}, {"title": "Did I do something wrong while transfering?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywpgm/did_i_do_something_wrong_while_transfering/", "selftext": "EDIT: THANKS EVERYONE, MANAGED TO DO IT!!!\n\nI transfered 0.001 bch from binance to whitebit to test.\n\nOn binance it says completed but it didn't show up on whitebit.\n\nI put the option to withdraw on binance and deposit on whitebit.\n\nI checked address twice and everything. Everything checks.\n\nOr does it take sometime to process after the fund exits binance?"}, {"title": "Shitcoins: \"TikTok investors are still making money while the crypto elite waits for the bubble to burst\" - Rekt", "score": 2, "url": "https://www.rekt.news/shitcoins/", "selftext": ""}, {"title": "Does anyone have this problem: You consider a coin to buy suddenly it goes up in price. The moment you buy a coin - it goes down.", "score": 29, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywo1g/does_anyone_have_this_problem_you_consider_a_coin/", "selftext": "Does this happen to anyone? Last few nights i considered moving into several coins - They just shot up into the stratosphere. I get it, probably everyone else is thinking the same thing.\n\nHowever when I buy a coin -- it just sinks like a stone.\n\nIs there a name for this effect?  And cheer to those who seem to only get green candles no matter what coin they pick!"}, {"title": "How to protect yourself from exit scams?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywnw4/how_to_protect_yourself_from_exit_scams/", "selftext": "Pay attention to the team. I would not trust a project behind which are people without any experience. Not only for scam reasons but also because of the inexperience of such a team.\n\nBe wary of unrealistic promises. \n\nPay attention to the size of the softcap. Small amounts are easy to raise with a small advertising campaign.\n\nCheck GitHub as most crypto projects should be open source. \n\nAnd most importantly: “Don't keep your coins on exchanges” \n\n&#x200B;\n\nArticle : [https://www.publish0x.com/sirloin/exit-scams-are-the-new-trend-xvwodrp](https://www.publish0x.com/sirloin/exit-scams-are-the-new-trend-xvwodrp)"}, {"title": "Can’t withdraw from Binance in my currency and directly to my MasterCard?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywk3r/cant_withdraw_from_binance_in_my_currency_and/", "selftext": "If I try to withdraw VET from my acc, they only offer to pay me in AUD and only to Fiat Balance, there is no option to withdraw directly to my bank. Am I doing something wrong? Why can’t I withdraw directly to my card? \n\nIf I sell for fiat balance, will I be able to withdraw that to my card?"}, {"title": "Saw too much people complaining about DIPS, this is the first time I see complaints about crypto going up !", "score": 10, "url": "/r/Bitcoin/comments/myvldt/why_is_everything_rising/", "selftext": ""}, {"title": "Bitcoin is a failure", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mywe8n/bitcoin_is_a_failure/", "selftext": "So all the no coiners are relishing in this last price dump proclaiming that because the value of bitcoin, unlike other things being artificially pumped doesn't always go up,you can't use it as a store of value and you can't use it as a medium of exchange because of how expensive and slow it is, therefore it is a failed currency. \n\nNow they certainly have a point, using btc as a medium of exchange is slow and expensive, but remember the internet? Remember in the early days where in order to use the internet you could not be on the phone? Remember how expensive it was? I'm sure there were geezer and bootlickers proclaiming that the internet was a failure and it would never catch on because it was slow, expensive, and inconvenient. Well fast forward and the internet is basically our lifeblood. \n\nOh and about that price volitilty, remember when America took the dollar off the gold standard and we had massive inflation in the 70s? Well that's because it became a brand new currency, and brand new currencies are volitile. Eventually though, once it reaches a certain point of adoption, that volitilty stops being a problem. \n\nMeanwhile many many paper currencies are losing that stability, with USD (and I know no one wants to believe it) not too far from that point, though it will probably be the last fiat standing due to it's reserve status. Unlike bitcoin though, it isn't a digital technology, it is an archaic, corrupted technology that will take way too long to change, and that immediately makes bitcoin far superior to fiat. \n\nI'm seeing the fud here and other places. I see these people look at this brand new technology see it's problems and decide (for some reason) that it will always be like this therefore it's a failure and a ponzi(??? Why?? Do you even know what a ponzi is? A ponzi is robbing peter to pay paul, bitcoin doesn't have an owner so it by definition cannot be a ponzi. If I buy bitcoin I have physical proof that I own that asset. So I'm not being robbed, so it isn't a ponzi). \n\nBitcoin will grow and it will evolve and it will get the current problems fixed. That's how digital technology works. Just be patient. These things take time, that's why it's called an investment. As a proof of concept, bitcoin absolutely works. We have plenty of projects in the works to tweak the network so that it eventually becomes faster and we're getting the adoption, it has the network effect already, so it only needs time. Chill and hodl.\n\nEdit: fine fine here are links to back up my changing and evolve claims \n \nhttps://www.coindesk.com/rise-of-layer-2s-altcoins-like-ethereum\n\nhttps://www.forbes.com/sites/billybambrough/2020/07/09/bitcoins-lightning-network-is-struggling-to-overcome-fundamental-issues/?sh=7a79d5945f77\n\nOf course these aren't perfect either, but nothing is perfect. It just needs to be better than the alternative. And it IS. Also I'm not a bitcoin maximalist. This is my personal opinion, but I believe bitcoin will probably be the major currency being used alongside other smaller currencies. No real reason bitcoin needs to be the only one. USD isn't the only currency now lol"}, {"title": "Dogecoin Core Developer Sporklin, 'A True Shibe,' Dies Due To Cancer", "score": 17, "url": "https://www.benzinga.com/markets/cryptocurrency/21/04/20785109/dogecoin-core-developer-sporklin-a-true-shibe-dies-due-to-cancer", "selftext": ""}, {"title": "Think. If Crypto YouTube investors are proclaiming success then why do they need to monetize their channels with Ads, post referral links, insert paid promotions and need you to like and subscribe?", "score": 59, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvl0l/think_if_crypto_youtube_investors_are_proclaiming/", "selftext": "The growth in fresh faced YouTube crypto investor channels has been meteoric.\n\nIt's always best to keep in mind that anyone offering tips, tricks, investment strategies, platforms, tools, wallets, apps etc.. to improve your chances of investment at the same time as monetizing their channels... aren't with watching or forming part of your crypto research.\n\nShort term technical analysis of candle charts in crypto is generally useless bullshit. It makes for filling out video content but crypto is so volitile and evolving so quickly it makes short term T.A. impossible. \n\n**Good investors will not need your money or have to beg for your support.**\n\nTheres one way to make money in crypto is very simple and does not require you to watch daily YouTube releases. It only needs the following sentence to define it.. not a channel of videos....\n\nSecurely long-term invest only what you can afford to lose in a diversified range of established major cap crypto's, dollar cost averaging periodically along the way. \n\nThe people that have made the most money in crypto have done this at a time none of these \"crypto investment\" YouTube channels were around.\n\nYouTube is a great educational resource if used wisely... The new breed of crypto investment channels are definitely worth avoiding."}, {"title": "Crypto resistance levels and nonsense artists", "score": 9, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvtf9/crypto_resistance_levels_and_nonsense_artists/", "selftext": "From the land of quantitive analysis there came a certain practice, and latterly a religion of sorts, centered on the concept of resistance levels and their meaning.\n\nAt their core resistance levels describe pricing - up or down - against which an asset encounters resistance. At the up, it’s the maximum price people are willing to pay. At the down, it’s at the price where people cannot resist.\n\nThere are many ways to draw resistance levels and indeed some have reached a level of arcane art that deserves appreciation if not adherence. Lines, pillars and colors attempt to map out what has gone before, give it meaning, and apply it to the future.\n\nThe tools of this trade have become increasingly convoluted over the years, as with astrology or palm reading, due to the sheer number of adjustments that must be made. Confirmation bias needs a foundation, after all. And with the complexity has come that saddest of things: little questioned acceptance.\n\nQuantitive analysis has its value. In the 1980s it closed a significant number of market inefficiencies, exposed clearly by numbers, yet missed to that date by the old breed of emotive traders. But since that period it has had a more troubled life.\n\nAnd that is troubling in itself.\n\nIt is one thing to begin a numerical analysis of a field and to discover inefficiencies as they exist. It is quite another to tell the future based on the past, particularly when that future compounds complexity each minute further out you look. \n\nThe issue that marks the delineation between the point where quantitive analysis can provide relative certainly and where it cannot is time. For each second that passes, millions of trades occur, and move in lockstep with thousands of new data points from the market. Earnings. Pauses. Contracts.\n\nThere is a concept in statistical analysis that has thrown national security programs as much as trading performance relates to false negatives and false positives. The more data you have, the more of these you. The more of these you have, the less reliable your conclusions.\n\nAnd back to resistance levels we come.\n\nIf you explore the recent history of quantitive analysis you will note that it tends to have more success in high frequency trading than in longer (let’s call them normal) positions. This is mathematics at work. Your complexity at 100ms is exponentially smaller than at 1 second, let alone 10. \n\nWhen you pull back further, and try to call a day or a week or a month, the realm starts to shift from science to magic. It’s possible to be correct, of course, but it’s possible to be the opposite. And undue confidence may come from making a call that only has two answers: up or down. It’s hard to tell if a wall of mathematical runes or a toss of a coin provides more utility.\n\nA resistance level is a judgement call based on observed behavior from the asset and investors in an asset. It is based on past behavior and a slice of the current, and this it offers certainty only if all variables remain the same as they were at the points of initial measurement. \n\nResistance levels do have utility. If an asset keeps bouncing between 1.20 and 1.50, it is a reasonable call to say “it seems to bounce between 1.20 and 1.50 but not above or below.” And it is also reasonable to say “it is at 1.20 now so it may move upward again.” And so on.\n\nThis is about as far as resistance levels go. If it passes 1.50 the asset may have suddenly become popular on its merits, or because people turned to dislike against something else. If it drops to 1.10 there may be a crisis of confidence, or just something more shiny in the market.\n\nInitial guesses on pricing movement have a certain respectability that secondary guesses, based on a second if, seldom have. Arcane runes aside, one might find oneself equally well-briefed by picking up the Wall Street Journal or the Financial Times and checking the headlines.\n\nWell, dear reader, there we leave it. Apply the words above as you see fit, from with interest through to distain, and all the stances in between. But never forget that neither stars nor sticks nor incantations have ever foretold the future, nor will they."}, {"title": "Former Ripple CTO Jed McCaleb continues to dump his XRP holdings with 322.3 million remaining in his \"tacostand\" wallet", "score": 30, "url": "https://u.today/jed-mccaleb-shifts-202-million-xrp-over-past-10-days-while-xrp-keeps-holding-above-1", "selftext": ""}, {"title": "So what’s the deal with dogecoin at the moment?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvqco/so_whats_the_deal_with_dogecoin_at_the_moment/", "selftext": "From what I can see it is unfortunately still going strong, still attracting masses and is probably on its way to $1.\n\nAre we expecting it to all come crumbling down at some point? I hate that dogecoin is so prevalent in the market. It gives a terrible name to those businesses that are trying to market their coins with real life use cases and the potential to change the dynamic of cryptocurrency in general.\n\nI hate Elon Musk for tweeting about it. That’s what started this whole mess. I just hope doge eventually fades into the abyss taking those with it that thought it had some use in the world. It’s a scam."}, {"title": "Hey Mods, why the bias?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvpj1/hey_mods_why_the_bias/", "selftext": "I recently tried to share some good news about Monero developments and my post was deleted because “a better quality post exists on the front page” HOWEVER when scrolling through this sub, I’m BOMBARDED with REPETITIVE posts about BTC and ETH “news”. \n\nBTC losing its dominance has been posted and reposted ad nauseam. \n\nWhat this leads me to believe is that the rule is “BTC and ETH” take priority over other crypto currencies and that the rules aren’t enforced unbiasedly. \n\nWhy is this?\n\nHas anyone else noticed this?\n\nWas I wrong in thinking that this sub was for the discussion and promotion of all viable, legitimate crypto currencies and even those that aren’t? \n\nMuch love."}, {"title": "Ethereum gas fees situation", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvo4u/ethereum_gas_fees_situation/", "selftext": "We all noticed the drastically lower and awaited gas fees on the ethereum network. I heard this is due to the increased gas limit and current lower market congestion. \n\nMy question is will these lower gas prices sustain or are we expecting them to rise again when the demand returns?\nThanks in advance."}, {"title": "I did something pretty stupid and would appreciate some help fixing it.", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvn4v/i_did_something_pretty_stupid_and_would/", "selftext": "Okay, please bare with me here its a bit of a long story. I got into crypto a few weeks ago and being prudent i invested in a few different coins, one being Vechain. I placed it in my trust wallet mobile app. Here comes the stupid, I noticed that I also had these strange \"Vethor\" tokens as well. Being literally two days into crypto i assumed it was a gift of some kind from trust wallet and believing this I promplty sold them like an idiot. Now I understand the purpose of them of course, but I want to move my vechain from trust wallet to exodus because I prefer it as an interface. But I no longer have adequate Vethor tokens to move it. Is my only option to purchase more Vethor to then move my Vechain? or could I wait and just generate more Vethor tokens until there is an adequate amount?  Trust me I appreciate how stupid this sounds but I would appreciate some help in resolving it. Thanks guys and trust me I learned my lesson. No more jumping into things without researching them properly."}, {"title": "For every person claiming huge gains, another 10+ probably got wrecked. Don't get sucked in", "score": 180, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvgpu/for_every_person_claiming_huge_gains_another_10/", "selftext": "We've all seen it. We've all felt it. I'm talking about the **FOMO**. Sucking you in like a 2 for 1 cocktail offer at your local bar.\n\nThe truth is for every person bragging about their HuGe GaInS, there's probably at least another 10 poor souls who blew up their portfolios. How many unsuccessful trades are these guys not showing you?\n\nRecent examples include Doge and SAFEMOON (even typing it feels wrong ugh). People making life changing gains overnight, and your mind goes \"*hmm, why don't I just put a bit in?\"* and before you know it, a drop comes, anxiety floods your body and you panic sell, wiping out some (or even all if you're leveraged) of your portfolio. Sucks, right?\n\nIn reality, the best option for 90% of people is to **buy and hold**(Dollar cost averaging in), taking profits periodically (or DCAing out). Whether you're accumulating a coin you see value in for the long term (talking about the big boys here - BTC, ETH, ADA etc) or you're just looking to take advantage of the bull market, avoiding FOMO is crucial. Here's a few tips that I've picked up during my time here -\n\n1. **Utilize/follow a range of resources and perspectives -** We all love the daily, don't we? But it can be a bit of an echo chamber. Consider looking at other subreddits as well. For every WSB there's a personal finance subreddit who think that crypto is worse than terrorism. But even if you disagree with them, it's healthy to see the other side of the coin (no pun intended lol). And whilst we're at it, try and extend your research to other sites too (YT, Podcasts, Twitter, Coindesk, White papers, General news sites etc etc) Yes these places can be echo chambers too, but just try to follow a range of people (e.g. Benjamin Cowen on YT, macro guys like Raoul Pal on Twitter etc, not just Mo0nboi69). You want to be getting info from as many places as possible. Edit - Read the **monthly skeptics thread** as well found [**here**](https://www.reddit.com/r/CryptoCurrency/comments/mhj2sb/monthly_skeptics_discussion_april_2021/?utm_source=share&utm_medium=web2x&context=3)\n2. **Ask yourself why -** Why are you investing in your chosen coin/project? What is the value proposition? What problem is it *actually* trying to solve? If the project sounds too good to be true then it probably is (\\*cough\\* anything with the word SAFE in \\*cough\\*).\n3. **Ask  the right questions -** If you don't know about something, then please ask questions before investing, but ask the *right* questions. Don't just ask *\"Do you think this project is gonna moons soon\"* or *\"what low cap coin is gonna 10x in the next few weeks?\",* stupid questions get stupid answers.\n4. **Learn the basics -** If you are going to try trading, or just enjoy staring at charts (We all love doing it, right?) then consider learning the basics of charts. Basic patterns, tools etc, there are more than enough videos on YT explaining this. I'd recommend going for one that doesn't just focus on crypto as well, as there is a wider range out there.\n5. **Don't overthink it and don't be greedy -** We're ALL guilty of this. You're sitting at your fiat mining job, just daydreaming about your potential gains. *\"Well I'm already up 3x, BUT if I cash out now I might miss out on 10x and could afford x car or x holiday, so I won't sell\".* I know. It's a tough mental battle. But if you have a gains target that you hit, then try to stick to it. Or failing that, at least consider DCAing out (selling portions of your positions gradually rather than in one go). We all want that big moon shot, but when the gains come it can really play with your mind and emotions.\n\nWell, that just my 2 sats. Should be worth noting that I'm no expert. I'm just another regular guy looking to escape the train wreck that is fiat currency, and become slightly more financially free.\n\nBest of luck guys, I really hope you all hit your goals xo\n\nSide note - I know this is nothing new, just wanted to share my thoughts as we've been getting a big inflow of new folk recently. If you want to accuse me of moon farming, then please just drop a downvote and move along:)"}, {"title": "Yesterday I had the \"it's just fake money\" conversation with my mother in law. We've all had this interaction. How do you like to explain crypto to nonbelievers?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvcny/yesterday_i_had_the_its_just_fake_money/", "selftext": "I usually start out with Bitcoin since that is the well known one. I break the ice by talking about cash: otherwise valueless except we as society give it a value. And that's true with anything and everything. I then mention some high level perks such as the security and inability for counterfeit, things they can relate to easy. Bitcoin has value simply because people value those qualities. Last I mention that each crypto is attempting to solve a real problem, and similarly those coins have value for people who value their solution. I do end with agreeing that a fair portion of crypto is speculation at this stage, because I do believe that, and I think being honest with people on their points will help them take yours into consideration.\n\nWhat do you like to say? Any success stories? Any go terribly wrong?"}, {"title": "Posting here for more visibility - you may have a clever little Crypto-miner running on your PC and not even know it.", "score": 238, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myvaj3/posting_here_for_more_visibility_you_may_have_a/", "selftext": "#SO FAR THREE PEOPLE HAVE MESSAGED ME SAYING MALWAREBYTES FOUND CRYPTOMINING MALWARE ON THEIR PC'S! JUST CHECK IT GUYS, IT'S FREE AND EASY.\n\nDo any of these symptoms sound familiar?  \n\n* Low gaming or PC performance?\n* Sluggish Windows performance? \n* PC has stopped going to sleep when idle?  \n* CPU temps are too hot?  \n\nIf so, you may have some Cryptocurrency mining Malware on your PC.  \n\nThis happened to me a couple years ago, I'm very tech savvy and don't usually have PC problems. Anything that goes wrong hardware I can fix and on the rare occurrence I get a software problem a quick bit of Google-Fu is all I need to get back on track. However, this one stumped me.  \n\nI noticed my PC wasn't sleeping any more. I'd leave it idle and when I came back hours later, it wasn't off. I usually set it to turn off after 30 minutes, but it would stay on, sometimes all night etc. I also noticed that my process was not running at it's Idle clockspeed (FYI, your processor runs slower when it's not doing anything to save power)  and finally, I noticed using HWMonitor that my CPU temps should be at about 40c at idle, were instead about 60-70c!  \n\nI looked through Task Manager to identify if there were any strange looking .exe's and after googling all the application names I did not immediately recognise, I thought to download MalwareBytes and run a scan.  \n\nStraight away it identified I had a cryptocurrency miner on my PC, and this is the part that impresses me, it actually de-activated itself if I went into Task Manager, then re-activated itself when I left. *Clever girl.*  \n\n\nSome quick googling told me it was a Monero Crypto miner malware. God knows how it got on my PC, probably a drive by from a dodgy Crypto newsfeed website. I don't make a habit of downloading and running strange programs nor opening emails I don't trust, so I'm a bit stumped how it got there, but it was running for weeks! Think of all that Monero I mined! The bastards.  \n\nAnyway, MalwareBytes is free to download and use, it will probably pester you to buy it so there's no harm in downloading it, checking your PC and then uninstalling it.\n\nHopefully this helps someone out."}, {"title": "Turkish authorities are investigating two cryptocurrency trading platforms. The investigation is due to an alleged exit scam. Both exchanges halted trading a week ago due to the new crypto rules.", "score": 8, "url": "https://coinquora.com/two-turkish-crypto-exchanges-face-legal-trouble/", "selftext": ""}, {"title": "explorer.bitcoin.com shows wrong BCH balance", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myuzcz/explorerbitcoincom_shows_wrong_bch_balance/", "selftext": "[https://explorer.bitcoin.com/bch/address/bitcoincash:qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa](https://explorer.bitcoin.com/bch/address/bitcoincash:qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa)\n\nshows a balance of 0.0009, whereas\n\n[https://blockchair.com/bitcoin-cash/address/qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa](https://blockchair.com/bitcoin-cash/address/qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa)\n\n[https://bch.btc.com/qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa](https://bch.btc.com/qqy6an02dsr0dvrl9keua8nhuu9s5sjjgs3fsu5hfa)\n\netc show a balance of 0\n\nSeems like quite a weird bug :D"}, {"title": "Anyone else fully lost interest in checking the market?", "score": 54, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myuyu0/anyone_else_fully_lost_interest_in_checking_the/", "selftext": "I started crypto trading in 2017 and I remember checking every hour, seeing if I can move funds, catch a break out, sell before a drop and obsessing all the time.\n\nFast forward to now and I can't even be bothered to check the prices when everyone talks about a \"crash\". It's in there now and I can't do anything anyway.... But the peace of mind is glorious. As if I didn't own the money any more. Now I only ever notice what's up when I add funds or withdraw... Which isn't often.\n\nWhile back then I trusted in myself, which was stupid and cost me some cash, now I trust in crypto and that it isn't going anywhere and it makes me feel secure when thinking about the future."}, {"title": "Newbie Question: I’ve held a coin on the ETH network for awhile. Devs recently created a “V2” of it on BSC, did a “snapshot” and “airdropped” BSC coins to ETH holders. Do I have double my coins now? (More explanation in comments)", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myuygn/newbie_question_ive_held_a_coin_on_the_eth/", "selftext": "So I bought a coin via Uniswap some months back and held that in MetaMask on the ETH main net. \n\nDevs recently created a new version of this coin on the BSC network, took a snapshot I assume of all the coins currently held by ETH main net holders, then airdropped BSC tokens to those holders. \n\nSo for example purposes, let’s say I have 50 of these coins I bought months ago on Uniswap. Been holding those 50 in metamask on the ETH main net.\n\nThen there’s the V2 announcement and the BSC  airdrop. After the airdrop, I got on my MetaMask, created my BSC wallet and put in the token address.\n\nI now see I have 50 coins on the BSC network and when I switch to the Eth network I also have 50.\n\nNow granted, the coins on the Eth network dropped in value dramatically after that switch, so I don’t actually have the same amount of USD value on that anymore, which I’m not worried about since I do have a good value/return on my coins that have been airdropped to me on the BSC side. \n\nMy main question is, do I have double my coins now?\n\nLike in theory if the ETH side were to go up and the value of the coin was the same on both the ETH side and the BSC side, do I have double the money now as well?\n\nAgain, no big if not, just wondering. \n\nThanks!"}, {"title": "[Unpopular opinion?] Bitcoin is a terrible store of value", "score": 84, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myuwne/unpopular_opinion_bitcoin_is_a_terrible_store_of/", "selftext": "**Tl;dr: Bitcoin is a terrible store of value because consensus centralises over time, degrading its value as a decentralized store of value. Our focus on Bitcoin causes us to dismiss a true decentralized store of value, and is bad for crypto in the long term.**\n\nAfter having first been thought up as a peer to peer electronic cash system, most Bitcoin enthusiasts have now shifted to seeing Bitcoin as being a store of value, a digital gold. My argument: Bitcoin is a terrible store of value. Anyone that claims that it's a fantastic store of value is either misinformed or pumping their bags to unload on those dumber/later than them. \n\nMy primary reason for saying Bitcoin is a terrible SoV:\n\n**Bitcoin's security**\n\nBitcoin's status as a decentralized digital store of value comes from, obviously, it being decentralized. It **should** therefore be seen as quite surprising that the consensus mechanism of Bitcoin, PoW mining using mostly ASICs, leads to centralization over time. Bitcoin mining is a business with economies of scale:\n\n1. Bigger size means negotiating power - with ASIC manufacturers for discounts, with energy producers for cheaper and more stable energy.\n2. Bigger size means cheaper capital - meaning that the discounted ASICs and energy can be paid for using cheaper funding.\n3. Bigger size means cheaper ASIC maintenance - as any data center employee will tell you.\n\nThere are myriad other small ways in which scale helps Bitcoin miners save on costs. Now, given a (1) reward for mining Bitcoin blocks and (2) economies of scale in costs for mining these blocks, it doesn't take a genius to figure out that this inherently leads to the big getting bigger.\n\nI'm not just making this up. If you're interested in research that looks into this feedback loop, see:\n\n* [Minting Money with Megawatts](https://ieeexplore.ieee.org/stamp/stamp.jsp?reload=true&tp=&arnumber=7547426)\n* [Trend of centralization in Bitcoin's distributed network](https://ieeexplore.ieee.org/abstract/document/7176229) (which aptly states:  Centralization, due its simplicity, is a phenomenon that happens to any  disciplined and organized system automatically, which in case of Bitcoin  is against the pure initial decentralized nature of it and might arise some concerns and threats to the Bitcoin's unforeseeable future.)\n* [Taxonomy of centralization in public blockchain systems: A systematic literature review](https://www.sciencedirect.com/science/article/pii/S0306457321000844)\n* [Decentralization in Bitcoin and Ethereum Networks](https://arxiv.org/pdf/1801.03998.pdf)\n* And finally, because I promised myself I'd only cite 5, and because some people might say \"yes, but miners in mining pools can just leave their pool and join a different one!\": [A Deep Dive into Bitcoin Mining Pools](https://weis2019.econinfosec.org/wp-content/uploads/sites/6/2019/05/WEIS_2019_paper_30.pdf).\n\nIn short: economies of scale combined with mining rewards (fees + subsidy) both incentivise and rationally lead to the big getting bigger, leading to an oligopoly or monopoly. To add to that, any monopolist/oligopolist worth their salt could pretend to not hold a large proportion of hashrate.\n\n**Secondary, relatively minor blows to Bitcoin as a SoV:**\n\nBeing a store of value ultimately depends on **transactability** in the future. Gold is seen as a store of value because it is trustless - in a worst case scenario, I can carry around gold, hand it to you in exchange for goods and services, you can weigh it, verify it, and we'll happily trade. This can be very valuable during points in time (or geographical locations) where trust in currencies are lost, hence \"trustless\". \n\nBitcoin is technically trustless, but try handing some over in exchange for goods and services. It'd take a $50 fee currently, while you'd also have to awkwardly wait around for an hour or so to confirm that the transaction settled. Fine for large sums, not so fine if you have to do this every week, or every day, or in a country where $50 is a large sum.\n\nThe above is why we're seeing a move to 2nd layers. Bitcoin is practically unusable on its base layer. Now, don't get me started on Lightning, which is **still** expensive as opening/changing/closing channels happens on-chain, or you have to use a custodial solution, plus you throw away all security by using Lightning as you're now vulnerable to [Flood & Loot attacks](https://arxiv.org/abs/2006.08513).\n\nI could add that Bitcoin's energy usage will disqualify it as a store of value for more and more institutional investors, but that deserves a post of its own.\n\n**My sad conclusion:**\n\nBitcoin is a terrible store of value for the long term. To be fair, I think that gold is too, as I think there comes a time when asteroid mining becomes viable. Do I think all crypto are a terrible store of value? No, I'm in crypto because I believe that the technology is there to have a decentralised store of value, it's just not Bitcoin. [I've written extensively about why I believe Nano is that store of value](https://senatusspqr.medium.com/why-nano-is-the-ultimate-store-of-value-and-reserve-currency-3b0318844bc8), my primary argument being that Nano has game theory that leads to decentralization over time. It also scales, meaning that trustless settlement remains possible for more than 7 people per second, and will remain a viable option for institutions because it has extremely low energy usage.\n\nSo why do I call this a sad conclusion? Because Bitcoin has a trillion dollar market cap, predicated mostly on it being a store of value. If I can figure out that Bitcoin's centralisation over time degrades its value proposition, and researchers can figure this out, then Bitcoin \"influencers\" must also know this. Institutional investors and those at the very top must know this, and probably know it far better than those of us investing small sums into Bitcoin. At some point, those big investors are going to sell, and we are only going to find out a month later, after the price has declined a lot. Rest assured that the big investors won't be the ones left holding the bag, nor will they give you a heads up before they shift out of Bitcoin.\n\nAt the risk of this post sounding like a Nano shill post rather than a fair analysis of Bitcoin's faults, I would urge anyone to think this through for themselves and compare Bitcoin's long-term value proposition to that of Nano. I believe that crypto genuinely offers us the chance of having a scaleable, hard money, and that our focus on Bitcoin rather than cryptocurrencies such as Nano [that actually offer this](https://senatusspqr.medium.com/why-nano-is-the-ultimate-store-of-value-and-reserve-currency-3b0318844bc8) is extremely detrimental to crypto in the long term. I'd also much prefer to have the people on here be the first ones to make this shift, rather than institutions or big investors.\n\nIf anyone's actually read all this, then thanks a lot and I'd love to hear your opinion on this. I think it's vital for the future of cryptocurrency as a whole, and would love to discuss this."}, {"title": "Just an absolute shit post.", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myukuz/just_an_absolute_shit_post/", "selftext": "\"Oh shit, BTC is under 50k!\", I exclaimed. \n\nShe looked at me with deafening silence, and in her eye, the unmistakable touch of contempt - a look I've gotten a very familiar with over the years.\n\nI continued: \"What,? That just means it's a great time to buy more babe! Don't worry, these things happen all the time. The important thing to remember is to Dollar Cost Always, especially on days like this because the blockchain proof of auth- eh- the tech thingy hasn't changed, its just some silly FUD - thats Fear Uncertainy and Doge I think - that Biden bucks Tethered IIRC\". \n\n\"And...?\" She said, clearly not happy with my financial advice about buying when theres blood in the sheets.\n\n\"And LINK is almost 30% off its all time height! Once stalking is activated it's gonna be off the blockchain ehehe. Have you heard of derivatives? Me neither but its like a quadrazillion dollar market cap, and if Link just gets a percent of that, that means a summer house in the Europas for sure\"\n\nAgain, just dead eyes. Maybe she's just not cut out for this crypto lyfe.\n\nI give up, I'll change the subject before coming up with an excuse to go to the bathroom and buy the dip. I gotta play this juuust right.\n\n\"What time is it?\" i ask totally casually.\n\n\"...that's what I asked you two minutes ago. That was the reason you got your phone out\"\n\n\"Oh, hehe. I forgot, hold on lemme check... Oh shit BTC is over 50k now!! Shoulda bought when I told you, babe. Time is money, you know?\""}, {"title": "Why fear a crash?", "score": 9, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myubwc/why_fear_a_crash/", "selftext": "A lot of people on here are obsessed with predicting the next “crash” an event that they consider inevitable given BTC’s history.\n\nMy question to you is, how many people who bought and hodl BTC at the height of the last bull run are in the red today?\n\nAnswer: Zero\n\nObviously this doesn’t apply to anyone hoping to increase their position by selling pre-crash and buying back in, but if your plan is to hodl your coins, wtf are y’all so worried about?\n\nIf a crash is inevitable, then so is the bull market that will follow it. If you haven’t learned from history to simply hodl through such an event, then you’ve learned nothing from the past. Ultimately the point is that NOTHING is inevitable. If you are terrified of the coming crash, you are stressing yourself for no reason. If you actually believe it is inevitable then you should know exactly what to do when the time comes. \n\nBest of luck to all!"}, {"title": "South Korean Prime Minister nominee to look into controversial crypto tax law", "score": 4, "url": "https://www.advfn.com/stock-market/COIN/BTCUSD/crypto-news/84909960/south-korean-prime-minister-nominee-to-look-into-c", "selftext": ""}, {"title": "Is Coinchase a scam site?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mytyry/is_coinchase_a_scam_site/", "selftext": "Hi,\n\nJoined coinchase about a month ago, did the usual scam checks and couldnt find much information, most places list it as \"new, unsure\" They offer some free coin so I staked that on 30 days and did the verification. Fast forward 30 days, I am unable to withdraw the staked verification as the verification hasnt passed yet despite stating 2-4 days, and their customer service doesnt respond (sent them an email 2 weeks ago!)\n\nBit worried now I have shared my verification details with a scam outfit, they seem to have little presence anywhere and are not responding. \n\nPosting in-case anyone knows about if they are legit or not, or at worst, to warn others!"}, {"title": "Sh*tcoins like Safemoon are creating unrealistic expectations in the Crypto world", "score": 1164, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mytvup/shtcoins_like_safemoon_are_creating_unrealistic/", "selftext": "I got into crypto a few months ago with the intent of making gains long term. I knew it wouldn't happen over night. Sure, I have made some gains since I got in... but not enough to make a difference in my life. That kind of thing takes time.\n\nNow comes along Safemoon and it's many MANY knockoffs. Everybody is now looking for the next get-rich-quick coin. It has created an impatient mentality in the space that is not good at all. People are dropping money they can't afford to lose on shitty coins that are just Safemoon clones... and they are losing. \n\nPeople need to understand that, while there are outliers, earning on an investment takes time. If you're the type person seriously asking 'When moon?' or 'When Lambo?'... then you need to rethink your view of cryptocurrency. Life changing wealth does not happen in an instant."}, {"title": "Taiwan set to rollout new AML regulations for crypto exchanges", "score": 1, "url": "https://forkast.news/crypto-exchange-aml-regulation-taiwan/", "selftext": ""}, {"title": "Did I done goof? Coinbase pro", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myt25p/did_i_done_goof_coinbase_pro/", "selftext": "Crypto supernoob here.\n\nI opened a Coinbase Pro account and tried to buy some ADA (minor amount). I can see the amount on the Coinbase website, but on my Coinbase Pro app it isn't there. Have I done goof?  I was attempting to use Pro (and thought I was) but when it tries to verify you, it kicks you to Coinbase URL so I may have bought it under standard Coinbase not Pro.\n\nAre the accounts/platforms interchangeable?"}, {"title": "What happens if USDT crashes/gets banned while using it to borrow margin?", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myt0kc/what_happens_if_usdt_crashesgets_banned_while/", "selftext": "I have some cross margin borrowed in USDT that I use to trade in Binance. What would happen if Tether crashes or gets banned or delisted? May this turn out to be good for me, maybe like I don't need to repay the borrowed USDTs?"}, {"title": "FOMO, Money Loss & other amenities", "score": 8, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myszft/fomo_money_loss_other_amenities/", "selftext": "I guys, i'm in Crypto since January and i saw other dips but the last one i'll admit scared me.\n\nI removed my cryptocurrencies from the wallet and moved them to coinbase to be able to sell them more quickly.\n\nI realized that since January I have been constantly looking at the phone to see the market trend, I watch videos and listen to podcasts almost continuously and I don't sleep as well as I used to, I often wake up during the night especially in dip moments.\n\nI started breathing again just now when i saw the last pump and I'm thinking of slowing down a little with crypto.\n\nSo i'm asking if you have noticed these problems too and how you deal with them.\n\nTake care."}, {"title": "A potential Indian crypto ban. What are my options?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myq5js/a_potential_indian_crypto_ban_what_are_my_options/", "selftext": "I have a feeling India's government will soon ban crypto and no matter the ill effects they won't admit a mistake and go back cause they're a bunch of strongmen cunts. \n\nSo how I keep my crypto safe? I'm assuming that only exchanges would be banned. So would I need to deposit all my crypto into a hardware wallet to ensure they can't get to it. Then maybe in the future I can get a friend to in a different country to withdraw it and convert it to fiat?"}, {"title": "A mistake people made with the internet, and now with crypto... (Great Tweet by @balajis)", "score": 8, "url": "https://twitter.com/balajis/status/1385572764485001221", "selftext": ""}, {"title": "What are the various Myths about Bitcoin in your country ??", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mysl56/what_are_the_various_myths_about_bitcoin_in_your/", "selftext": "I found it funny when I get to know about the myth and misconceptions people(in my country) have about the crypto currencies and how they work,then I take time to explain them as much as I have learned from this place.Here are the some myths people usually believe in lack of information.\n\n1.Bitcoin is only used for illegal activities : Now here's the thing – cryptocurrencies are making their way in the world as forms of money. If someone were to carry out some criminal or illegal activity and used bitcoins, that does not mean bitcoins are just for illicit activities.Criminals mostly use Fiat currency to carry out their criminal activities,they are doing it from so long.\nThe illegality debate stems from the fact that cryptocurrencies are not regulated. So yes, the Silk Road Raid incident of 2013 was an example of millions of dollars in bitcoins being used for drug and human trafficking. But let that not tarnish the entire system of blockchain and cryptocurrency as illegal. If bitcoins were never invented, real money would have been involved.\n \n2.Bitcoin network is prone to hacks : Cryptocurrencies are traded on platforms, just like other regular trading platforms. Since its launch in bitcoins have never suffered an attack on their network or blockchain. Protocol and cryptography rules have worked flawlessly over the years, and the system has shown no record of money theft or weakness in the system.\n\n3.BTC transactions are anonymous and untraceable: the cryptocurrency bitcoin blockchain is a public ledger that maintains a record of everything. Anonymity exists, but identifying user and user-details is not that much of a difficult task in extreme cases. The cryptocurrency system provides user anonymity just like any other system or platform, but it is not absolute anonymity.\n\n4. Bitcoin is not taxed: Cryptocurrencies are decentralized – there is no central regulatory authority, and no banks are involved. But that does not mean that cryptocurrencies can evade taxation. Any transaction in cryptocurrency, be it buying or selling, has tax implications.\n\n5. Only leading developers can make blockchains: The original bitcoin protocol is open source, and anyone can access and modify it. This is known as forking the bitcoin blockchain. All the different cryptocurrencies are different variations of bitcoins in some shape or form. For a long time, there was a myth that only leading developers could create blockchains. But with websites like forkgen.tech, anyone can fork the bitcoin blockchain and make their own cryptocurrency.\n\n6.Bitcoin is Blockchain and Blockchain is Bitcoin : \nBitcoins are globally known as blockchain technology, and because of that, both are used interchangeably. In layman's terms, blockchain technology supports bitcoins, and bitcoin is the cryptocurrency that makes peer-to-peer transactions possible.It is not wrong to assume that blockchain technology is critically essential for all cryptocurrencies.But  IOTA is a cryptocurrency that is blockchain-less and uses directed acyclic graphs to provide security.\n\nWhat are the various Myths you have heard about BTC and other Crypto currencies ??"}, {"title": "As the Crypto world starts gaining some momentum again, stay safe. Don't use crazy amounts of leverage.", "score": 129, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mysf9r/as_the_crypto_world_starts_gaining_some_momentum/", "selftext": "We saw $7.6 billion in crypto long positions liquidated in one hour when the BTC market collapsed to 52k$ about a week ago. Corrections are bound to happen in the future as we are still early on crypto adaption. I hate to see people lose their savings in a blink, because they didn't manage their risk properly when entering a trade.\n\nI know this has been said many times in the past, but please stay safe and only invest what you can afford to lose on the markets, especially if you don't have too much experience in trading yet!"}, {"title": "U.S. Taxes - If you didn't have to pay capital gains, what what you do?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mys0dr/us_taxes_if_you_didnt_have_to_pay_capital_gains/", "selftext": "For everyone living in the United States, tax law is, well, complicated to say the least.  For every short term capital gain (selling something you owned for less than a year), you have to pay up to 40% of the profit (buying cost minus selling cost) to the Government.  Now lets imagine the U.S. passed a law removing capital gains from crypto transactions.  What would you do?"}, {"title": "Everything we thought we knew about Elon Musk was wrong", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myrp2y/everything_we_thought_we_knew_about_elon_musk_was/", "selftext": "Proof that Elon Musk has been playing 69D chess with us since birth:\n\nElon Musk\n\nElon\n\nE-lon\n\nLON = [League of Nations](https://en.wikipedia.org/wiki/League_of_Nations), the first **worldwide intergovernmental organization to maintain world peace**\n\nE = electronic\n\nE-LON = Electronic League of Nations\n\nWhat has united people across all nations this year in the name of world peace? That's right. Dogecoin, which Elon has tweeted about. It all comes together.\n\nThis is not financial"}, {"title": "Scientist Who Says He Created Bitcoin Can Sue Mystery Website", "score": 5, "url": "https://www.ndtv.com/world-news/scientist-who-says-he-created-bitcoin-can-sue-mystery-website-2421992", "selftext": ""}, {"title": "Dogecoin is equally as bad as it is good for crypto space", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myriha/dogecoin_is_equally_as_bad_as_it_is_good_for/", "selftext": "This sub is divided in 2 half whether the doge is good or not..so let me express my views on it\n\nPros-\n\n*Brought many new young investers like myself in crypto\n\n*Taught us important lesson about supply and demand\n\n*Made it to mainstream media more than bitcoin this year which ultimately increased number of investors\n\nCons-\n\n*No real use case\n\n*Mixed crypto with gambling\n\n*Bad tokenomics\n\n*Paved the path for other shitcoins like safemoon"}, {"title": "Anybody ever actually experience the Communist Bugs Bunny \"Our Bitcoin\" meme in real life?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myrh00/anybody_ever_actually_experience_the_communist/", "selftext": "That is your significant other or ex was against you risking your money in Crypto, but after some gains felt like it was partly theirs? \n\nI know that it's a meme, but I think that there's a lot to it. You're probably better off keeping your Crypto holdings 100% to yourself even though the urge to brag can be really high. \n\nWhere I'm from, if you have wealth, particularly property, the unwritten rule is to not talk about it. \n\nThoughts?"}, {"title": "How can one transfer his/her moons to an exchange as usdt or just withdraw them as fiat to buy cookies?", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myrd0g/how_can_one_transfer_hisher_moons_to_an_exchange/", "selftext": "Lets say John has 2 moons in his reddit wallet, he wanted to send his moons to Binance to buy some random coins via usdt or to withdraw and just buy an cookie, what would be the procedure in this case?  (definitely asking for a friend) Thanks in advance."}, {"title": "Popular or unpopular opinion: People who say they wish that it would’ve dipped more are annoying.", "score": 350, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myr7vt/popular_or_unpopular_opinion_people_who_say_they/", "selftext": "Just got done reading a post in the daily and the person was wishing it would dip more so their buy order would get triggered. I’m not sure about you but I’m down 15-30% across all my portfolios from ATH. The past week has been an absolute bloodbath. If someone really wants to buy a coin then just do it. Most coins are still down at least 15% from ATH. So don’t complain or worse yet wish that it would dip more. We get it, you’re a crypto savant and only buy when the green line crosses the red line on the 236 hour MA or whatever other tea leave reading TA you do. Thank you in advance for not doing this anymore and do us all a favor and just buy now."}, {"title": "Pump and dump discord channel promoted on this sub?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myr3ah/pump_and_dump_discord_channel_promoted_on_this_sub/", "selftext": "I just saw a promoted ad on an r/cc post for what appears to be a pump and dump group. I wasn’t able to find a report option on mobile. Hoping a mod can see this and do something about it if they are in fact trying to lure people in to a pump and dump scheme."}, {"title": "Isn’t bitcoin inflationary till 21 million coins are mined?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myr33i/isnt_bitcoin_inflationary_till_21_million_coins/", "selftext": "As I understand, more bitcoin is mined every day, therefor doesn’t more money have to go into it each day just to remain at the same price? Doesn’t that make it inflationary? Seems to go against the idea that it’s deflationary. Sure, when we hit the supply cap then that’ll be true. Till then, isn’t it inflationary?\n\nI thought about this cause I heard people saying the problem with doge coin is that it’s inflationary cause of mining. I don’t understand how bitcoin is any different, other than the fact that it’ll cap eventually.\n\nHoping to better understand this. Cheers"}, {"title": "What'd did you do with your spare time during the dip?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myr0b5/whatd_did_you_do_with_your_spare_time_during_the/", "selftext": "I try my best to avoid the charts (and partially this sub) during big dips for my anxiety. Personally, I started playing Breath of the Wild on switch, which is an insanely good game. Judging by the slow scene around here the past few days many of you have been doing similar. Whatve you guys been up to with your spare time? (Good to be back, by the way)"}, {"title": "What are some sustainability, ethical, and legal issues of Blockchain technology?", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myqpr1/what_are_some_sustainability_ethical_and_legal/", "selftext": "So I'm writing a paper on blockchain but there doesn't seem to be much information online about the ethical or legal issues of blockchain, at least not what I can find. For sustainability there's the obvious energy usage when it comes to a proof of work blockchain, but what about proof of stake? Are there any sustainability issues for proof of stake? \n\nWhen it comes to legal the most I can think of is that crypto is used fairly often for buying and selling drugs on the darkweb, so that may be one legal issue. \n\nEthical I'm probably missing something but I'm completely stumped about what I could talk about when it comes to the ethical issues of blockchain.\n\nAny help would be greatly appreciated.\n\nThank you."}, {"title": "TIFU by giving my crypto to a scam", "score": 16, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myqn4j/tifu_by_giving_my_crypto_to_a_scam/", "selftext": "Today, I have learned a very expensive lesson. I got greedy. I ignored the 1 million red flags. I pushed away all my inner warnings. I lost 5100 XRP by being dumb. \n\nThe YouTube live stream looked legit AT FIRST GLANCE. Did I ignore the spelling mistakes? Yes. Did I not do my due diligence and look at their empty history? YUP. Did I go to the website that barely worked and ignore my entire brain screaming at me because I wanted to see the doubled gains? Yes. \n\nI stopped thinking of it as money and started playing with it like a game. DON'T BE ME.\n\nI hate myself. I want to cry, but I'm afraid if I do I will throw up. Please learn from my $7000CAD lesson. \n\nNOTE: I have contacted Atomic wallet with all the hash information. I have also contacted a few companies that say they specialize in this kind of thing (I hope/think). I fear my chances of any kind of recovery are zero."}, {"title": "People mostly talk about how crypto made them rich but no one talk about getting rekt...", "score": 10, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myq2qr/people_mostly_talk_about_how_crypto_made_them/", "selftext": "I personally started crypto in January and would have made a lot of money if i had just invested in a coin and holded but instead i took margin and overtraded and lost 90% of my portfolio..i had finally made peace with it but believe me when i say it was hard...i mean i invested in doge but sold at loss..i invested in mith but sold at loss.. invested in eth and bnb but sold at very little profit...and i m sure many other newbies did the same \"buy high sell low\" thing and i know its funny and unbelievable but its pretty much true...\n\nIt had really affected my mental health that how i lost a winning race and found it really funny how every coin i ever invested atleast 3x from January...but i lost 90% of it...\n\nI m just 19yo but invested money which was self earned but for a third world country citizen it was big amount (270$ to 30$)..also i read a post about some guy complaining how third world country have good internet so i want to clear that i m from india and it only cost like 0.1$ for 1GB data...its the cheapest here..\n\n\nI just want to say that if you too lost money in crypto you are just in maximum type of people and there are many people who lost money ...just keep calm and improving your knowledge about crypto and get some experience before reinvesting..."}, {"title": "How is safemoon actually a scam or rugpull?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myq2jp/how_is_safemoon_actually_a_scam_or_rugpull/", "selftext": "I apologize in advance for talking about safemoon after the inundation of spam but i think all the spam is preventing proper discussion, and the way i understand it there may be something to the token. I'm hoping for some well informed discussion and explanations of exactly how and why it could be a rug pull, or what else is going on with this token.\n\nDoes anyone have clear evidence that it is? My biggest reason for thinking it isn't is that the idea of a deflationary coin in itself is incredibly rewarding for someone who gets in early, so the creators have no need to plan a rug pull or complicated scam.\n\nSafemoon takes 10% from each transaction and reinvests in itself. 5% goes directly to holders and 5% is burned, increasing the value of the remaining tokens. It taxes transactions at 10%, a huge number, and rewards holders with that.\n\nCirculating supply is a bit more than 600,000,000,000,000 right now, when all is burned 1,000,000,000,000 will be left. That's 600 times less, meaning each remaining safemoon will be worth 600 more based just on rewards taken from transactions. At the recent $4b market cap, that would mean a per token price of $.004. $100 invested now will become worth $60000 just from the deflation/rewards taken from those who transacted their safemoons and were taxed.\n\nI can see how it's very ponzi schemey, but unless there's some hidden shenanigans in the code, it's just a token with a built in mechanism for greatly rewarding early adopters and long term holders. Those who sell agree to give 10% back. If people keep transacting until all sm is burned, which seems like it will happen very fast with recent volumes, holders will by design be rewarded with 600x gains from holding. \n\nAll you need to be successful is to get in relatively early and get out after the burning, the tokenomics should reward you. Since so many of these projects were launched around the same time, the most viral one will grow fastest and \"work\" as designed, and safemoon clearly has the most intense (albeit spammy) marketing, and is well on its way to succeeding with 40% burned after only a couple months of existence.\n\nAm i misunderstanding or missing something?"}, {"title": "Emily Ratajkowski Will Sell NFT in Effort to ‘Reclaim My Image’", "score": 2, "url": "https://decrypt.co/69042/emily-ratajkowski-will-sell-nft-in-effort-to-reclaim-my-image", "selftext": ""}, {"title": "I bought some BNB on trust and it hasn't shown up in my wallet, but the transaction says it's pending in my checking account.", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypufs/i_bought_some_bnb_on_trust_and_it_hasnt_shown_up/", "selftext": " \n\nTrust isn't showing me that I even bought any BNB, will it eventually show up once the pending transaction in my checking account goes through?\n\nThis might seem like a dumb question but this is my first time using Trust Wallet and I would expect something to show up on the app even if the transaction hasn't gone through yet.\n\nCan anyone help?"}, {"title": "There is now a an actual shit coin - introducing ,poo coin‘", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myptu9/there_is_now_a_an_actual_shit_coin_introducing/", "selftext": "\nJust when You think coin names couldn’t get any worse we now have an actual shit coin.\n\nAm i missing the joke ? Are people actually looking at this and thinking ‚yeh that’s where I’m gonna invest my cash‘ \n\nAn 8% tax on transactions ? Where have I seen this before.... Think things are getting out of hand here ...\n\nhttps://coinmarketcap.com/currencies/poocoin/"}, {"title": "Bitcoin is not the best coin out there by far", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypqxg/bitcoin_is_not_the_best_coin_out_there_by_far/", "selftext": "It is a common misconception that bitcoin is by far better then any other coin or token and that is why it sits at the top. This is a lie, there are many other coins better then bitcoin when you are looking at transactions and being used as an actual currency. \n\nI saw a comment the other day which said coal has a much better use case then gold but that doesn’t mean it could replace what gold does. Bitcoin is a store of value and had major first mover advantage over everything else. This is why it sits at the top. \n\nThis isn’t to say that bitcoin isn’t an amazing invention and it is definitely world changing technology. I’m just clearing up a misconception.\n\nEdit: idc if you keep downvoting, new people need to know this\n\nEdit: was invited to controversial reddit sub because of the amount of downvotes this got"}, {"title": "Africa deal of cardano can be a bad signal rather than good...", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypp70/africa_deal_of_cardano_can_be_a_bad_signal_rather/", "selftext": "Ok just hear me out once..i also hold ada and will hold for long term but people are getting anxious and angry as there was no breakout for a long time...and then when the africa deal announcement came out..btc crashed...\n\n\nAfrica deal was long awaited and many people are holding it for this event only...so if this somehow doesn't be as good as expected..ada gonna crash hard (real hard)...\n\n\nI also browsed cardano sub for a while and those guys are anxious too...\n\n\nCardano is a great project but if they mess up this opportunity..it will be bad for cardano....\n\n\nI just hope everything goes well..."}, {"title": "For the love of god, send a dummy transaction before sending your whole stack.", "score": 1793, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypnsb/for_the_love_of_god_send_a_dummy_transaction/", "selftext": "Title.\n\nI have seen so many posts about people mistyping addresses and losing their crypto recently. I am posting this again before some dude inevitably does the same thing again.\n\nPaying fees twice is worth the peace of mind. If you're sending a small amount and it's a crypto with high fees (BTC, ETH), I'd either leave it on an exchange if it's there, wait until ETH 2.0 if it's ETH, or just send away if its so small that you won't get bummed out if you lost it.\n\nAnything else and there should be absolutely no excuse for you not to send a dummy transaction."}, {"title": "A Crypto Noob's tale: There and Back Again.", "score": 10, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypjsj/a_crypto_noobs_tale_there_and_back_again/", "selftext": "So I had been eyeing crypto investment and have a very risk averse spouse, but I finally managed to put $500 out there and make it dance.\n\nThis is my story over the past week and like all good investment stories it starts with a friend code to Robinhood.\n\nI start my journey with $50 in Doge at 32 cents a coin. I sell when Doge dips hard on its own holiday and rub it's belly for getting me into the space. Hold some Ether. Quickly realize I don't actually own the coins with Robinhood. Open a Coinbase with $450 USDC. I now have Coinbase + Robinhood. Research a bunch of coins. Swap to ATOM while I think. Miss out on an ICO because I failed to realize some things take time with Coinbase. Decide I need a new wallet due to Coinbase limitations. Download Atomic wallet. Download Exodus wallet. Download MetaMask wallet and decide to lock in on DeFi. Convert ATOM to Uniswap and send it to my new MetaMask wallet. See the ICO I missed available as DeFi already and decide I want to convert over to it.\n\nThen I realize you need gas for swaps but I don't have Ether. Everything is UNI. I then also realize I can't convert from UNI to Ether because I need gas for that too. I can't even leave this wallet without Ether.\n\nMost recent chess move: Sell $50 Robinhood Ether to buy real Ether tomorrow...\n\nAnd that's how I ended up trapped in the Etherium network!\n\nThe bright side: UNI is doing ok right now.\n\nThought I would share at minimum so noobs can be aware of the fact that if you are trading and swapping around before you settle on a coin- Etherium network does not play games. It's like at least $20 to swap things around as far as I can tell. And you have to have that $20 in Ether.\n\nMeasure twice children. Cut once."}, {"title": "What would happen if there is low liquidity in comparison to circulating supply ?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mypa74/what_would_happen_if_there_is_low_liquidity_in/", "selftext": "Can anyone one of you experts in this field help me understand this ? Let's say the total liquidity is 2.5% of circulating supply. And say the market cap is 20 Million USD. Is this a low percentage of liquidity ? If so how would it impact the price of the currency ?"}, {"title": "Stop the world please, I’d like to get off - Ellen is dropping an NFT of a stick cat drawing.", "score": 9, "url": "https://www.bitski.com/ellen?fbclid=IwAR1xQkd5j0BeIbfQnZUxilfR9cSWLyZH4A9bf7BIumRk1WkZSvJ83rm9vyc", "selftext": ""}, {"title": "Should dogecoin actually hit $1 all it shows is how irrational the market is and how little value the other coins actually have.", "score": 52, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myp6eg/should_dogecoin_actually_hit_1_all_it_shows_is/", "selftext": "Dogecoin has no right to ever hit $1 or $10 based on market cap and the fact that 14m coins are mined EVERY DAY. You would need millions of new investment everyday to sustain the coin at $1. If dogecoin coin held at this price, it shows how irrational and greedy the market is. And when everyone is greedy that’s a good sign that there is no intrinsic value at all in the asset. All it proves is how worthless the rest of the crypto market truly is."}, {"title": "Let this be a lesson newbies.", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myp642/let_this_be_a_lesson_newbies/", "selftext": "As you can see how quickly things deteriorated, bears thrive on FUD. The moment the tax thing was announced, they JUMPED on it. And hey, it kinda worked. I really dont think the dip would have been as bad without it, but a dip we were due regardless. This week had record options expiring for BTC, and we were riding on several months high and slowing down a bit. We were not ITM. BEARS cannot tell the future.\n\nAs for my earlier prediction with doge, I couldn't have been more right. We needed this scare to get people away from doge. And look at where we are now. Marketwide uptrend right now, and doge is flat at 26-27. This is why the options market is actually a force for good, its just that sometimes people who hedge can get a bit....manipulative and greedy. We will walk away from this thing skyrocketing, with billions of dollars of new money that flowed right to doge, now going into your alt of choice and BTC.\n\nAs for the lessons learned, NEVER NEVER NEVER should the reason you fuck up a great entry point by selling is from listening to some person on reddit or stocktwitz heavily shorting btc, spreading FUD...as convincing as it sounds. They make a living manipulating people, and holding has its great advantages. Do your own DD, look at options dates, patterns and live trends, even the depth charts for current momentum. Not some guy trying to make more money than he's due. \n\nCheers everyone, its about to be a great week."}, {"title": "There's no \"Currency\" Left in Cryptocurrency, and There Hardly Ever Was", "score": 566, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myp3nt/theres_no_currency_left_in_cryptocurrency_and/", "selftext": "By percentage, what is your *actual* usage of any of these shitcoins for real economic exchange as a currency? And no, cashing out to fiat doesn't count. What *real goods and services* have you actually purcahsed with crypto? I'm gonna guess for the vast majority of you, it's pretty close to zero.\n\nDo the shitcoins you're holding have these properties, REQUIRED to function as a currency:\n\n- Divisibility\n- Durability\n- Portability\n- FUNGIBILITY \n- Recognizability\n- Privacy\n- Limited supply\n\nIf it doesn't have those qualities, it's not money. So no, your transparent chain, premined, heavy inflation, huge fees per transaction, barely functional network, is NOT currency. They're gambling tokens, and you people have a gambling problem. You're not \"revolutionizing paradigms,\" you're not \"fighting the banks,\" you're not doing anything other than speculate on garbage which will never be used as an actual currency.\n\nAnd WHEN this bubble pops, and you lose 90% of your paper wealth, you will have deserved it for being equally as greedy as the banks you hate, but with a much higher level of ignorance than those parasites. Now downvote me."}, {"title": "IRS Launches \"Operation Hidden Treasure\" to Hunt Cryptocurrency Traders Who Have Not Declared Taxes", "score": 50, "url": "https://www.accountingtoday.com/news/irs-sharpens-focus-on-crypto-transactions", "selftext": ""}, {"title": "Ethereum price showing relative strength, but ETH forming an ominous pattern", "score": 2, "url": "https://www.fxstreet.com/cryptocurrencies/news/ethereum-price-showing-relative-strength-but-eth-forming-an-ominous-pattern-202104251902", "selftext": ""}, {"title": "We all warn about certain coins, but what about those who ape on leverage???", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myou2j/we_all_warn_about_certain_coins_but_what_about/", "selftext": "Today I saw a lot of euphoria because we got back to the 50k zone (52k aprox by now)... Celebrating we got a nearby 11% pump from the 47k bottom. Now, these has been also thanks to leverages positions being liquidated. When long positions gets liquidated we all cry, and when the opposite thing happens we all are happy.\nBut on these 2 sides, there are lot of people going x50, x100, x125, getting megarekt and losing money trying to get rich, doing a bet, as those who buy dogecoin, safemoon or whatever pumpcoin.\nDo you do leverage trading?? If so, what multiplier?"}, {"title": "Binance Coin – Downside pressures mount as regulators eye new equity offerings.", "score": 0, "url": "https://www.investingcube.com/binance-coin-downside-pressures-mount-as-regulators-eye-new-equity-offerings/", "selftext": ""}, {"title": "Litecoin (LTC/USD) on shaky ground as price retests major support.", "score": 1, "url": "https://www.investingcube.com/litecoin-ltc-usd-on-shaky-ground-as-price-retests-major-support/", "selftext": ""}, {"title": "People have said they're buying crypto as a hedge against inflation or a crash, but...", "score": 8, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myolp2/people_have_said_theyre_buying_crypto_as_a_hedge/", "selftext": "why wouldn't crypto also crash with the stock market? We saw this happen with bitcoin in March 2020 with the covid crash. \n\nIf I feel like a crash is coming, what should I do with my money? I'm kinda new to investing"}, {"title": "Many technically literate people calling cryptocurrencies a cancer that should be banned. They are so deep into the system that they will defend it to death, while they are getting screwed everyday.", "score": 0, "url": "https://layerci.com/blog/crypto-miners-are-killing-free-ci/", "selftext": ""}, {"title": "Crypto is bad for the environment?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myny89/crypto_is_bad_for_the_environment/", "selftext": "I vaguely remembered last year a headline that says blockchain mining uses more electricity than Argentina.   What I've wondered if renewable energy sources would be less destructive?   In still very new to all this."}, {"title": "How moon gas is paid? I heard that reddit pays them for now, is this true? If so, what can we expect about future of moon gas and its effect on the moons?", "score": 10, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mynvje/how_moon_gas_is_paid_i_heard_that_reddit_pays/", "selftext": "Also some more questions I have are, if moons have no gas for us now, is it true that we can literally transfer 1 moon without paying any fee to any exchange? But if reddit pays them all, wouldn't it have made loss because of peoples transfers? Thanks."}, {"title": "Hard Times", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mynmrl/hard_times/", "selftext": "First of all, I would like to thank the many, many holders throughout this space that wrote posts and tweets for crypto while it was down. Secondly, I want to thank the redditors here for waiting and taking the time, because I know how important it is — Bull Run '21 — is to the holders and it is to r / Cryptocurrency. And with that wait, we got what we wanted: Green candles are back!\n\nI don't have to say a lot more about the way I feel about market manipulators. No respect!  No honor! There is no honor among whales in the first place.  They put hard times on the crypto holders and this space. You don't know what hard times are, daddy!  Hard times are when the Ethereum users around this world are out of work and got four, five tokens stuck, and can't pay their gas fees, can't transfer their coin. Hard times are when the Nano network is under spam attack and they tell them \"transfer delayed!\"  And hard times are when a man has build up a stack for thirty weeks — thirty weeks! — they give him a price dump, kick him in the butt and say \"Hey, we'll take that coin when you sell.\"  That's hard times!  That's hard times.  And panic sellers, you put hard times on this community by taking Bitcoin's price down.  That's hard times!  And we all had hard times together.\n\nI admit, I don't hold as much as the whales do today.  My Eth bad is just a little bit small, my BTC bag is just a little bit small, but brother, I am a HODLer, and they know I'm HODLer.  And whales, market manipulators, let me leave you with this: One way to hurt manipulators is to take what they cherish more than anything in the world. That's majority of crypto's volume.  We will take it.  We've been there before.  This time, when we take it, daddy, we're gonna take it for you, the people. Let's gather for it!  Don't let us down now 'cause we came back you, for those bag holders out there that bought the ATH, that never got the opportunity to see a real gain.  You will.  We're proud of you and thank god we have you.  We love you.  Love you!"}, {"title": "Hedge against a possible Market Crash? Thoughts?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mynlm2/hedge_against_a_possible_market_crash_thoughts/", "selftext": "Me again. Newish investor lmao. Sorry, I’m just addicted to discussion and learning from other people’s minds and their opinions. Leads me to dig deeper and learn more. Anyhow, let me cut straight to my question.\n\nWill cryptocurrency be the “hedge” or “safe haven” for fiat money to go? This has always been a big question or better yet, a concern, of mine moving forward. Again, I’m not saying the Market will collapse or the global economy will either. But i personally, seeing the stock market and all the news surrounding the stock saga exposing the American system.. it leads you to ponder the question “how do i get ahead.”\n\nI know your typical physicals, such as gold and silver, will always be the way to hedge or get ahead of a market collapse. Real estate or anything you can physically touch. But I’m curious as to everyone’s thoughts, especially with bitcoin being compared to “Digital Gold.” \n\nBut then the fear is, another ‘08 and everyone is back out of work, retirement funds dried up and the list goes on. People pulling their savings and taking money out of the bank. Would they do the same with crypto? People may needing that money they’ve invested now because they’re running thin. \n\nOr could this be the introduction to the future? People seeing their crypto raising in price faster because their return is better than the stock market. Being able to stake coins with a higher APY % than a traditional bank. Easier and faster processing of payments? \n\nI know, this is a huge assumption and speculation but I’d love for open-floor discussion into understanding the minds of individuals who have been in the game for some time now and know way more than me. Again, a lot of stock traders are beginning to switch over to crypto because yes.. it is the future, however, they see a nice ROI. But I know with trying to talk with buddies and families, they think it’s a dumb investment and to keep my money safe in case this “Stock Market Crash” comes.."}, {"title": "Why do we buy BTC if it is technologically inferior?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mynhk0/why_do_we_buy_btc_if_it_is_technologically/", "selftext": "I don’t understand. I get that it’s a store of value and it started the whole thing and it’s digital gold and whatever, but why does that make it a good investment. Also, how is it digital gold? Wasn’t gold valued because it’s something in case fiat goes to shit? So how does BTC serve the same purpose if there’s cryptos working towards eliminating the downsides of fiat by replacing it? ELI5 or explain like I’m an idiot, whatever works for me."}, {"title": "What's your biggest regret due to the FOMO", "score": 9, "url": "/r/AskReddit/comments/my7b6s/what_was_that_one_thing_you_tried_out_due_to_fear/", "selftext": ""}, {"title": "I need to sell my crypto on crypto.com", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymws5/i_need_to_sell_my_crypto_on_cryptocom/", "selftext": "Hi everyone, I needed to sell some crypto on crypto.com and it seemed like I needed to make a fiat wallet but a redditor told me this, \"[crypto.com](https://crypto.com) app lets you send fund directly to a connect bank account.  also if you have the CC card, you can just put your fund on there and use them or get them out of an atm depending on how much you have.\" When I asked how they never responded. Do any of you know how or do I need to just make a fiat wallet?"}, {"title": "Stop hating on bitcoin because it's outdated tech. No other crypto would exist if it wasn't for it.", "score": 19, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymtst/stop_hating_on_bitcoin_because_its_outdated_tech/", "selftext": "When bitcoin came out, the technology was revolutionary. It took years for  bitcoin, and thus crypto, to become associated with a good amount of  people in the world. Even then, there was controversy about crypto as a  whole, but bitcoin again and again had stood the tests of time. It was  the bitcoin community that spurred the crypto community.\n\nIt  is only nature for technology to become more optimized and render the  former obsolete. When cars were invented, it used petroleum. We have  electric cars now, which is greener. But people still use and produce gasoline cars  anyways because it is well associated with the world and these  same kinds of cars have served well to society. So does gasoline powered cars  suck? Exactly.\n\nIf it wasn't for the idea of the blockchain and bitcoin's success, no one would have created alt coins in the first place."}, {"title": "How do you deal with self doubts and decision process?", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymqnl/how_do_you_deal_with_self_doubts_and_decision/", "selftext": "I'm sure I'm not the only one with no real life person to discuss crypto strategy with. Obviously my husband and a few other people in my life know I'm holding, but non of them is interested in the process.\n\nEvery time I'm making a move, even just moving from exchange to a wallet I'm doubting myself if it's a good call? If the fees are ok or it's better to wait for when I have bigger posiciones for lower fees?\n\nBigger moves like buying more/ choosing which coin to invest/ moving funds to BlockFi or Celsius - are even worse!\n\nUsually in my daily life talking to someone who knows about that things is part of my process and decision making. Without it I find it really stressful!!\n\nWhat is your strategy? How do you make decisions and deal with the self doubts??"}, {"title": "Worst leader for crypto: Justin Sun, Charles Hoskinson, Vitalik Buterin, Changpeng Zhao or Charlie Lee?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymotc/worst_leader_for_crypto_justin_sun_charles/", "selftext": "Which of these project founders has been the worst leader in their respective communities and for the Crypto industry overall? \n\n\nJustin Sun - TRON and others\n\nCharles Hoskinson - Cardano ADA\n\nVitalik Buterin - Ethereum ETH\n\nChangpeng Zhao (CZ) - Binance BNB\n\nCharlie Lee - Litecoin LTC\n\n\n\nand please say WHY you think they're the worst leader for Crypto."}, {"title": "hi guys i just sent moons form my vauly to an address but missed the last digit of address. any way to get those moons back? :/ or are they gone in space forever?", "score": 15, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymnlp/hi_guys_i_just_sent_moons_form_my_vauly_to_an/", "selftext": "hi guys i just sent moons form my vauly to an address but missed the last digit of address. any way to get those moons back? :/ or are they gone in space forever?been part of this communtiy since 2017 and i sent all my moons except 400 left in my vault . what to do now?\n\nEdit: it was 12000 moons \n\nEdit 2:  i sent them over to   nano trade.  even i didt 2x test transaction first. went smooth. and this time i double checked. and now i chkd in my reddit app vaults. last digit of the address is missing :/"}, {"title": "I could’ve had $3000 but I sent the money to the wrong address", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mymkch/i_couldve_had_3000_but_i_sent_the_money_to_the/", "selftext": "Learn from my mistake, always double and triple check you have put in the right address before you hit send. I sent $500 of an unnamed coin (don’t want to be viewed as a shiller) to a wrong address. That $500 would be worth $3000 as of today! If you are new to crypto try and avoid this be reviewing where you are sending the money too. \n\nI am not phased about it because that $500 could save me losing $5000. I’ve taken it as a lesson and reminding you to be careful so you don’t have to learn the same lesson."}, {"title": "My experience with and tips for BSC shitcoin profits. A story about risk/reward.", "score": 14, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mym8m2/my_experience_with_and_tips_for_bsc_shitcoin/", "selftext": "**Disclaimer**\n\nYou know the drill, this is not financial advice, these are just my personal experiences. I wanted to share this as I've seen a lot of people ridiculing memecoins and BSC projects on here lately and I was the same not too long ago.\n\n&#x200B;\n\n**A quick introduction**\n\nI have been in crypto since 2017. A friend and coworker was constantly talking about it but I had little experience except mining some bitcoin in 2011 (réally wish I didn't stop after a week). I bought some Iota, some Vechain and some other altcoins. The bear market came and I stopped investing and kind of ignored my portfolio while other things in life demanded my attention until early 2020 when I had some money leftover and invested more in crypto. Got some bitcoin, some ADA and stupidly traded my VET. Anyway, the point of all this: I never had much to invest but build around a $2000 portfolio of BTC and alts. Through the fluctuations this year my portfolio has been hovering between $8000 and $10.000 roughly. A nice 5x return, but it took several years.\n\n&#x200B;\n\n**The rise of the meme/shitcoin**\n\nOf course there's always been Doge, but in recent months we've seen the meteoric rise of the BSC memecoin in many different forms. Safemoon, Safestar, Safedog, Safecat, ElonSafe, Safelon. The list is literally endless as they're created faster than I can write them down. I laughed it off at first like many probably did. I had a steady portfolio that I trusted would someday become my retirement fund. Why would I gamble on some pump&dump memecoin that would probably rugpull? \n\n&#x200B;\n\n**One shot, one opportunity**\n\nUntil one day I was feeling lucky and decided to just take a gamble. I researched some projects all night long and picked three different ones. One was Safemoon, one was Fox Finance and the other was Safestar. I will go into the reasoning for these three later. I really was hyped at this point and wanted to invest immediately, but decided to go to bed first. Sleep on it. Next day I still wanted to do it, so I checked the finances, bought the BNB and setup a Trust wallet for my BSC adventures only. I put around $50 into all three projects.\n\n&#x200B;\n\nI picked Safemoon because it was gaining lots of traction. These coins really run on hype mostly and Safemoon had lots of it. I was kind of late to the party so I knew there were less returns to be had, but the chance of it being rugpulled were lower than with an unestablished coin. I picked Fox because it looked very legit. A nice website, a friendly telegram server, a legit charity aspect and a 'good' roadmap (you can't compare these tokens to a proper coin's paper of course, they're literally hopes and dreams that might very well never come to fruition). Safestar was my YOLO bet. Either I was gonna get scammed or I'd be in early on the next moonshot. Now my three bets were spread across three quite different projects.\n\n&#x200B;\n\nhttps://i.redd.it/8xy6k8jv2fv61.gif\n\n**\"Nonononono, that's a scam!\"**\n\nI stared at my money constantly and nothing much happened. It went up and down but I didn't see nowhere near the 100x returns that all the post titles on r/cryptomoonshots were promising me! I got bored, as millenials do when they don't become millionaires within a week after investing, and kind of wrote this stuff off as a scam and just went back to hodling my legit coins. I didn't really touch my Trust wallet for a few weeks and opened it back up around a month after I bought into these projects. My jaw dropped to the floor when I checked the value of my 'investment'. My $150 had turned into over 10BNB worth around $7000 (better days). My entire crypto 'career' of four years I managed to scrape together $8k and now suddenly I had made $7k in a month. I just smiled and grinned that entire day. I wasn't scammed. I wasn't rugpulled. Fox gave me amazing returns of between 50 and 100x at ATH, Safemoon got a little less and Safestar never gave me even 2x. Still, the overall return was mindblowing and none of the coins lost me even a dollar. \n\n&#x200B;\n\n**Make your exit plan**\n\nI didn't have an exit plan at all when I got into this. I never expected these kind of returns. So I made one up as I went, slowly cashing out around 10% at certain milestones. When my Fox hit 5BNB, I took out 0.5. I made that back within an hour. That same night it hit 8 and I took another 0.8 out. Just days later I had $1000+ in my Binance account. I've never had more than $100 at a time in there. I felt like a kid in a candystore, picking out coins for my long term portfolio, doubling my ADA position with what felt like free money. I had more than made my initial investment back and like the gambling addict I had become, I decided to look for more memecoins to put part of my newly made profits into. I also sent my crypto-newbie girlfriend $50 in BNB to play around with as a simple introduction to crypto. Normally I'd suggest Doge for that, but uh... not at 40 cents a coin. We picked out some projects together. She picked Bonfire and Bingus. One because it looked decent and was picking up lots of hype and one because it was a cat. Sound logic for sure! You really have to put your logic aside with these memecoins. There are basically no fundamentals, you're just picking the ones that you think are going to pick up the most steam. Just three days later her $50 turned into nearly $700 proving once again that these memecoins really are capable of doing insanely fast returns.\n\n&#x200B;\n\nhttps://i.redd.it/ob4dsy913fv61.gif\n\n**The time I got rugged**\n\nI got into a few more coins myself. Joined my girlfriend in Bonfire and Bingus and picked another one called Happy. These all turned out to be good projects with so far returns of between 0.8x (Bonfire) and 6x (Happy) within less than a week. I said I was done until a new one popped up on Cryptomoonshots: Capybara. Capybaras are my favorite animal and even though everything looked sketchy as hell, I decided to put a few leftover bucks in just for fun. The dev was really unprofessional in the telegram and within a few hours of it launching, the dev was gone from the channel and all the reddit posts were removed. He got out with just a few BNB and tainted the name of the lovely, peaceful Capybara for a few thousand bucks. The only good thing was the Telegram channel after the rugpull. Getting scammed together kind of bonds people. Still wouldn't recommend this as your #1 way to make friends as it can get costly.\n\n&#x200B;\n\n**How to avoid scams and find gems**\n\nYou never know for sure what BSC projects are gonna pull the rug, but you can at least check for some vital signs of scammery. A token launching without a website is usually the sign of a really lazy scammer. A presale can be another red flag. For already launched tokens, always check the wallet distribution as with any coin or token you're getting into. Check if the liquidity is locked and for how long. Preferably check the devs if possible. Some of these tokens have been audited and have Doxxed devs which really helps build trust. Pick unique projects with something that differentiates them from others. Don't get SafeMusk, DogeMoon or MoonLambo. A simple to remember name that stands out, a logo that looks professional and a site that looks like it wasn't made in 5 minutes really help. A lot of new coins have a charity element and have actually donated thousands of dollars already. This is not only great for obvious reasons, but it also really helps with the marketing and improves the chances of it mooning.\n\n&#x200B;\n\nYou will always have to play the game of risk/reward here. Hopping onto a brand new coin within an hour of launch can be véry profitable but the risk is way higher. Waiting a bit for an audit, a community, a dev doxx, a few AMAs or even an exchange listing makes the chance of getting rugged way lower but you probably will miss that 100x chance by waiting. This is something that everyone should decide for themselves. \n\n&#x200B;\n\nhttps://i.redd.it/uhj38xd43fv61.gif\n\n**Sir, this is a casino**\n\nAs with any investment ánd any gamble, you should never invest what you're not willing to lose. You're absolutely insane if you put your life savings into a BSC memecoin. You could come out a millionaire but the chances are way bigger that you'll end up homeless. These coins aren't like your normal investment where you spend days learning about the usecase, the fundamentals, the code, the devs. They're a casino where you manage your risk versus reward. Do you bet on red by buying into an 'established' memecoin? Or do you put it all on 27 and hope for that big risky payday? Just like in a casino, be prepared to go home broke. This doesn't mean the casino is a scam. People willingly go in and gamble, just like on BSC. And just because you lost some money on BSC does not mean the entirety of it is a scam and should be avoided. I am nowhere near done and have already made more profits on BSC than in four years of legit crypto investing.\n\n&#x200B;\n\n**A few groundrules:**\n\n1. As usual, only invest what you're willing to lose. I suggest not using more than $50 on your first bet but of course adjust to your own financial situation.\n\n2. How risk-averse are you? This probably isn't for you if you only invested in safe coins like BTC so far.\n\n3. You háve to get used to the red candles. You're gonna see a lot of them and they're gonna be big. If you panic sell at each sign of red, you're gonna be broke real soon. In return, green candles will probably be plentiful too.\n\n4. This is a side hustle. Memecoins should, obviously, not be your main investment strategy. Buy your proper coins for the week/month and put a few tenners into BSC. It's kind of like buying a lottery ticket with your leftover grocery money. Except you might make actual money. Don't take out your life savings or sell your ETH for this. This is way too risky and besides, doing so makes it way too emotional. Seen many people in the telegrams do this and they usually panic sell for a loss because it's basically impossible to mentally deal with the volatility of these memecoins if your life savings are riding on it. \n\n5. Give it a month. The telegram channels for these coins are full of people panicking or calling everything a scam because they can't buy a lambo for their $10 investment after three days. These are highly volatile but even a memecoin takes a few weeks to truly get going. \n\n6. Don't stare at the price all day, especially with new coins. Less holders means more volatility and you will see entire BNB's evaporate in seconds when big whales dump early on. I suggest not looking at your value especially if you're prone to panic selling. Usually this settles down a bit and turns into more natural movement as more people get in. Example: I bought 2BNB of Happy an hour after it launched. Woke up the next day with 11BNB. An hour later it was 3.5. Now, a few days later, it's back over 10 and now the price movement is way more natural. Learn to love the volatility and learn to trust in the project, even if it is a sketchy memecoin. You still picked it for a reason, hopefully. Constantly switching to the next one will probably not make you more money than the good old mantra of HODL.\n\n7. Decide your exit strategy up front. Are you gonna cash out everything once you hit 10x? Or cash out 10% at certain levels? I suggest always at least letting a little bit ride as you don't wanna be the guy who sold his Safemoon for a few bucks profit and missed the 1000x rocket. Take your initial investment plus some profit out early if you get emotional. This makes hodling a lot easier as you already profited and are now playing with house money. Also make sure you're realistic. Don't expect a random memecoin to get to $0.01 and overtake BTC in market cap. Trust me, I've seen plenty of people get way too hyped and claim stupid shit like this.\n\n8. Learn to use Trust wallet. New memecoins will not display value. This doesn't mean you got scammed. Always check your value on Pancakeswap. It's the only real price that you can actually sell for. Charts and wallet values are usually wrong or behind. Also be weary that almost all of these charge a fee of up to 12% for liquidity and to give back to holders, so cashing out after you've gained 10% will actually cost you money.\n\n9. Have fun! Join the telegrams/discords. They're usually a fun place to hang around. There's lots of crypto newbies asking the same questions a 1000 times a day, along with people panicking over each drop. Millions of memes. But the overall atmosphere is usually great and positive even through all the chaos. Active devs are a great sign.\n\n10. If it's not for you, don't go around declaring it a scam all over r/crytocurrency. Price volatility doesn't mean scam. Yes these memecoins are stupid and there's lots of scams among them, we all know that. But just ignore them and continue on investing in legit projects. There's plenty of crypto scams in the 'real' crypto community as well. Let people enjoy things and don't go around FUD'ing something you have no experience with. I will be enjoying this crazy ride until it inevitably ends and I'll look back on it with a smile and a big fat portfolio full of legit coins. \n\n&#x200B;\n\nAnyway, that was my presentation. I guess this sub will forever mock these and it's pretty hard not to. 98% has a stupid name, no usecase and will probably die an early death but if you use a bit of brain and have a bit of luck picking the right ones, returns on these can be absolutely massive regardless and it's a great way to expand your legit portfolio with just a few bucks.\n\n&#x200B;\n\n*TLDR:* Memecoins are great if you treat them as what they are: a gamble instead of a legitimate crypto investment. Consider putting $10 in sometime!"}, {"title": "A sad crypto story", "score": 11, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mym7mq/a_sad_crypto_story/", "selftext": "Be prepared for massive gains this week as I will be temporarily exiting the market to benefit my mental health.\n\nI've been putting off getting help for a while, mainly because it costs so much money and I'm not the richest person in the world.\n\nI was gifted some money a few months ago for that very reason but my smooth brain thought that if I put it into crypto and it moons then I'd be able to get some therapy while also having a few spare dollars.. \n\nSo now, here I am, broke, in the red, and still needing help.\n\nI'm not sure if I should close out all my bitcoin or take out half now and wait to see if the other half goes up.. Should I sell my moons and a small bit of everything else?\n\nI feel like a dickhead.\n\nPlease don't tell me that I shouldn't have invested more than I could afford to lose, I'm already very aware.\n\nEdit: for clarification, it's not the red market that's making me depressed, I've needed therapy for years due to a traumatic childhood, adolesce and adulthood. I could really care less if the market dips.. I just don't know what I should do /what to sell"}, {"title": "Don't Fall for Pump and Dump Groups/Scams", "score": 23, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myki1b/dont_fall_for_pump_and_dump_groupsscams/", "selftext": "Edit: TLDR - Don't join groups that set a time to pump a project for short term gains for the members involved. There's always a select group of insiders that will have the info before the rest of the group, ready to dump on their faces. \n\n\nMy friend introduced me to a discord called \"Big Pump Signal\" this month. They have videos on their discord and telegram of their 200k+ members doing scheduled pump and dumps on random coins on [Binance.com](https://Binance.com). \n\nWe saw a video of one of there pumps that sent a project soaring 3x past the starting price. We didn't believe it was real until we waited for the next pump to happen. Their scheduled pump was $VIA and they took it up 2x before it started dumping (around 20 minutes after the pump).\n\nSeeing this made us both think we could get some easy gains by following this group's pump signals and getting out before the dump...so this past Saturday rolled around and we got ready to pump the new coin that they'd be announcing at 5PM. The coin announcement dropped at 5PM..and by 5:15 the coin has already dumped about 25%...I wasn't able to buy in on this one thankfully (US citizen and didn't have my Binance account set up) but my friend did..and he lost 25% of his BTC...the coin had pumped 30-45 minutes before schedule..leaving the regular group members to eat losses\n\nThe gist of the scam is as follows:\n\n\\-Get a lot of people in a discord or telegram group that want to make quick money (typically new investors)\n\n\\-Create 2-3 pumps that actually work and allow people to profit or Post some fake videos of \"successful pumps\"\n\n\\-Announce coin that is being pumped only at the exact time the pump starts, pressuring the participants to buy fast and drop their whole bag on the project being \"pumped\"\n\n\\-People running the PnD buy the coin BEFORE they announce it is pumping just to dump on the heads of those who buy in when the coin is announced.\n\nNow, as I said, my friend and I saw 2 successful pumps happen via this group before we got scammed. I would like to first point how how the leaders of the operation likely executed the final operation. The pumps are scheduled for a specific time on a specific day about a week in advance, but no one is told what coin will be pumped until the moment of the pump. I suspect the leaders took payment from a select group who would then be given the name of the coin early, as it seemed to pump about 30-45 minutes before the originally scheduled pump.\n\nFinally, I want to point out why participating in these PnDs is a terrible idea--completely aside from the fact that you will likely get scammed and lose money. A PnD is very much like a ponzi scheme. The people who buy first are able to make some nice profits by dumping their coins on the ones who are unlucky enough to buy the top. Remember, any time you sell crypto, you are selling to a real person. This said, anytime someone profits in a PnD, they are dumping the coin on to someone who is usually less informed about what they are doing, leaving that person with a fat loss. This isn't a win against big corporations, investment firms, or the banking system...this is a \"win\" at the expense of the guy next to you in that discord or telegram group. \n\n Be wise in analyzing these \"get rich quick\" schemes...if it seems too good to be true..it probably is."}, {"title": "Is trading worth it?", "score": 15, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mylssh/is_trading_worth_it/", "selftext": "Hello my dudes. Just looking for some advice. I'm new to the community and crypto in general, and definitely not smart enough to know what half the things on the sub mean, but I've started putting away a few dollars into crypto here and there when I can afford it. I don't expect to make any serious gains, and if in a few years I'm in a slightly better position because of it then hell yeah.\n\nBut should I be watching the market more closely and learning how to trade the coins I do have? Is it enough to just hold? And should I stick to buying tiny amounts of coins like Bitcoin and Ethereum, or try to collect a couple cheaper coins too? \n\nNot asking for or expecting to receive professional advice, by the way. I'll just be within reading distance of any random comments that happen to find their way to this post."}, {"title": "Quantum Fund Cofounder Jim Rogers Insists Governments Could Ban Cryptocurrencies", "score": 0, "url": "https://news.bitcoin.com/quantum-fund-cofounder-jim-rogers-governments-ban-cryptocurrencies/", "selftext": ""}, {"title": "Turkey’s Central Bank Head Says Crypto Regs Coming, Denies Total Ban Ahead", "score": 9, "url": "https://www.coindesk.com/turkeys-central-bank-head-says-crypto-regs-coming-denies-total-ban-ahead/", "selftext": ""}, {"title": "Then they fight you: “Bitcoin Is a Threat to National Security”", "score": 0, "url": "https://nationalinterest.org/feature/bitcoin-threat-national-security-183442", "selftext": ""}, {"title": "List of known physical cryptocurrency attacks. Worth reading if you hold your own keys.", "score": 9, "url": "https://github.com/jlopp/physical-bitcoin-attacks/blob/master/README.md", "selftext": ""}, {"title": "Isn't $80 a month a bit too much just to have some pixels?", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myle53/isnt_80_a_month_a_bit_too_much_just_to_have_some/", "selftext": "I mean fine by me if anyone wants to give their moons back to the sub but 1000/moons -$80 just to have a different name, new emojis and gifs on the comments?\nMaybe it's with my 50 moons (up until recently had 0) that thinks that 1000/moons is a bit too much"}, {"title": "The oblivious ape brain!", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myl90n/the_oblivious_ape_brain/", "selftext": "I relatively new to crypto so I dont have a lot of holdings yet, so when I had money its always a considerable part of my porfolio! Well originally I bought an amount of btc and eth I was confortable with and invested the rest into alts (I thought I wasnt going to put more money into crypto at the time, and oh boy was I wrong)\nAnd recently I have been buying the dip on VET, and it keeps diping so I keep buying! And I have now realized that 40% of my porfolio is VET!\nI now realize it is not healthy to have my money rely of an alt coin (speacially mentally seing my money dip dip dip) but oh well i wont sell in the red so i guess I gotta stick with it now"}, {"title": "If you see a stream from someone a popular person like Charles or Vitalik, be careful!", "score": 11, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mykrm5/if_you_see_a_stream_from_someone_a_popular_person/", "selftext": "This is mostly for all the new people on this reddit and crypto. \n\nIn the last view weeks I have seen more and more streams that restreamed an event from this popular persons and wanted to make it look like the original legt one. There was bitcoin adresses with the promise that this persons will double it.\n\nWatch out! Its a scam even if it looks real and effort has gone into designing the stream.\n\nI get even crypto scams as Youtube ads with bitcoin adresses, this is insane. There should be jail for this. Google ads has KYC for sure.\n\nNever send someone bitcoins or your private keys phrases."}, {"title": "The Great Reset?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mykpck/the_great_reset/", "selftext": "Hello does anyone here believe xrp will be the currency of the earth? One of my friends keeps telling me to get some xrp because its going to 10$ then soon 1K, 10k etc how legitimate is this because it just seems like its too good to be true how can anyone know what price a coin will hit? Its like xrp has a cult following that believes once the sec is over with all these institutions will gravitate to xrp but in reality they don't even need xrp right? They can just use the ripple net. What are your thoughts on xrp"}, {"title": "Tip: An important function of Moons is to use them as governance tokens. The more you contribute to the subreddit, the more voting power you have in governance polls.", "score": 22, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mykfsl/tip_an_important_function_of_moons_is_to_use_them/", "selftext": "Many times when people explain moons to newcomers, they explain the same few things: that moons are a r/cryptocurrency community token given out based on the karma you've earned in this sub, they are distributed about once a month, they can be tipped to other users, bought or sold, or held for a 20% bonus next distribution, and can be used to purchase the special membership on the sub.\n\nBut one very important detail that is often left out of these explanations is this: **Moons function as governance tokens.** The more active you are in the sub, the more weight your voice has. \n\nThis means that when you see a governance poll, such as [this one](https://www.reddit.com/r/CryptoCurrency/comments/mr3h9l/poll_adjust_the_time_that_comment_scores_are/) or [this one](https://www.reddit.com/r/CryptoCurrency/comments/mrn758/15000_karma_cap_on_moon_distribution/) the number of moons you've earned (and held) determines your voting power. **Your voting power is the lesser of the moons you've earned and the moons you're holding.** Purchased moons do not give you extra voting power.\n\nTake a look at [this poll](https://www.reddit.com/r/CryptoCurrency/comments/m7c60p/reduce_karma_from_posts_that_are_just_links_to/) for example. If you switch between the **6.6m Moons** and **2.4k Votes** tabs, you'll see that while 1,700 people voted for the karma reduction vs. 736 who voted against, their moons only counted for 28.5% of the total.\n\nOne other thing to mention is if you vote in a governance poll, you will receive a 5% bonus to your moons earned in the next distribution.\n\nAnyway this is getting kind of long, I just wanted to put this information out there because it is not mentioned often enough when explaining moons. **Use your voice to help shape this subreddit, hopefully for the better.**"}, {"title": "Taxes on Trading", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myk04f/taxes_on_trading/", "selftext": "So I’ve been trying to get into day trading crypto. The only issue is I don’t understand whether or not I’ll owe more taxes doing this, rather than just holding crypto. \n\nIf I say trade crypto, my Coinbase account says I have had $24,000 in total volum, but I’m only trading with around $1100. Do I only get taxed on the small amounts I make on the trades or do I get taxed on the $24k in volume? \n\nAny other sneaky tax information new crypto traders need to look out for? \n\nThanks!"}, {"title": "I hate you Ethereum!", "score": 18, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myjww5/i_hate_you_ethereum/", "selftext": "Why are you not falling like the rest? I wanted to dump my life savings into you during this dip, but you won't even fall below 2k. \n\nWhy does this always happen to me? When I want to get a good entry point, the project keeps on staying way too bullish. \n\nSincerely, I hate you for not giving me a chance.\n\n\n\n\n\n\nEdit: I meant this post as joke and I've flaired it as comedy. I'm currently DCA'ing."}, {"title": "If you care about your privacy and use coinbase or robinhood, read this...", "score": 11, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myjn3l/if_you_care_about_your_privacy_and_use_coinbase/", "selftext": "I’ve just came across a thread from around 3 months ago and didn’t know if it had been shared here before so I’m not sure if the following information is all 100% accurate to this date but I thought as it’s important I’ll share anyway (I’ve checked most and it seems to still be relevant).\n\n**If you’ve linked your bank to the apps mentioned in the title, a company called Plaid is/was recording your bank activity to sell the third parties. Plaid is in the process of being sued for this.**\n\n\"In reality, however, consumers are unwittingly giving their login credentials to the defendant, who takes the information, stores it on its servers, and uses it to mine consumers' bank records for valuable data (e.g., transaction histories, loans, etc.), which the defendant monetizes by selling to third parties,\" TD claimed in the court records.\n\nSource: https://www.thestar.com/business/2020/10/14/td-bank-files-lawsuit-against-plaid-accusing-it-of-trademark-infringement.html\n\nSome big apps involved in this are Coinbase, RobinHood and Venmo."}, {"title": "No, Alaska is not passing a bill to make voting use Block-Chain.", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myjhzj/no_alaska_is_not_passing_a_bill_to_make_voting/", "selftext": "Once again there is a post on the frontpage linking [to this article](https://www.alaskapublic.org/2021/04/15/alaska-would-be-first-state-to-use-blockchain-based-voting-system-under-proposed-bill/) and it makes it sound like \"Alaska is about to use block-chain in elections because there's a Bill being passed that will make Alaskan elections use block-chain technology!!!\".\n\nFirst things first, know this: Any member of a legislative house can propose amendments to Bills, and depending on where you live even regular citizens can propose amendments. It's **nothing special**.\n\n&#x200B;\n\nWith that in mind, if you dig a little bit deeper than the headline you will easily find that:\n\n&#x200B;\n\n1. It's **one senator** trying to amend a Bill that's being deliberated upon to include the possibility of usage of block-chain technology in elections.\n2. His amendment was not yet approved so it's not included in the Bill.\n3. The Bill was still not passed and is still being deliberated upon. It may or may not be approved, it may or may not include Senator Shower's proposal. For now it's not including it. [You can find the Bill here. It doesn't mention Block-Chain at all.](https://legiscan.com/AK/research/SB39/2021)\n4. [Here is Alaska State the page where you can read about the Bill](http://www.akleg.gov/basis/Bill/Detail/32?Root=SB39)\n5. And [here is the Bill](http://www.akleg.gov/PDF/32/Bills/SB0039A.PDF) itself. Try searching for \"block\" \"chain\" and/or \"blockchain\". You won't find it.\n\n&#x200B;\n\n&#x200B;\n\nWhile the title is partially true and clickbaity when it says *\"Alaska would become the first state to adopt blockchain technology statewide in its voting security system\"* that is also true for any other State or Country: at this point any State or Country that adopts block-chain technology for elections will be the first to do so. I wonder why write it this way?\n\n&#x200B;\n\nEasy conclusion: Alaska is not about to use block-chain for elections. A simple reading of the article and a small amount of critical thinking (this time with a bit of knowledge of the political system) would make you at least question the way the headline was written.\n\n&#x200B;\n\nLet's be better ² :)"}, {"title": "Investing in cryptocurrency isn’t a get rich quick scheme.", "score": 198, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myjb2f/investing_in_cryptocurrency_isnt_a_get_rich_quick/", "selftext": "I’m guessing a lot of people here are from dogecoin, and have completely unrealistic expectations on how cryptocurrency works and where it is going in the future.\n\nIf you want the hard truth; most if not all of the coins that we are holding right now won’t go to the moon like Bitcoin, they won’t make you the next Connor McGregor or Elon Musk and a lot of them will fall off of the map completely. The only one who I’m even counting on getting close is ETH but even that is a shot in the dark.\n\nDaily discussion is full of people shilling coins like VET, expecting them to skyrocket like Bitcoin not realising that you’d probably have to hold more than 60k coins at this point to even think about becoming a millionaire in the future. \n\nI’ve been in this scene since 2017 and 99% of the coins that people were rooting for then have fallen into the abyss. Litecoin was called “bitcoins silver” and it is far from it as of now.\n\nMost of us are here for the long run, we HODL like madlads, we cry in dips and we struggle with fomo on the daily. We hope one day we will reach a point where we can retire in happiness.\n\nCrypto is a game of patience and mental fortitude. \n\nHODL strong brothers. 💪🏻"}, {"title": "Thoughts and prayers addendum", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myj3lm/thoughts_and_prayers_addendum/", "selftext": "Additional thoughts and prayers\n\nI’d like to know everyone’s thoughts on BTT and TRX and just Tron in general. I’ve read a ton of mixed reviews. I’m not sure if I should steer clear of it entirely or if it could potentially be a good short term gain or even a long term portfolio position. Any input is welcome and appreciated and I’m entirely open minded either way. Thanks"}, {"title": "Are there any forms of proof that are less taxing when it comes to physical resources?", "score": 8, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myj18j/are_there_any_forms_of_proof_that_are_less_taxing/", "selftext": "I can’t be the only one with a bad feeling about the chip shortages. I personally don’t believe natural resource monopolies were part of the original white paper.    \n\nI’m thinking along the lines of proof of use. I’m no expert in the micro aspects of the code, but I do have a good macro view. If the difficulty is already adjustable, then why not have it favor people adopting rather than just mining?    \n\nMining was intended to be semi-lucrative in order to secure the network but this is old news. We’ve also seen proof of stake. I don’t think there is anything wrong with these ideas I just think there should be another phase. It’s not a unique idea. Look at any form of fiat. The fact that it is usable is a form of backing and security in itself.    \n\nI’m not sure if this is something that code can implement or if it’s just psychological in nature. Anyways. Nice musings."}, {"title": "Cryptocurrency will not replace fiat anytime soon.", "score": 67, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myj13g/cryptocurrency_will_not_replace_fiat_anytime_soon/", "selftext": "We love crypto currencies. We love the sense of empowerment it gives us. We love the community. We love the gains. We love the technology. But let's not kid ourselves into thinking crypto will replace fiat anytime soon.\n\nPeople traded favours, people bartered goods then people created fiat to represent value. This took thousands of years. Now we have crypto currences, the next step in this evolution (maybe even revolution?).\n\nBut here's the thing. People still trade favours (help a mate move to a new place in trade for beer, pizza and a deepening of your friendship), people still barter (trade you x for y) and people obviously use cryto (Tesla for BTC). All of these transaction methods will continue to co-exist.\n\nDon't get too caught up in the FOMO, we'll all be fine."}, {"title": "This isn’t a bear market, but on the off chance it is...", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myixdd/this_isnt_a_bear_market_but_on_the_off_chance_it/", "selftext": "Hey, at least look on the bright side.  If this is “DA BEARS,” then all these clowns that have been telling everyone Doge is going to be a global currency are about to understand the true meaning of “irrational exuberance.”\n\n... I mean they are going to anyway, but the sooner fundamentals return, the better."}, {"title": "Despite knowing BTC is a speculative asset by now , it still doesn't make sense to me how it can drag every single altcoin down so harshly.", "score": 55, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myij38/despite_knowing_btc_is_a_speculative_asset_by_now/", "selftext": "Bitcoin drops 1% , most alts drop 10-15%. \n\nI know Bitcoin is mostly the derivative force of the whole cryptocurrency system but I would expect at least for some projects to be independent of this relationship by now."}, {"title": "The Risk of Crypto", "score": 18, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myihtt/the_risk_of_crypto/", "selftext": "We have no idea if the crypto market will be like the Stock Market. We have no idea what a 10 year Bitcoin price will be like. \n\nNobody knows. New investors coming in thinking that Bitcoin is safe is a dangerous mindset to have for these dips. Lets us not forget what happened with the guy who killed himself over Robinhood Fiasco. \n\nI mention this simple knowledge for many mainly to help someone coming in thinking “its gonna go to 100k” no, nobody knows. They just think they are right which is not the same. \n\nYour $100 could be worth pennies or thousands. Nobody knows."}, {"title": "Get used to it", "score": 113, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myifnm/get_used_to_it/", "selftext": "Yep, with any volatile investment, especially crypto, you're gonna feel one of three things: \n\n1. Pure elation.  Your portfolio is up 20% in 24 hrs.\n\n2. Absolute depression. Your horse is down 25% In 24 hrs.\n\n3. Boredom.  Everything is sideways and has been for some time. \n\nYou will get used to the volatile water temperature in this hot tub.   \n\nSOURCE: 8 years experience as a crypto investor/trader"}, {"title": "How is the Bitcoin drop going to affect my Alts. Newbie here", "score": 19, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myie1d/how_is_the_bitcoin_drop_going_to_affect_my_alts/", "selftext": "Bitcoin seems to be dropping and there are talks of it resting on the 43k support level (currently At 49k). I have a few hundred dollars in altcoins (ZIL and VET) and the exchange that j bought them on isn't allowing me to withdraw them into a different wallet i.e off the exchange. Says that they are a part of a Rapid Listing Initiative. \n\nMy question is, do I sell now (at a loss of about $150) and buy from a better source, or do I wait it out. My concern is that Bitcoin's trend is going to screw up my Alts and I'm going to be forced to sell later at an even greater loss because I simply cannot remove my coins off of the exchange"}, {"title": "The N-Word Coin", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myi56j/the_nword_coin/", "selftext": "The N-Word Coin\n\nThere is only one coin that holds up to the promises from Bitcoin of 2014. Decentralized, global, fast, secure and much cheaper than a fiat transaction (PayPal does have a fee of ~3%, even though you won’t notice, the shop owner does). \n\nIt is None. \n\nNo crypto is perfect in all categories. There are some promising ones like Nano or Cardano, but only time will tell if they are capable of scaling up without losing their advantages."}, {"title": "Elongate scam coin associated with Elon Musk, be careful and warn others⛔", "score": 0, "url": "https://www.the-sun.com/lifestyle/2770950/telsa-owner-elon-musk-crypto-coin-name/", "selftext": ""}, {"title": "Stop blaming others on your bad investment", "score": 132, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myi3to/stop_blaming_others_on_your_bad_investment/", "selftext": "This will be probably downvoted, but listen. Stop blaming others on your bad investments. \n\nEveryone is concerned about recent drops, but no one will be able to explain this. \n\nIt's you who buy when the price is high and probably you had good reason, like trust that prices will go up. If so, keep holding till you see green. \n\nCrypto market will be always dynamic. Things will go suddenly up and down. \n\nIf you have long term goal: close the app, take a walk or go to sleep. \n\nUnless you bought Dogecoin, then you're fucked."}, {"title": "How to get over the guilt when buying high and not throwing more money in the dips?", "score": 29, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhysa/how_to_get_over_the_guilt_when_buying_high_and/", "selftext": "My coins are almost doubled down since I bought them and I feel really bad about it.\n\nNot a panic seller, but just having some kind of guilt of not waiting maybe or getting a better deal.\n\nI keep thinking if those coins hit high, I could have two fold more of profits."}, {"title": "What do cars and cryptocurrency have in common? You're an imbecile if you believe in them.", "score": 40, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhx8j/what_do_cars_and_cryptocurrency_have_in_common/", "selftext": "If you're ever doubting being an early-adopter or being ridiculed by those who don't understand the disruption taking place, remember: those who believed in automobiles were imbeciles. \n\n\"To advocate replacing the horse, which had served man through centuries, marked one as an imbecile.\"\n\n\"...I began to be pointed out as “the fool who is fiddling with a buggy that will run without being hitched to a horse.” My banker called on me to say: “Winton, I am disappointed in you.”\n\n \"In July 1897, I confided in a friend: “I am going to drive my horseless carriage from Cleveland to New York. I am inviting you to come with me.”\n\nHe laughed at me. I sought another friend.\"\n\nFun read about the sale of the first US automobile for perspective: \n\n[https://www.saturdayeveningpost.com/2017/01/get-horse-americas-skepticism-toward-first-automobiles/](https://www.saturdayeveningpost.com/2017/01/get-horse-americas-skepticism-toward-first-automobiles/)"}, {"title": "idk about you but i think binance is behind High GAS fees", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhva1/idk_about_you_but_i_think_binance_is_behind_high/", "selftext": "As yall probably know, Etherum gas fees are high... So much high that snoop dogg and that's a FACT.\nBut have you ever asked yourselves, why ?\nWell the average price for a transaction on the etherum blockchain is 50 to 100 dollars and that is INSANE !\nbut today, the Big binance was performing a 4hours long Upgrade, so basicly they were out of the game for 4 hours... That was more than enough for the gass fee to drop to 10 to 20 dollars per transaction !!! Yes you read it correct i actually did 2 trznsactions, one cost me 9 bucks and the other around 17 dollars !\nin my humble opinion i thinnk CZ ( boss of binance) hates Etherum so much and wants for his BSC to take over Erc20 that thay are making high gas for their transactions.\nI want to hezr your opinion about this and if tou think the same of is it just me !\nHave a nice one 💚"}, {"title": "More price corrections are coming", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhsgx/more_price_corrections_are_coming/", "selftext": "I’ve been saying this since early last week, the long term charts for Bitcoin were looking very bearish. \n\nThe MACD has rolled over the signal on the 5Y chart. This means that momentum has slowed by a lot. This is just the beginning though. The whales are cashing out.\n\nThere’s no telling how long it will last, but open short positions if you can, and set your limit orders for the dips. \n\nAs I was saying a few weeks ago, buckle up. Because it’s going to get bumpy."}, {"title": "What makes cryptos drop sharply collectively and simultaneously?", "score": 22, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhn3c/what_makes_cryptos_drop_sharply_collectively_and/", "selftext": "Is this trading scripts or some other shit?\n\nAre there just that many ‘traders’ watching the markets around the clock that they ‘knee jerk’ at the same time?\n\nI’m talking about those steep drops that you can see on almost every coin occurring at the same time.\n\nHonestly asking for education, because it always seems dodge af. 😅"}, {"title": "Did we just have another small flash-crash?", "score": 55, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhiib/did_we_just_have_another_small_flashcrash/", "selftext": "I went on Coindesk to look at Bitcoin and see that the price went below 49k, but I didn’t see it on the 1-day timeframe chart, then I look at the 12-hour and it’s on there.  Did we just have ANOTHER flash crash (though far smaller than the previous) because if we did this is kinda annoying I don’t know what caused it but I wouldn’t be surprised if it were some leverage-trading degens getting liquidated yet again."}, {"title": "Trying to withdrawal LTC from bitmart gives me an invalid address", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myhgin/trying_to_withdrawal_ltc_from_bitmart_gives_me_an/", "selftext": "I'm trying to deposit from bitmart it to either kucoin or my trust wallet but both of them gives me an invalid address error. I even tried the converter https://litecoin-project.github.io/p2sh-convert/\n\nA little help here plz"}, {"title": "Dodge a crypto scammer on discord ಠ ͜ʖ ಠ", "score": 13, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myh96s/dodge_a_crypto_scammer_on_discord_ಠ_ʖ_ಠ/", "selftext": "So 3 days ago I got a msg from this guy/girl they wanted to ask me general stuff about crypto. I asked why are you asking me. They said cuz I msgd in the group talking about something idk so I thought it was no harm in teaching someone. I told some basics about bitcoin and that's it. About 2 days later they said they want to send money to me cuz they don't know how to trade so I should take care of it. By then we had some pretty good conversation and became friends. At some point I did thought they really wanted to be my friend so I kinda trusted. \n\nThey said to give the login details of my wallet and they will put money in it. I thought this was really strange. I said my wallet is indian and it will not be available in the US. They insisted and said no problem \"I will figure it out\" or shit. So now it was confirmed that she/he was a scammer. I didn't block them. I tried to collect proofs to share and warn everybody else of this scammer. what I did then was made a fake account and gave login details to him/her. \n\nAt first it wasn't logging in and they sent me a screenshot. Now I could see the what the time was in the pic they sent me and it wasn't from US it was somewhere from AFRICA lol. Then after sometime they logged in and I got notification of their details in my email that I used in the fake account. I got their location and email address. Now I am trying to contact the mods and aware them about this guy/girl scamming people. They might block the account and that will be good."}, {"title": "Throwback to the first and only crypto scam I've been a victim of", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myh93n/throwback_to_the_first_and_only_crypto_scam_ive/", "selftext": "https://ibb.co/Nt2pCwY\n\nYou might have known this scam because of the memes. Yep, I'm talking about bitconnect. It was December 2017. I had just got my first laptop 3 months ago and pretty new to the crypto world. I used to think crypto as some sort of lottery, if you can fond the right coin you can make your money 2x overnight. Made my money 4x within 15 days by investing in ripple, that made me overconfident. And every self proclaimed crypto expert was suggesting this get rich quick scheme. It promised 1 percent daily compound interest, which of course isn't possible, but you know how this works. Big profit screenshots from those who had invested in starting days and withdrew quickly. Those were the real clever men. This is the first time I'm confessing this loss, not even my parents know that I lost their money to such a scam. So buy and hold, don't loose your money to such get rich overnight schemes."}, {"title": "Given the recent court ruling demanding that Bitcoin.org removes Bitcoin's original white paper on the grounds of Craig Wright having filed a copyright claim on it, I feel the need to iterate that Craig Wright IS NOT Satoshi Nakamoto!", "score": 129, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mygvzn/given_the_recent_court_ruling_demanding_that/", "selftext": "One cannot say for certain who Satoshi Nakamoto is, but you can be quite certain that it's not Craig Wright. \n\nWhy you ask? Simple. If the real Satoshi Nakamoto wanted to reveal himself (which he apparently don't), he wouldn't have spent years playing every dirty trick in the book to try and convince people of who he is. Not only have Craig Wright not been able to cryptographically prove that he is SN, but he has been caught both lying publicly and faking documents to try and prove he is SN.\n\nCraig Wright (Bitcoin SV) is trying to do the same thing that Roger Ver (Bitcoin Cash) has been trying to do for years, which is to try and convince people that his BSV is the Bitcoin that was originally visioned by Satoshi Nakamoto. This is of course total BS, as SN chose to make Bitcoin and not Bitcoin Cash / SV. The only real difference between Wright and Ver is that Wright took it one step further by sowing doubts into people's minds by trying to provide answers to the mystification of the pseudonym Satoshi Nakamoto, with the intent of splitting the crypto community so that him and his team could steal market shares from Bitcoin.\n\nThis is a man who will lie, cheat and bully with no sense of shame, all for the sake of money. He is a dispicable man who is filled with greed and a lust for power, and it is up to all of us who knows what kind of a POS he is to warn newcomers in the crypto space so that they don't fall prey to his shenanigans."}, {"title": "Crypto Gambling Addiction", "score": 20, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mygepp/crypto_gambling_addiction/", "selftext": "Hello everyone, and I’m a cryptoholic. \n\nWell actually to be more precise I’m a noob that got rekt a bunch after aping into an easy all in that mooned. \n\nIt was an instant x4, I was on top of the world. I had way more money that I could have imagined so fast.  So much dopamine rushing to my head\n\nWell it didn’t last long, the plan was to just hodl but then as I got greedier and greedier I started to play around with margin trading and then the market turned bearish. \n\nI got rekt and liquidated, started to dig a bigger hole until I realized what I’ve done. I feel so ashamed of myself. \n\nIt’s all because I gambled way more than I can afford to lose. Because of the lockdown and potentially my business going bankrupt I wasn’t in a healthy mental state to be doing what I did. \n\nI’m sure there’s many other young people my age that have a similar addiction to crypto like how our generations struggles with social media or porn addiction. \n\nI just wanted to say I let myself down and I’m sorry me. I hope sharing my story helps others in a similar fashion to wake up and only gamble what they can afford to lose. \n\nIf you plan to make life changing money, expect life changing consequences for your actions."}, {"title": "I'm so bored", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mygel6/im_so_bored/", "selftext": "Can the whales hurry up and make the market move? Pls, make something happen. I'm dying of boredom.\n\nBitcoin is having its resting sleep. Eth is constantly teasing us with tiny flutuations. And I'm just here: CAN SOMETHING HAPPENS PLS??! Okay I think that's enough for 250 characters. Riiiiight now."}, {"title": "There is far too much judgement and resentment at times", "score": 23, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myg3pr/there_is_far_too_much_judgement_and_resentment_at/", "selftext": "I was drinking far too much beer in the sun in a beer garden yesterday feeling great and filling this subreddit with inadequate shitposting content (sorry) and was feeling the loving and warm feelings inside that only alcohol can give you and I noticed, there is far too much negativity and jealousy. I saw someone post about finally having a whole ETH and some people took it as boasting and downvoted. Man like come one. Feel happy for people, you never know each other’s circumstances. \n\nI think as long as you are buying and investing in decent projects and holding for the long term you are working to better yourself and your future. That’s something we should celebrate. One of the main reasons I fell in love with this sub was the in it together mentality and feeling especially when it’s pumping or desperately dumping. \n\nSome pointless Sunday ramblings from a washed up hungover shit poster"}, {"title": "High thoughts: We buy to invest with hopes the value goes up to cash out into fiat for gains. But the idea is that this just becomes the currency. When fiat actually does fail what was the investment value worth except how many coins you own of it if you can't cash out for fiat anymore?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myfzas/high_thoughts_we_buy_to_invest_with_hopes_the/", "selftext": "What does $60k mean per coin if the coin is the only currency? The more you own obviously the more power you will hold in the new economy. It's almost like we're just buying play money so people will cash out early for real money which will eventually be play money so that our play money can become the real money. Then all those lambos from cashing out for fake money become the real meme.\n\nMaybe that blunt just hit too hard."}, {"title": "I wrote a Publish0x article about the frustrating rise in fake coins being pushed everywhere", "score": 2, "url": "https://www.publish0x.com/wallstreetwooks/fake-coins-everywhere-xzwvdlg", "selftext": ""}, {"title": "What happens in the long term to coins whose supply decreases frequently enough that they are too scarce to be meaningfully used for transactions by the masses?", "score": 14, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myfn6q/what_happens_in_the_long_term_to_coins_whose/", "selftext": "This is more of an economics question I guess but for coins that burn some of their supply regularly and more can't be added, what happens when the supply is too small that it becomes prohibitively difficult for people to use to transact with?\n\nIs this just an issue that is so far out in time that it isn't worth thinking about quite yet?\n\nI was just curious because there is a balance between holding but as coins get burned and demand increases because the supply is more scarce, what happens in the future?\n\nCan currencies like BTC/ETH ever become *too scarce?*"}, {"title": "New federal regulations could spur cryptocurrency crash - NY Post", "score": 0, "url": "https://nypost.com/2021/04/24/new-federal-regulations-could-spur-cryptocurrency-crash/", "selftext": ""}, {"title": "What popular coins do you think will NOT make it long-term?", "score": 23, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myfeym/what_popular_coins_do_you_think_will_not_make_it/", "selftext": "More than half of companies during the tech bubble didn't make it after the hype. We all know a few years from now only crypto/blockchain companies with real world usage will survive. I think this will be a shocker to many as more and more coins start falling off the map. \n\nSo which ones do you think won't make it?"}, {"title": "No, Georgia did not pass a bill to teach highschool students about cryptocurrency.", "score": 7579, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myfdax/no_georgia_did_not_pass_a_bill_to_teach/", "selftext": "Someone made a thread with [this article](https://invezz.com/news/2021/03/12/georgia-passes-a-bill-to-teach-high-school-students-about-crypto/) and a very clickbaity title to entice and get reactions and comments from all of you (obviously for Moon farming). It got to the frontpage with about 8k upvotes. If you read the article you will see that:\n\n&#x200B;\n\n1. It's from March 12, not recent.\n2. Any \"proposed bill\" needs to be approved by both legislature houses (House of Representatives and Senate). It was only approved on the House of Representatives, so it effectivelly wasn't \"passed\".\n3. It's already dead on the Senate [as you can read here: \"Status: Engrossed on March 8 2021 - 50% progression, **died in chamber**](https://legiscan.com/GA/bill/HB681/2021)\"\n4. The proposed bill intended to add a **16 point Financial Literacy course** to 10th and 11th graders **where one of them was cryptocurrency** [as you can see here.](https://www.legis.ga.gov/api/legislation/document/20212022/199139)\n5. This is literally in the second paragraph of the original article: *According to the report, the bill aims to amend the current curriculum for 10th and 11th-grade students. The new program would consist of 16 new areas of financial literacy such as cryptocurrency, balancing a checking account, money management, making investments, and completing loan applications, among other traditional subjects.*\n\n&#x200B;\n\nEasy conclusion: Georgia is not teaching students about Crytocurrency. People will upvote whatever makes them feel good even though a simple reading of the article and a small amount of critical thinking would make them at least question the way the headline was written.\n\n&#x200B;\n\nLet's be better :)"}, {"title": "To those who are new: hodling moons DOES NOT give a 20% boost to the amount you have next month. Only the amount that you earn.", "score": 50, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myfcim/to_those_who_are_new_hodling_moons_does_not_give/", "selftext": "I've seen this misconception a lot around this subreddit, people seem to think that if they hodl their moons they will make 20% month after month, in a snowball effect. This is not true. For example, if you hodl all the moons you made in April, then you get a 20% boost on the amount of karma you earn in May. If you hodl half, you get a 10% boost. It's still great but not an exponential growth situation like most people believe."}, {"title": "Some guy's weak attempt to compare Bitcoin to a Ponzi scheme", "score": 8, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myf8yd/some_guys_weak_attempt_to_compare_bitcoin_to_a/", "selftext": "[Link](https://medium.com/surviving-tomorrow/bitcoin-is-a-giant-ponzi-scheme-ae4263008220)\n\nI occasionally like reading articles from the devil's advocate point of view to keep myself grounded on my new crypto journey, but this one seems like a lazy attempt from an obvious no-coiner. Here's some of his main points along with my comments:\n\n>It has no intrinsic value. You can’t eat it, wear it, or heat your house with it. Unlike gold — which at least feels nice and looks shiny on your spouse’s ring finger — you can’t even see Bitcoin.\n\nFiat also has no intrinsic value. I suppose we should consider government issued currency a Ponzi scheme as well. Guess what? Value always has been and always will be *subjective*. If I believe that a bubble gum wrapper with some already chewed up gum is worth $1000, then it actually is worth $1000. I think I remember a piece of toast with the burn mark in the shape of Jesus being sold for quite a bit online. Something has value if we all agree that it has value. With increasing income inequality in the world, many of us are all beginning to agree that fiat has decreasing value, thus why we hodl.\n\n>It is not a productive asset. It’s not a factory that produces an item. It’s not a field that produces cucumbers. It’s not a firm that offers a service. It contributes nothing to society.\n\nThis is him again arguing for his own *subjective* theory of value. Not everything that is produced in a factory or a service that is rendered directly to a consumer is something that has value. Productivity is also subjective. I might not think that fidget spinners are very productive and may be a waste of factory equipment, but that does not mean they have no value to anyone else. To say that Bitcoin and cryptocurrency contribute nothing to society is completely false. Just read all the posts here from Venezuelans empowering themselves with crypto in the face of their nearly worthless government currency.\n\n>It has zero underlying value. None. It’s not backed by land or commodities or — as with national currencies like USD or GBP — the threat of violence (in the form of wage garnishment, asset seizure, and imprisonment.)\n\nI'll not repeat myself here. I'll add that not being backed by government violence or wage garnishment is a much desired feature, and pretty much the point why many of us get into crypto in the first place. What Bitcoin is backed by is our cooperation in maintaining the network and confirming each other's transactions.\n\n>It has minimal utility. Because the price fluctuates so wildly (what healthy currency doubles in a month?), it’s virtually ineffective as a safe representation of value or means of trade.\n\nWell, better get on that GME stock! Joking aside, I don't think most people would complain if their country's currency doubled in a month. Also, the traditional stock market fluctuates widely on sentiment alone or if a CEO smokes a joint on a popular podcast. Are the traditional markets really any more safe given that there are more favourable rules for those who are already wealthy? Also, with respect to utility, we just have to look at all the projects leveraging cryptocurrency for novel ways to exchange value with each other. I would have never predicted that NFTs would be a thing, or if I did, wouldn't have predicted that it would be widely popular and in the local news.\n\n>Its value is solely derived from the trust that the price will continue to rise indefinitely. That there will always be new investors to buy out the old ones.\n\nIf he thinks that the value of cryptocurrency, Bitcoin in particular, is solely derived from its indefinite rise, he must not have done much research on it. This statement I found to be particularly lazy. Again, we agree on what has value, and we desire an alternative way to conduct transactions irrespective of government or corporate control. It's not just about the price rising indefinitely, it's more about fiat deflating indefinitely due to unlimited money printing. Bitcoin's price rising is only a side effect. The fact that there will only ever be a certain amount of Bitcoins *is* stability. We have no idea how much money governments will print and how much debt they will take on. The only proper answer to that question given what we (don't) know is *infinity*.\n\nI'll admit that I really don't know all that much about cryptocurrency and Bitcoin. But I know enough to recognize crap when I see it."}, {"title": "What a “moons” and how do I get them?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myf8ws/what_a_moons_and_how_do_i_get_them/", "selftext": "I keep seeing all of these messages about moons. There was a thread on how to replace your job with them, and I am very confused but interested. Can someone explain how this of value? It’s like a reward program?"}, {"title": "PSA: Do not go round telling people you own crypto", "score": 14, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myewko/psa_do_not_go_round_telling_people_you_own_crypto/", "selftext": "It scares me that you can have all your crypto stolen by someone forcing you to reveal your 12 seed words. Perhaps in more civilized countries robberies and murder for money is not as common but for the rest of us who may not come from places as nice this is a danger.\n\nWallets can be recreated with the 12 \"seed\" words that are used to recover wallets even when lost. If word goes around that you have a lot of crypto the wrong people might hear about it and decide to pay you a visit. \n\nThey might receive your wallet and straight up assume it's not enough and has to be a fake, and this could put your life ar risk.\n\nYes, this is not a problem now for you and your $4,000 in crypto but 4 years from now you will be the guy who talked about bitcoin when it was 20 times (if being generous) less. They won't know if you sold or not and bad actors will assume you've continued adding funds through out that time.\n\nBe smart and be safe. Advise family and friends if asked but crypto currencies are big enough now for even your grandmother to have asked you about them.\n\nPlease keep safe, thank you."}, {"title": "Just another Binance U.S gripe", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myensf/just_another_binance_us_gripe/", "selftext": "**Binance U.S** sucks and here's why:\n\n* Verification has been pending since 2/8/21\n* No longer able to log into my account. Met with Incorrect Username/Password, try to reset password, never get e-mail link. Open support ticket.\n* Support ticket pending since 2/11/21\n* Somehow I can still login(same username and password as above) using the link within the original Verification Email.\n\nIt blows my mind how this is seemingly everyone's favorite exchange, as long as they're not located in the U.S."}, {"title": "Trx has a community problem", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myens4/trx_has_a_community_problem/", "selftext": "Trx needs a reshape of the community, i just got banned on the main telegram chat for saying that after 4 years of holding i feel that the community is less attractive and more polarised, that there is a paralysing fear for dogecoin, and less discussion then ever. (paraphrasing) \nI asked for reason to keep holding and the admin told me that if i based my reasons on community i was “immature LOL”.  \nIt is OBVIOUSLY not my only reason, and i stated it clearly.\n\nI kept on saying that is not a correct behaviour from an admin and thats one of the reasons i have doubts. He then went on saying that if he sends a LOL to warren buffets the latter wouldn’t sell apple and coca cola and banned me. This guy (Carlos) moderates the group of a billions dollar peoject. Thats the first impact people have. And it sucks.\n\nSumming up, i came in to find reassurance, now i am sure to sell.\n\nEdit: corrected some spelling :) and added final."}, {"title": "What form of currency/wealth will eventually overtake crypto?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myem8v/what_form_of_currencywealth_will_eventually/", "selftext": "I've been thinking a lot about the basis of wealth storage and ability to transfer said wealth (in whatever form) to different entities in a secure and efficient manner.\n\nI strongly believe the crypto space is in its infancy still, and is going to be used as a platform for many really cool tech and money advancements that have already started happening, with many more to come in the future.\n\nBut I can't help but wonder what the next step in this monetary game is? Obviously we don't live in a perfect world without technical and resource restraints. So you can't just create something so far out of the box that it isn't actually feasible to use for humans on earth.\n\nSo what do you think would be the next logical step in the advancement of wealth security and transfer? I mean obviously things in general are going to start being integrated with each other as we move along, but is there a complete jump to something totally different you see possible?"}, {"title": "Share your \"worst\" trade, which you still regret.", "score": 20, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myeiwg/share_your_worst_trade_which_you_still_regret/", "selftext": "Just out of curiousity what's the worst transaction you ever made in the crypto market and it still baffles you why did you made that trade?  \n\nIf I think about it, mine would be FOMOing into XRP @ 2.27 back in '18."}, {"title": "As a early coin holder, what are the dumb things you spent your coins on before the boom??", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myehdx/as_a_early_coin_holder_what_are_the_dumb_things/", "selftext": "Heres my story;\nI had roughly 15 coins in 2012 and lost them to a fake silk road URL my friend had sent me. \nWaited around paranoid af for weeks until I finally realized I had been scammed, and then years later found out not only did I get robbed once, but now twice because those coins would have been worth something like 750k today.."}, {"title": "Why does every platform have terrible reviews?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mydxp6/why_does_every_platform_have_terrible_reviews/", "selftext": "It seems like in Canada at least, every single trading platform TONS of people complain about not being able to withdraw their money and terrible customer service help. Is every damn platform a scam or are people just too stupid to figure out how to work the apps? I want to invest but there seems like no safe way to do so."}, {"title": "Warning: Verasity is locking users out from withdrawing their coins. Be very careful if you choose to stake with them", "score": 0, "url": "/r/Verasity/comments/mybwuo/verasity_banned_me_75000_locked_in_verawallet/", "selftext": ""}, {"title": "Governments banning cryptocurrency and it’s effect on people using it.", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mydvda/governments_banning_cryptocurrency_and_its_effect/", "selftext": "Even if any governments or hell, even all governments “ban” cryptocurrencies such as Bitcoin, won’t it still exist on a peer to peer basis? Can’t you essentially never turn it off because so many people have access to it and are constantly mining and trading? What if all exchanges get banned, can’t it still continue? Seems like it can never be stopped unless electricity and internet cables goes out worldwide..and even then some one with solar power and an offline farm can still use it?\n\nI’m in a region that’s crypto locked so I can’t just get any coin I want directly from an exchange, so I use a decentralized exchange to be able to get those coins even though I’m not legally able to do so."}, {"title": "Is the tax man coming to town? Does he care? Do I care? Help", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mydtay/is_the_tax_man_coming_to_town_does_he_care_do_i/", "selftext": "I’m currently filing my state (NC) taxes for 2020 and yes I’m aware I’m a bit late. As you may have guessed I’ve reached the part that asks the following: \n\n“At any time during 2020, did you receive, sell, send, exchange, or otherwise acquire any financial interest in any virtual currency?\"\n\nNow I understand that this question seems pretty black and white basically stating if I’ve used any exchange for any crypto transaction then I should check yes. Although is this the case? \n\nI’ve only been trading in crypto exchanges for about 3-4 months however I couldn’t count the number of transactions I’ve made between buying, selling, and converting. \n\nI’m worried that when checking “yes” on this I will then be asked many further questions that I couldn’t possibly answer. I began with Coinbase, then moved to Coinbase Pro, then Voyager. I am currently using the last two and I’ve looked on each and do not see any tax info at all. \n\nIt may be worth noting that between the two exchanges all of my holdings combined do not exceed 2k (a little over $1,500)\n\nAny chance there is a CPA in here that can provide some guidance on this or has anyone in a similar situation checked “no” without issue? I’m a bit ignorant when it comes to all things tax related so any help would be alright alright alright.\n\nThanks for the advice with this. And thank you to the guy who reminded me how to read a calendar which points out that my 3-4 month experience has all taken place in 2021.  However i will leave this up for anyone else possibly needing assistance."}, {"title": "Have you ever been scammed? Share your story to prevent others to be scammed", "score": 10, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mydr8f/have_you_ever_been_scammed_share_your_story_to/", "selftext": " \n\nSince I am investing some of my money into Crypto there where scammers all along.\n\nI heard so many stories about MtGox, Fake-Musk scams and stuff like that.\n\nMost of the stories will be kept in private I guess so here are mine:\n\n* Friends of mine fell for a pyramid scheme with Bitcoin in 2017. (all together about 0.8 BTC). They never bought BTC again till now.\n* I lost money, because I fell for a fake Dogecoin Wallet (about 150'000 Doge bought @ 0.0008$)\n\nAfter my lost amount of Doge I kinda stopped caring about Crypto. I didn't fell for this pyramid scheme because a) I didn't have enough money b) I said: Seems dodgy to me and they didn't care.\n\nIn the end we all lost our money and luckily I gave Crypto a second chance in 2020 to make up for my lost money. (But still... 150'000 Doge hurts me)\n\nNow I wanna know: Do you have similar stories?\n\nEver dodged a bullet or did you got scammed? Share them so others can learn from your/my mistake"}, {"title": "Bitcoin's Tumble, Explained", "score": 5, "url": "https://www.thestreet.com/investing/bitcoin/bitcoins-tumble-explained", "selftext": ""}, {"title": "Bitcoin Blowout: What The Heck Happened Last Week And Can We Blame China For It?", "score": 8, "url": "https://www.forbes.com/sites/kenrapoza/2021/04/25/bitcoin-blowout-what-the-heck-happened-last-week-and-can-we-blame-china-for-it/?sh=27a5ae251f04", "selftext": ""}, {"title": "HELP - my wife and her friends keep talking to me about Doge", "score": 51, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myd6xd/help_my_wife_and_her_friends_keep_talking_to_me/", "selftext": "Flaired as comedy, but its horrifying tragedy, and im feeling very alone.  Ive only been doing this whole trading thing for about 4 months now.  Definitely capable of holding, simply because i havent had the nards to sell because i dont want to pay the $4 tax on my $10 profit.  But ive been reading and learning about markets and trading in general - all good, right?\n\n*WRONG*\n\nMy wife and her friends are on tiktok constantly, and she knows ive been watching tickers and charts all day for months.  Once doge blew up, and they saw the tokkers making videos, it suddenly became \"did you have that? Are you going to buy sone? why didnt you get into that? We could be rich! (Friend) is buying in because (other friend) did.\"\n\nNow, im no expert, but i feel like ive read enough compelling information to have reasons to avoid doge, and view its whole situation as result of memery and elon.  But now my sexy half and her parrots are putting in their sense.\n\nGuys.  She does me favors.  And that one thing.  I may either appease her with the $100 worth of doge that thing she does is worth (ok.. $20).  I may flat out lie and tell her were holding, but then i dont know what i would do if it blows up again and i dont have anything to actually sell.\n\n🐕  is effecting the lives of even those who are trying to avoid it.  There is no help to be had.  I just needed to vent this to the universe.\n\n(Edit - guys, im sorry.  This was mostly a joke.  While yes, this has been a conversation between she and i, shes mostly just fucking with me.  Shes actually very cool.  Weve been together almost 10 years, and i would totally tell her to get fucked if she was serious (or just buy the $20 of doge to get her off my ass).  I thought flairing it as comedy and calling it tragedy would signal that im not actually ib a horrible position.  Im sorry if i pissed anyone off.\n\n... and no, im not gettibg her any other doge.  Im already experiencing xrp bouncing around, but atleast i got in that around $.45)"}, {"title": "It's finally happened. A short cautionary tale.", "score": 38, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myd6m0/its_finally_happened_a_short_cautionary_tale/", "selftext": "I typed in the wrong address and sent a substantial amount of crypto (probably not to you, but it was substantial to me) into the abyss. Rest in piece my lost ETH. I've done crypto for years and become lazy and complacent.\n\nPlease, please, please be careful out there. I used to triple check my addresses before moving any crypto around, but I got complacent over the years and have learned my lesson. Learn from people like me."}, {"title": "The majority of the top ten posts on r/safemoon look like fake profiles. Be aware, that this is a possible scam stunt. Here is the list", "score": 31, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycwfm/the_majority_of_the_top_ten_posts_on_rsafemoon/", "selftext": "8 of the top ten posts on r/safemoon are from profiles that all look the same/have a similar pattern. All created in the recent months, all just post on safemoon, all there to create a hype. I am posting this, because a friend of mine approached me, asking me if I heard about safemoon. He has never ever invested in cryptos. I fear, a lot of newcomers will lose money here, if it is a scam (I am very positive it is). So please be careful and only invest what you are willing to lose completely.\n\nHere are the profiles of the top 10 posts, you be the judge.\n\nu/stingrayy1990 2 months\nu/EarningsCheck 3 months\nu/Galateismo 2 months\nu/robbieputnam 2 months (do not sell posts)\nu/Alexander19Investing 15 days\nu/Silveryblood 1 year (only Posts/comment in Safemoon and has comments in one other sub\nu/Comprehensive-Site53(only active in safemoon sub) 5months\n/u/NeverGiveUp-1 25d\n\nu/Galateismo 3 years, real profile\nu/__BurNing1 year, looks like real account\nu/yusfah 8 years, legit account"}, {"title": "Why does cryptocurrency have so many fees associated with it?", "score": 21, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycs4x/why_does_cryptocurrency_have_so_many_fees/", "selftext": "Does anybody else think the fees associated with crypto will slow down its mass adoption? When I send money via CashApp or Venmo, the money arrives in 1-2 days for absolutely free (or instantly for a 1% fee). When I invest in stocks (and even options nowadays), there is absolutely no fees involved.\n\nHowever, if I want to buy bitcoin, there’s a fee. If I want to sell bitcoin, there’s a fee. If I want to send my friend some bitcoin, there’s a fee. If I only want to invest $25/week in bitcoin, $5 of that will go to paying the fees.\n\nDoes anybody else not think it’s a little ridiculous? If I want to invest $25/week into VOO, VIG, or SPY, I don’t have to pay 20% of my investment in fees. If I want to sell all of my stock positions, I don’t have to worry about any fee except for maybe the spread if I do a market sell (a couple of cents per share at max). \n\nWhy are the fees with crypto so high? Other than NANO, there aren’t really any cryptocurrencies with no fees. Do you guys think this will change in the future? What are your thoughts?"}, {"title": "PSA: it’s nearly impossible to “diversify” within crypto", "score": 183, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycne2/psa_its_nearly_impossible_to_diversify_within/", "selftext": "Seen some popular posts/ sentiment around here about how it’s important to hold lots of different coins for diversification! A big problem with that thesis - true diversification is the accumulation of assets who’s returns are not well correlated with one another, I.e stocks and bonds, growth stocks and value stocks, real estate, equities from different segments of e global economy etc. \n\nCrypto is a great way to diversify your portfolio if you hold lots of the other asset classes- but if you already hold a ton of crypto, buying different kinds of coins isn’t diversifying- you’re just exposing yourself to the same underlying market dynamics via multiple assets. \n\nThe way I view altcoins is essentially as a way to expose yourself to more volatility within the crypto space- you are subject to the same market forces as BTC but with a much higher beta and therefore the potential for greater returns (or losses obviously).\n\nThe same is obviously true for folks that want to hold crypto and then also invest in stocks that derive their value from crypto like coin base, Riot etc...\n\nAny who good luck and happy mooning!"}, {"title": "For those who survived the 2017/2018 crash, any advice lol?", "score": 12, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycmrh/for_those_who_survived_the_20172018_crash_any/", "selftext": "Let's be honest, this is gonna crash at some point. what comes up will come down. Its just a matter of when and how much it will crash. I hope it isn't soon and it doesnt crash too bad, but it's a up in the air. I literally read financial analysts basically say I dont know 😂😂😂😭😭😭\n\nAnyways anyone who survived the 2017/2018 crash have any advice? What did you learn?"}, {"title": "Bitcoin Price Consolidates Near $50K, Why BTC Bulls Could Fail Near $52.5K", "score": 1, "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-near-50k/", "selftext": ""}, {"title": "Everybody recommends trust wallet for beginners. They make you go to an external website to \"verify\" your wallet when having issues. This website is currently being fakes in mass numbers. You can see on the telegraph trustwallet help center it brings you to when you try to get customer support.", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycika/everybody_recommends_trust_wallet_for_beginners/", "selftext": "I cannot highly enough recommend not using this app or wallet until they make the site from the app itself. I cant believe so many people are recommending it. When I raise the issue in trustwallet subreddit, they do not want to publish it. Please steer clear of this wallet.\n\nAfter edit: oh wow, I see my account age and karma is right next to my name on this subbreddit. That's beautiful and probably would've realized I was about to get scammed in the first place. This is the website someone from reddit sent me while I was asking for help [https://walletconnection.co/wallets#](https://walletconnection.co/wallets#) .  It looks very legit. There are many other people doing the same."}, {"title": "Is btt a scam? (BitTorrent)", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycex8/is_btt_a_scam_bittorrent/", "selftext": "I keep hearing people call btt a scam coin but can not find any articles or anything to back that up. I know little about crypto and have always liked utorrent/bit torrent so I invested in it. People have been calling it scam coin but with nothing to back it up. If you know something that can protect my money please let me know"}, {"title": "Cryptocurrency exchanges be like: Your SSN will only be used to verify your identity. It will be stored securely and will not be shared without your permission, except as required by law.", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mycc4z/cryptocurrency_exchanges_be_like_your_ssn_will/", "selftext": "\\*\\*\\*Unless we're hacked in which case we will share without your permission. At which time will cause a class action lawsuit triggering suspicious looking emails that you'll probably block. Even if you do follow through with the $1B class action lawsuit you will then be eligible to receive  $1.68 for the inconvenience of our reckless data breach causing you pain for potentially the rest of your life.   \n\n\nTo log in and start trading immediately from our site, please don't forget to provide a photo of your license, passport, social security card, mothers maiden name, home address, tax ID, shoe size, thumb print, a measurement of your penis in both inches and centimeters, all other bank addresses, users names and passwords you've ever used in your entire life."}, {"title": "Why inflation is bad, no matter what anyone else on the sub tells you. With pirates!", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myc9j4/why_inflation_is_bad_no_matter_what_anyone_else/", "selftext": "I answered this in another thread but I think it’s worth a topic since I keep seeing “inflation is actually good for the economy!” Popping up everywhere.  \n\n#This is inherently untrue, and especially with crypto.  Inflationary coins will always end up failing at some point, and to explain why, I’m going to use a fun but simple analogy:  Listen well me hearties!\n\nYou have an Orange grove right outside of Port Bilge.  Over the course of your life you sell tens of  thousands of oranges because you have the only Orange grove for thirty miles around and the pirates who live at the docks don’t want scurvy.  Sometimes the Orange grove doesn’t bear as many oranges, sometimes the weather is bad, sometimes the pirates steal your oranges, and sometimes someone comes into port with a few hundred bushels of lemons.  \n\n#But regardless, long term, you have the lone goddamn orange grove, and every year you extend your land as more pirates come to port and you keep planting. Avast!\n\nThen one day peg legged Bart and Suzy six teeth decide to retire from the pirating life because they realize Orange tree business makes sense.  They also tell their friends Bobby the patch, Admiral Cannonblast, and Gunpowder Pete that THIS IS THE WAY.  Soon 50 pirates are planting Orange groves and pirating in the area is going out of fashion because oranges are more profitable.  \n\n#But soon the winds shift.  Now you all have a zillion oranges and nobody to sell it to.  You try and try to find a buyer with vitamin deficiency but alas, he’s already foolishly bought a grove from Handsome Doris.  \n\nMeanwhile you thought you’d have this money forever so you didn’t put much money away and now The Sherrif of Rottingclams comes a knocking because Rottingclams needs a new road since Mad Tom Mcgibbles blew up the road.  You’re broke, the law is coming, and so you turn to turning tricks to pay for grog.  Life sucks.  If only there weren’t so many goddamn oranges.  Yarg :(\n\nThen it hits you.  The next port 100 miles North DOESNT have an Orange grove, AND the Navy of Rottingclams is busy down south putting down riots within the Kingdom of SaltyDoge.  Now you know better and how to avoid inflation! You’ve got the important good and nobody can threaten it!  Time to hit it big!  And if inflation starts coming your way, you’ll have saved because you know better and can invest your hard earned booty in something sensible like burying gold and forgetting where you put it!\n\nYou pop in your wagon, bid farewell to the other loser pirates and their failing orange groves, and head towards your destination! Land ho!\n\nBut then a horse breaks its leg and you get dysentery and die, because all you have to eat are oranges after you are the horse and they just give you more shits.\n\n#TL:DR Moral of the story:  Inflation bad.  Smart Pirate supplier good.  Never stick around for oranges to go brrrr.  Yo ho!\n\nEdit: change flair to privacy since it can be easily misconstrued for Piracy.  Yarg."}, {"title": "Becareful and warn others of the 'Binance' live streams that are back on YT", "score": 16, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myc3j7/becareful_and_warn_others_of_the_binance_live/", "selftext": "I'm seeing more and more of these hacked accounts on YouTube with upwards of 1-2 million subscribers, pretending to be some kind of interview with the Binance CEO. With a promise of doubling your BNB if you send it to them. It is of course fake, and I'm sure many of you know that.\n\n**This is a problem.**\n\nWhat's scary is that some of these streams pull upwards of 25k viewers, and even if 90%+ of these are bots, that's still hundreds of people that are capable of losing money. I checked the receiving addresses on one of the smaller channels and even they received around 274BNB (\\~140k$) in just a few hours of uptime on a Russian kids hacked minecraft channel. \n\nIt's a very serious problem in the crypto space. Where there is success, there will be people to exploit it. \n\n**What you can do to prevent it?**\n\nWell. You can't. When one door closes for these scam artists, they will force another open. It's just the way it goes.\n\nBut what you can do is spread the word of crypto scams. Tell your Aunty Mable. Tell your little brother that's getting into the cryptosphere. Tell your dog, I don't fucking know. Just make sure the people around you know of these scams. Oh and of course report the streams when you see them. Hopefully YT can get their shit together with these scammy streams."}, {"title": "Turkey has arrested 4 people in responce to Vebitcoin collapse", "score": 0, "url": "https://www.bbc.co.uk/news/world-europe-56871403", "selftext": ""}, {"title": "I need help! Thanks", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybzid/i_need_help_thanks/", "selftext": "I use blockchain and currently have only dropped money into BTC and ETH, however since I'm 17 I dont have ID yet but long story short ive been looking into other smaller cryptos and realized that the blockchain only has quite a limited few, was wondering if there were any better sites or something with more options for crypto. Keep in mind I dont have ID so if you know any please let me know much appreciated"}, {"title": "[Unpopular Opinion] Bitcoin is a pretty bad coin and if we talk about \"fundamentals\" it is highly overpriced", "score": 1360, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybyx4/unpopular_opinion_bitcoin_is_a_pretty_bad_coin/", "selftext": "Now, before the downvotes come, hear me out. Often times, we label Bitcoin as \"the internet of money\" or \"digital gold\", but I believe that Bitcoin as money is pretty much broken and the digital gold is not a fitting one.\n\n* Point 1, \"the internet of money\". \n   * Per the whitepaper, Bitcoin is implied to be a \"A purely peer-to-peer version of electronic cash\" and in the whitepaper it's mentioned that one of the downsides of traditional electronic payments is that \"the cost of mediation increases transaction costs, limiting the minimum practical transaction size and cutting off the possibility for small casual transactions\". \n   * I know this paper was published in 2008, but let's fast forward to today. We have widely used systems like Apple Pay and Venmo which allow us to transfer money without fees, while the average Bitcoin transaction fees are $29 today, and reached all time highs of $61 in April 21st. This shows us that Bitcoin is no better than traditional payments for \"small casual transactions\" and thus unusable to be called peer-to-peer cash\n* Point 2, \"digital gold\"\n   * In 2008, during one of the worst economic periods ever, gold \"only\" dropped 27%, while we have seen Bitcoin drop multiple times over 50% during bear markets.\n   * During the covid pandemic:\n      * Gold went from 1570 in February 11th 2020 to 1487 in March 16th 2020 (lowest in this time period), a 6% drop.\n      * BTC dropped from 10.2k in February 11th 2020 to 5200 in March 17th 2020, a 49% drop. Bitcoin's volatility definitely does not make it a store of value, though it is true that based on historical performance, Bitcoin is orders of magnitude better as an investment than gold\n   * I have made a post about this [before](https://www.reddit.com/r/CryptoCurrency/comments/mf5or1/unpopular_opinion_bitcoin_is_a_hypergrowth_tech/), but I believe that instead of \"digital gold\" bitcoin should just be called what it is a hypergrowth digital asset. \n   * Now, what made Bitcoin rise in popularity and demand since its inception? Its usability as digital money. Nowadays, people are buying it just to speculate, and I believe that usability over time beats speculation. As long as Bitcoin keeps being unusable as money, I believe that in the long term other coins will outperform it.\n\nSo Bitcoin is slow and expensive to transfer, and as we have recently seen with the hashrate drops in China, it is highly centralized for a decentralized system. The only benefit that Bitcoin really has is first mover's advantage and brand name, which I believe that over time isn't really a real advantage.\n\n(Other point that I believe are worth mentioning that are not often mentioned in this sub)\n\n* Point 3, contamination\n   * It is no secret that Bitcoin is extremely power hungry, consuming 129 TWh, 60% of which does not come from renewable energies. All of the world's data centers consume 205 TWh, and I don't believe that Bitcoin is even remotely close to be as necessary as all of the data centers combined, which shows how massively inefficient Bitcoin is in terms of electricity ([source](https://www.visualcapitalist.com/visualizing-the-power-consumption-of-bitcoin-mining/)). The worst part in all of this is that power usage will just increase with time if Bitcoin becomes more and more popular due to increases in difficulty. Quite frankly from an environmental perspective, Bitcoin's power usage is simply not worth it, and something should be done about it.\n\nIt makes me a bit sad, since when I first heard about Bitcoin in the summer of 2016 I was really excited about it, since it mixed 2 of my big interests (Computer Science and money). But nowadays I'm more passionate about other projects that I don't want to mention in this post because I don't want this to be a shill post. Unfortunately, I think Bitcoin has deviated from what I believe is its best use case, being decentralized money, and since there seem to be no signs of going  back to that path Bitcoin will just become a coin for speculation which I believe will lead it to failure in the long term"}, {"title": "Bitcoin Dominance Could Fall Over Proof-of-Work's Energy Consumption - Chris Larsen", "score": 0, "url": "https://news.bitcoin.com/ripples-chris-larsen-believes-bitcoin-dominance-could-fall-over-proof-of-works-energy-consumption/", "selftext": ""}, {"title": "Opinion: Shouldn't the blame be on Elon for starting the current rise of shitcoins n scams? He is a detriment to crypto.", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybs0b/opinion_shouldnt_the_blame_be_on_elon_for/", "selftext": "He massively pump the value of Doge with just tweets, Doge has become a speculative asset now at his mercy instead of being a community joke coin.\n\nAnd now a crapload of shitcoins that have name Moon, Doge, Elon, Rocket in it. These shitcoins are hoping for Elon's tweet of words having vague similarities to their coins which will have ignorant people trying to pump into this shitcoins believing it could be the next doge that will bring them to be millionaires while the people who create these shitcoins are laughing to bank by either pulling the rug or by transaction fees/merchandise.\n\nElon himself knows he has the power to pump the value of a coin with just tweets as evident with Doge, he just potentially pave the way for other popular businessmen/celebrities to do the same thing for their own gains because if Elon can do it, so can they."}, {"title": "A friend bought Doge, should I tell him to sell?", "score": 9, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybqru/a_friend_bought_doge_should_i_tell_him_to_sell/", "selftext": "In my opinion, no one should hodl or buy Dogecoin because I just don't see any substance behind it and I would like to tell my friend that. He is convinced that Doge will reach $0.30 again.\n\nBut maybe he is right, maybe Elon is going to tweet something again, then it would be my fault that he got out of Doge too early.\n\nWhat would you do?"}, {"title": "Bitcoin bears are stalking crypto prices — here’s how low they could go", "score": 1, "url": "https://www.marketwatch.com/story/bitcoin-bears-are-stalking-crypto-prices-heres-how-low-they-could-go-11619017262?mod=newsviewer_click&link=sfmw_fb&fbclid=IwAR3OFA2VELhfnEZRc8-gXNrZk4ayLhXzZ8c0RRYOdDZo7oHAuYqCoOFJ8k8", "selftext": ""}, {"title": "What to do when newbies start feeling the ups and Downs?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybpqq/what_to_do_when_newbies_start_feeling_the_ups_and/", "selftext": "As with a lot of people here I assume, after being in Crypto for a while, people starts to ask you about what they hear.\n\n\"How do I make money with Bitcoin\"?\n\n\"Can I really have a Tesla stock using IQ option or Etoro?\n\nIn this cases, like to tell them that if they want quick money, go Buy Donuts or Doritos and sell them, but if they want to get into crypto/stock, then decide if want to invest or trade/work. \n\nFor most, Is a matter of DYOR, get to know yourself as investor, your risk tolerance and do not put More money you can afford to lose. \n\nStory Time: \n\nThis guy asked me about a Facebook ad of IQ option and then decided to Made him invest 15 bucks (300 MXN) in btc and ETH to get to know about investing and also to open an account there and E toro to start practicing His emotions and skill in trading. \n\n\"Do not sell lower than you Buy It\", that was my simple advice. \n\n5 days later, he Is sending me news about the turkish exchange and their money stolen, biden tax law and some other news, and then say \"what to do?\".\n\nJust told him that nothing, hold and in 3 years likely Will be worth More. \n\nStill waiting for him to try the CFDs platform.\n\nWhat do you do in this Situations?"}, {"title": "Bitcoin Sell-Off Leaves Cryptocurrency in Weakening Short-Term Trend", "score": 3, "url": "http://www.coindesk.com/bitcoin-below-50k-oversold-signals", "selftext": ""}, {"title": "Confused by circulation and max supply", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybga5/confused_by_circulation_and_max_supply/", "selftext": "I see a lot of posts saying a token has almost limitless supply so it will never be very valuable: however, I've noticed a few tokens whose circulation is nowhere near max supply. Does this mean it can still have good value until more gets mined or does it not matter?"}, {"title": "I think I have a new hobby: talking to the scammers on here. Meet martins by name [continued]", "score": 63, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybfd9/i_think_i_have_a_new_hobby_talking_to_the/", "selftext": "Sorry for making a new post, but people seem to like these and nobody sees it if I just update my old post. This is a continuation from [here](https://old.reddit.com/r/CryptoCurrency/comments/mvjt5u/i_think_i_have_a_new_hobby_talking_to_the/).\n\nA few days ago, martins by name wrote me and made me a great offer: I could participate in his investment program and make more than 82% profit if I invest enough! Of course I couldn't refuse and sent a Bitcoin right away, but unfortunately, the clerk at my local WalletMart^TM told me that his wallet was clogged! martins by name unfortunately was a bit slow answering and not perfectly cooperative helping me get my money back. I guess he is having a Sunday off, but I hope his wallet gets unclogged tommorrow, I will update you on the insane profits I made. [Read our full conversation here!](https://imgur.com/a/mmLzEwX) (the first column and the very start of the second were already in the old thread)"}, {"title": "The \"Big 3\" Stupid Clickbait/Fearmonger Topics of the Week.", "score": 6, "url": "https://www.reddit.com/r/CryptoCurrency/comments/mybeq6/the_big_3_stupid_clickbaitfearmonger_topics_of/", "selftext": "\n\n\nThese three stories are going to give me glaucoma from how much I've been rolling my eyes.  \n\n\n\n1) Janet Yellen said Crypto is ineficient....she also said it's a speculative asset.  She called it a growing problem.  In other news she said water is wet and I don't see anyone screaming about how new revalations show life giving liquid may be responsible for drowning millions of innocent victims.\n\nUhhhh guess what? It is inefficient compared to FIAT right now, it is speculative, and it is a growing problem.  None of these are \"omg she said fuck bitcoin and they are going to sterilize anyone with a wallet\"\n\nYou know what she's also said? “I think we need to look closely at how to encourage their use (crypto) for legitimate activities\"\n\n\n\n\nThe scary quotes are taken in the context of national security senate hearings where she expressed concern about terrorist organizations using Crypto...which they do...and she should be.  Yea... crypto and terrorism is ... *gasp* a growing problem. It's not some referendum on crypto and how she hates it, but that hasn't stopped every news outlet from chopping up quotes to make it sound like it's more than that.\n\nShe called it a speculative asset... omg whats that about? \n\nIt is.  If the apocalypse comes crypto won't be worth shit.  You know what else won't?  USD or Cash. Guns, Ammo, Antibiotics, Medical supplies, Food etc will replace cash REAL fast.\n\nThis isn't shots fired ...but doesn't stop thousands of people from telling people it is .\n\nShe said it's inneficient.  She didn't say that in a vacuum, she said it talking about it as a currency...\n\n...and it is ... right now.  We have a ways to go to mass acceptance, but it's more widely accepted than ever before every single day, yet somehow people spin this to mean \"bitcoin is shit, useless, worthless\".\n\n\n\nSeriously it's like if someone asked you what's 2-5? Then you say -3 and the next month 10000 articles are written about you saying \"When asked about the math problem, he only had negative things to say\"\n\n\n2) InDiA iZ BaNinG Bitcoin!!;\n\nGoogle the words India and Bitcoin and you'll literally see nothing but the exact same article written  over and over.  Some bill will be proposed by some one that will do something.  Too bad no one has said that. The original source was anonymous and as far as I've heard from Indian Redditors, this bill doesn't exist, isn't being proposed because no one has written it...and it's all based on one single anonymous source.  But hey that hasnt stopped every single \"I need 500 words about Crypto that will get clicks, so make it scary\" waste of space \"reporter\"from talking about it as if India is coming with the clubs and riot gear. \n\nIt's insane how many people talk about this as if it's a thing\n\n3) (commumist) Joe Biden declaration of war on crypto\n, he's taking your guns, so he can raise your taxes, to reform police, to arrest you over crypto.\n\nDid you know eating ice cream is proven to increase your odds of being attacked by a shark?  Obviously this isn't true, people eat more ice cream in the summer, and more people go to the beach in the summer.  \n\nJust because two things happen doesn't mean they are related.  Bitcoin was expected to surge on Coinbases IPO, and alot of people were also saying a retraction would follow.\n\nBut good God has this basic stuff been completely put to the side as people trip over their own dicks in a mad scramble to attach a possible proposed Capital Gains tax to the dip in Crypto so they can come to the conclusion they attach, which is \"DON'T INVEST IN CRYPTO BIDEN WILL TAKE IT ALL'\n\nGuess what....\n\nIf I make a mil I'll pay the taxes happily.  I bet everyone agrees. How the shit did \"Biden wants a bigger cut when you're rich\". ..which sign me up for that sounds amazing... become \"crypto is so fucked you're going to have to pay 106% in tax and give a smelly man a reach around\".\n\n\n\n\n\nThese three stories are all I ever hear and it's just such sloppy, obviously farm mongering garbage that I felt like ranting about them."}, {"title": "Is it getting late in the season for new projects?", "score": 4, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myb9jf/is_it_getting_late_in_the_season_for_new_projects/", "selftext": "I came across a new project tonight that sounds like it really does have potential. In short, it's an exchange that you can drop fiat into and directly buy small and micro cap tokens with their native token. 1 very cool planned feature is to have a damper on the liquidity pool for large wallets removing so that large whales and Devs can't rug pull all at once. \n\nAnyway, they've only just done their first AMA I believe, and the token has been live on Pancakeswap for 4 or 5 weeks. But there's still a ways to go before any exchange is going to be functional. \n\nWhat are the odds of this kind of project being viable during this upcoming alt season? \n\nFor anyone interested: [this is the exchange. ](https://copiosa.io/)"}, {"title": "Is there any way to sell a dead coin? Or do they ever rise up and get relisted?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myb5q3/is_there_any_way_to_sell_a_dead_coin_or_do_they/", "selftext": "So, I have some po.et, and, they appear to be done for. Is there any way to sell a coin if it's been delisted? Or, what are the odds they make a comeback during a run like this?\n\nI was thinking of just converting it to BNB via the dust option on Binance. Also, does anyone else have a hard time letting go of coins like that because of fomo?"}, {"title": "Warren Buffett called Bitcoin rat poison, but he also had this good investment advice.", "score": 51, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myb40o/warren_buffett_called_bitcoin_rat_poison_but_he/", "selftext": "Warren Buffett has missed out on Google and many good investments because he didn’t understand them. It looks like crypto is going to be another one.\n\nHowever, I was watching an interview with him recently and really liked these two practical tips, which applies to crypto as well:\n\n1. If you’re not emotionally stable enough to buy a stock and accept it’s ups and downs, don’t buy any stocks.\n\n2. If you’re not comfortable buying and holding a stock long term, don’t buy any stocks.\n\nSee, Warren is a longterm value investor. He has realized the advantage of long-term investing is found in the relationship between volatility and time. Investments held for longer periods tend to exhibit lower volatility than those held for shorter periods. The longer you invest, the more likely you will be able to weather low market periods. It’s the only consistent way to make profits."}, {"title": "Unpopular opinion: people in here are as greedy as the banks they hate", "score": 896, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myb0dk/unpopular_opinion_people_in_here_are_as_greedy_as/", "selftext": "Look, I love crypto. I love the idea of a decentralized financial system. I can see what is wrong with banks. But people here are spitting on banks and other financial institutions because they are these huge greedy monsters that only want to take everybody's money.\n\nAt the same time everyone is jumping into every single fucking scam-, pump- or memecoin hoping they can make thousands of dollars in a day. Some even say scams are not a problem because \"yes they are scams but if you get out in time you can still make profit\". Scamcoins are a zero-sum game: every single dollar you potentially gain, is lost by someone else.\n\nIt's ridiculous and hypocrite how some people here don't even realize they are showing the exact greedy behaviour they are accusing the banks of, at the cost of others.\n\n&#x200B;\n\nEDIT: To be clear, I'm not a saint. Obviously I'm also here for the money like everyone else. If you responsibly invest in solid projects, this post is not about you. My point isn't so much judging greed, it's judging hypocrisy. It is about being a hypocrit when you judge banks for taking peoples money without caring that they get fucked, while at the same time massively pumping and supporting scams just to take peoples money without caring that they get fucked."}, {"title": "Scam Alert ! Watermine. io ! Don’t fall for the 2% daily gains tale!", "score": 5, "url": "https://www.watermine.io", "selftext": ""}, {"title": "Turkey’s Central Bank Head Says Crypto Regs Coming, Denies Total Ban Ahead", "score": 13, "url": "https://www.coindesk.com/turkeys-central-bank-head-says-crypto-regs-coming-denies-total-ban-ahead", "selftext": ""}, {"title": "Got scammed in February finally ready to talk about it.", "score": 399, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myaofj/got_scammed_in_february_finally_ready_to_talk/", "selftext": "So in February I was introduced to a company that promised 1.5% daily returns on investments. This company went by the name of Wiseling. Now I tired my best to ensure that this wasn't a scammed and did research and saw where they were registered (fake certificates embedded on the internet)  I lost 3.5+k in total (BTC and ETH). By the time i figured out it was a scam (they introduced a 10% investment plan that i figured was too good to be true) they had stopped withdrawal and my crypto was gone!! There website and communication was so perfectly laid out that I got duped. Not only did I get duped, I referred a total of 17 individuals to this \"company\" who invested a total of 7+k in total. After almost two months of coming back to reality I am finally confident enough to share my story. Please don't go around investing your crypto into online schemes. Learn to trade or hold. Don’t let my mistake become yours. I am now down to zero in my crypto account but all is not lost because for the rest of this year I will recover, and I will purchase more BTC and ETH and hold!"}, {"title": "Inflation for beginners: what it is, why it happens, and why we need Bitcoin as a store of value", "score": 18, "url": "https://www.reddit.com/r/CryptoCurrency/comments/myaodm/inflation_for_beginners_what_it_is_why_it_happens/", "selftext": "Up until recently I didn't really understand inflation. I knew what it was at a high level but didn't understand the details of it. Well now I've taken an economics course and have done some research, and figured I would share this guide for anyone who finds themselves in the same position as I was. I tried my best to explain it in the simplest terms. There's a chance that I've understood something incorrectly so if you find a mistake please tell me so I can edit the post. I wouldn't want to spread false information to the 20 people that see this.\n\n**TLDR: The following points summarize each section of this post:**\n\n* **Inflation is the decrease in purchasing power of a currency. 10 dollars in 2021 do not carry as much value as 10 dollars in 1980.**\n* **Inflation is used to create more money for the government to pay off debts and to stimulate economic growth. Too much inflation is bad, no inflation is also bad: there's a sweet spot.**\n* **Because of inflation, an investment can earn profits without increasing your purchasing power, which basically means you're \"losing money\" in a relative sense.**\n* **Inflation in measured by expressing the value of the currency in terms of a constant value asset. The value of the currency at a fixed point in time is often used as a benchmark.**\n* **Hyperinflation happens when purchasing power decreases too quickly, which creates a cycle that causes the value of the currency to plummet. This usually has disastrous effects on the economy.**\n* **Bitcoin is a hedge against inflation because it is a deflationary asset. As purchasing power decreases with inflation, the price of Bitcoin increases to preserve (and increase) its own purchasing power.**\n\n# What is inflation?\n\nInflation is the decrease in purchasing power of a currency (i.e. increase in prices). What does this mean? Let's look at it anecdotally: Have you ever had a grandparent (or other old person) say to you: \"When I was your age I could buy a coffee for 10 cents. Now it costs me over a dollar!\" This increase in price is due to inflation.\n\nTo fully understand this you have to make the distinction between the price and the value (or purchasing power) of a currency. The price of a currency describes how much the currency is worth with respect to the current value of the currency. So for example, $1 in 2021 = $1 in 2021. Obviously this is true for any year, $1 = $1 always. Yes this is a bit redundant, but it's important to grasp to make the distinction between price and value.\n\nThe value of a currency, or purchasing power, is not as easy. Over time it decreases. For example, $1 in 2021 ≠ $1 in 1971. In fact, $1 in 2021 < $1 in 1971. Think about it using the coffee example: in 1971 a dollar could buy you 10 coffees. Today the same dollar can't even buy one whole coffee. So a dollar can buy you less coffee today than it could in 1971. In other words, the purchasing power of the dollar went down. This is inflation.\n\n# Why does inflation happen?\n\nThere are many causes for inflation that I won't pretend to fully understand. You can read about them [here](https://www.forbes.com/sites/johntharvey/2011/05/30/what-actually-causes-inflation/?sh=69a53d62f9a9).\n\nThe main cause of inflation that relates to cryptocurrency is when the government introduces more money into circulation. They do this for a few reasons.\n\n* To pay off their debts. If the government doesn't have enough money to cover their debts they just... make more. This is especially relevant today as COVID relief plans are sending governments further into debt.\n* To encourage buying and stimulate the economy. If people know that their dollars are going to be worth less in the future they are more likely to buy things in the present (to get the most out of their money, so to speak) which is good for the economy.\n\nThe above reasons are broken down into very simple terms. In reality things are much more complex.\n\nOver the course of this post (if you bother reading it through) you might get the impression that inflation is always a bad thing. I think it's important to note that having no inflation is bad for the economy as well. An absence of inflation means money will increase in value, so people make money by simply holding on to their cash (think of the Bitcoin hodl mentality). Obviously this is bad for the economy as there is less and less spending. There is less demand so prices drop. companies become less profitable so they decrease wages to increase their margins.\n\nWe can see that having no inflation is not good. And we'll see later that having too much is not good either. There's a \"sweet spot\" for inflation that the government targets in an attempt to get all the benefits of inflation without any of the drawbacks. This target rate is usually 2%. Whether or not this actually works I have no idea.\n\n# What does this mean for investors?\n\nBasically what this means in that if you're earning a rate of return that is lower than the inflation rate, you're actually losing purchasing power, even though you're gaining money. Let's look at an example:\n\nLet's say you want to buy an item that costs $1000 but you only have $980 available to spend. You put this money in a saving account that earns 0.5% interest. In 5 years, you will have 980\\*1.0055 = $1,004.75. Now you head to the store to buy the $1000 item, except that you forgot to factor in 2% inflation: when you get to the store the item now costs 1000\\*1.025 = $1,104.08.\n\nHow we interpret this? Well in year 0, you could afford 980/1000 = 98% of the price of the item. In year 5, you can afford 1004.75/1104.08 = 91% of the price of the item. In other words your purchasing power went down, even though you gained more money.\n\nBecause of this, we as investors need to look for investments that not only make us money (i.e. profits), but also increase our purchasing power. To do this, you should only pick investments whose rate or return is higher than the inflation rate.\n\n# How do we measure inflation?\n\nInflation rates are measured using indices like the Consumer Price Index (this is one example, there are many others). The CPI calculates inflation by tracking price changes for thousands of products, services and pretty much anything that costs money. They track this by obtaining prices from sellers/providers every month, and calculating the average percent change in price month over month. Here are the yearly inflation rates as per the CPI:\n\n&#x200B;\n\n[US inflation rates between 1914 and 2021. I'm not sure why the vertical axis doesn't extend into the negative.](https://preview.redd.it/0yes9r4b99v61.png?width=1776&format=png&auto=webp&s=e7924a8d98d31840b306c5e08319352270ccca52)\n\nWhen the inflation rate is positive (green bar), purchasing power decreased that year (in comparison to the previous year). When the inflation rate is negative (red bar), purchasing power increased that year (this is called deflation).\n\nThe CPI uses this information to calculate the value of the US dollar. To express the value of a currency over time, a constant value benchmark is often used. For example, this could be done by expressing the value of the dollar in terms of how many apples $1 could buy. $1 might buy you 20 apples in 1960, but only 2 in 2021 (These are made up numbers for the sake of the example). Instead of using apples as the base value, the CPI uses the average value of the dollar between 1982 and 1984. The yearly index values are shown here (with the above graph overlain):\n\n&#x200B;\n\n[CPI \\(blue\\) and average inflation rate \\(red\\) between 1913 and 2019. The red line is the same as the above bar graph.](https://preview.redd.it/fq2pg4wf99v61.png?width=1280&format=png&auto=webp&s=36478fb8d002052702457f95c29b18c5d7301ff8)\n\nOn this graph, the blue line shows the ratio of the value of the dollar between 1982 and 1984 (average value over this period) to the value of the dollar in that year (expressed as a percentage). More simply put, the blue line tracks how many dollars in that year have the same value as $100 did between 1982 and 1984 (3-year average) . So if we look all the way to the left, in 1913 approximately $10 had the same value as $100 in 1982-1984. Similarly, in 2019 approximately $260 dollars had the same value as $100 in 1982-1984.\n\nA couple of interesting things to take note of on this graph:\n\n* The blue line hits 100 around 1983. This makes sense since $100 dollars in 1982-1984 were worth $100 dollars in 1982-1984.\n* When the inflation rate (red line) is above zero, the CPI (blue line) trends upwards. When the inflation rate is below zero, the CPI trends downwards. This makes sense since the red line describes the rate of change of blue line.\n\n# What is hyperinflation?\n\nHyperinflation happens when there is a sudden, significant decrease in purchasing power. This happens when inflation \"goes too far\" and the sudden decrease in purchasing power starts a vicious cycle: As the value of a currency plummets, those that hold the currency rush to exchange it for an asset that will preserve its value. This in turn pushes the value of the currency even further down, and the cycle continues.\n\nSome examples of hyperinflation are:\n\n* The Weimar Republic: After the first world war, Germany owed many debts and reparations that they simply couldn't afford. To pay them off they tried to print more money, and hyperinflation ensued.\n* Zimbabwe: Once again due to excessive money printing, in 2008 Zimbabwe saw an inflation rate of 80B%. There is a pretty big name in the crypto community who carries a Zimbabwe billion dollar bill in his wallet as a reminder of what can happen to fiat currencies. 10 moons to the first Redditor to name this person.\n* Venezuela: This is an ongoing period of instability for Venezuela's currency that began in 2016. Many of you may know that a fellow Redditor in this community runs a crypto fundraising campaign to bring food to her community that is affected by this.\n\nHyperinflation is very bad for the economy: as currency becomes worthless, everything becomes very expensive, people can't afford as much and the economy comes to a halt. It also erodes trust in the government and banks.\n\n# How does Bitcoin solve this problem?\n\nTo counteract the effects of inflation, or in other words to preserve the purchasing power of our wealth over time, we use an inflation hedge. An inflation hedge is an investment whose growth equals or exceed the rate of inflation, so by investing in the hedges you are preserving or increasing the buying power of the money that you invested. Some common inflation hedges are gold, income producing real estate (i.e. rental properties), well-performing stock market indices or ETFs, and some specific bonds that protect against inflation.\n\nThe key to Bitcoin functioning as an inflation hedge lies in the fact that it has a maximum supply. Compare Bitcoin to the dollar. As more dollars enter into circulation the purchasing power of those dollars goes down (assuming the \"demand\" for the dollar remains relatively constant). Contrarily, since the amount of Bitcoin has a hard cap and cannot be increased, the purchasing power also remains constant (or rather increases, since the demand for Bitcoin will always be increasing, even if it's much slower than right now). So we will see that, like gold, the price of Bitcoin will slowly increase to match or outpace the rate of inflation, preserving its purchasing power. This is why Bitcoin is considered a \"deflationary asset\".\n\nA couple of notes on this:\n\n* Right now Bitcoin is in it's infancy, and as the crypto-sphere grows the demand for Bitcoin increases much faster than what I assumed above  (so we see the price climbing extremely fast). In theory, we will eventually reach a point where Bitcoin is mainstream and it's demand increases organically (will growing population, for example), so the rise in demand will taper off and Bitcoin's value will increase more slowly (but will still act as an inflation hedge due to its fixed supply).\n* I also assumed Bitcoin to have a fixed supply. We all know this isn't true right now because of how Proof of Work is designed: as time goes on more Bitcoin enters into circulation. However, the increase in demand for Bitcoin is currently outpacing the rate at which new Bitcoins are introduced, so the price rises. Eventually the supply will reach a hard cap of 21 million.\n* Another important factor that I left out is how much Bitcoin is lost, and will continue to be lost. Because of this the effective supply of Bitcoin actually decreases, which will cause its price to increase (assuming constant demand).\n\nIf you made it this far, thanks for reading! Here's [an interesting video](https://www.youtube.com/watch?v=YgxPyabmOrU) relating to inflation. It's not directly related to cryptocurrency, but if you listen to what the speaker is saying you can pick out some of the fundamental concepts behind Bitcoin.\n\nSources (not exhaustive, just the ones I remembered to copy):\n\n[https://www.investopedia.com/terms/i/inflation.asp#:\\~:text=Inflation%20is%20the%20decline%20of,over%20some%20period%20of%20time](https://www.investopedia.com/terms/i/inflation.asp#:~:text=Inflation%20is%20the%20decline%20of,over%20some%20period%20of%20time).\n\n[https://www.investopedia.com/terms/c/consumerpriceindex.asp](https://www.investopedia.com/terms/c/consumerpriceindex.asp)\n\n[https://www.investopedia.com/terms/c/consumerpriceindex.asp](https://www.investopedia.com/terms/c/consumerpriceindex.asp)\n\n[https://www.macrotrends.net/2497/historical-inflation-rate-by-year](https://www.macrotrends.net/2497/historical-inflation-rate-by-year) (first graph)"}, {"title": "The Impact of Cryptocurrency Regulation on Trading Markets", "score": 5, "url": "https://academic.oup.com/jfr/advance-article-abstract/doi/10.1093/jfr/fjab003/6248122?redirectedFrom=fulltext", "selftext": ""}, {"title": "A BITCOIN crackdown could see the cryptocurrency \"legislated\" by the UK, EU, China and the US", "score": 3, "url": "https://www.express.co.uk/finance/city/1427240/bitcoin-crackdown-crypto-news-price-prediction-joe-biden-capital-gains-tax-uk-spt", "selftext": ""}, {"title": "Which coins are going to the most affected by the disastrous coronavirus situation in India?", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my9qll/which_coins_are_going_to_the_most_affected_by_the/", "selftext": "What projects are going to be affected by the coronavirus disaster in India? As a major player in the crypto world, the situation in India may prove to be very dangerous for some projects that have expanded in that country over the last years. There might be some big players ready to take profit and abandon the field should the situation get dramatic over the next couple of weeks.\n\nWhich Blockchains rely on mining/stacking in India and which are the most used to pay for services and goods in that country? What exchanges could be affected?"}, {"title": "How Bitcoin can be the currency of freedom if a normal person can't use it?", "score": 3, "url": "https://read.cash/@phabulu/how-bitcoin-can-be-the-currency-of-freedom-if-a-normal-person-cant-use-it-ea011122", "selftext": ""}, {"title": "Which coin(s) did you think that would blow up but ended up disappointing?", "score": 3, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my93pc/which_coins_did_you_think_that_would_blow_up_but/", "selftext": "There's always talk about which altcoin would be the next big thing. It's one of the most asked questions here \"Which coin do you guys think will blow up?\". Obviously, this question is not new has been asked for a couple of years. \n\nSo instead of looking at the future, let us look back. Which coin was convincing enough to make you think it'd blow up, but ended up disappointing/flopping/not fullfilling its promises?\n\nIn the notorious year 2017, I really thought REQ would blow up. Talking with some other friends at uni, I also decided to buy GIFTO, Vertcoin and Verge. Safe to say, they didn't bring me to my moon :("}, {"title": "What will happen when all of btt has been mined?", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my91wu/what_will_happen_when_all_of_btt_has_been_mined/", "selftext": "Will btt price go up higher because it has all been mined or will other factors lower it's price? I can see it being more valuable because it's suddenly more rate but if there's no reward to authenticate a transaction will the gas fees be so high it deminishes profits?"}, {"title": "A message for POS shills", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my8psv/a_message_for_pos_shills/", "selftext": "12,000 GW/h of direct solar energy alone hitting Earth\n\n12 GW/h currently used by bitcoin\n\nThat's 0.1%\n\nEnergy is literally everywhere and technology makes it both possible and cheaper to capture/convert.\n\nEnergy consumption is a design feature of POW blockchains. It's what secures the network.  It is not \"wasted energy\".\n\nPOS is nothing new, we've been using POS ever since banks started hoarding gold.\n\nEdit: to be clear, I hold coins on POS blockchains, I like them, it doesn’t make sense to spend much energy on cryptokitties. But it does make sense to spend energy on securing a decentralised global reserve currency."}, {"title": "I Diverted My Brother from Doge", "score": 0, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my8nqt/i_diverted_my_brother_from_doge/", "selftext": "My brother has always been interested in crypto but he thought the price is too high already, so during this week dip, my brother was planning on buying doge. I then proceed to explain that doge has unlimited supply, no real devs, and 36 million supply minted everyday. I also gave some recommendation on good potential alts to buy.\n\nSo, he finally settled with Algo due to its native apps, fast and feeless transaction and also good staking APR. I just hope this won't backfire because it seems like Doge managed to recover faster than other alts and he wont blame me for missing doge pumps\n(some perspective he bought algo at 1.05 when doge was 0.19. Doge is now 0.27 while Algo is currently priced at 1.16 so Doge would have been better option atm)"}, {"title": "Potential Bear Cases For Bitcoin", "score": 7, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my8k1r/potential_bear_cases_for_bitcoin/", "selftext": "As part of my DD for the investments I hold, I like to consider the bear cases from as unbiased a position as possible. I`m curious what others have to say regarding the bear case for bitcoin. In my opinion bitcoin is largely propped up by branding and being first in the market.\n\nLet me start off by saying Bitcoin is old technology that I don't believe will be used as a real currency. The counter argument to this is that it is a store of value competing with gold. However, gold does has much wider applications which is why a direct comparison is a bit complicated.\n\nIf Bitcoin truly is going to be a store of value then shouldn't it be the fastest, cheapest, most private, etc? It is none of these things - it was just the first.\n\nEvery time I come to this subreddit I hope to see enlightening information like we did several years ago. Instead it is just spam from fake analysts making price predictions - clearly in an effort to keep the price moving (up).\n\nIt's like everyone is still in love with their old hatch back Honda Civic and doesn't replace it due to the fond memories associated with it. Meanwhile there are plenty of newer options that perform the same function but better. Bitcoin introduced the concept of crypto, but it was never meant to be final iteration.\n\nThis takes me to my final point, if a newer, faster, smarter, whatever coin/network gains traction in the \"store of value\" space then Bitcoin's brand won't save it. Many new investors may approach crypto with the mindset that they are not going to use a less optimal non-tangeable product for nostalgia.\n\nNow what is interesting is the institutional investors - their accumulation of bitcoin over the past year likely will prevent or lessen the effect of sudden crashes. And when I say crash, I mean true 50%+ drops - not healthy corrections and consolidations. Do you think institutions backing bitcoin recently have helped bitcoin or are we setting ourselves up for massive drops once these organizations hit their price targets and exit?\n\nEdit: I love the discussion points so far - keep it up!"}, {"title": "Factors driving irrational crypto investment behaviour in retail traders", "score": 2, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my87nc/factors_driving_irrational_crypto_investment/", "selftext": "Morning fellow crypto investors! I’m currently in the initial stages of a research project aiming at uncovering what drives irrational investment decisions (focused on the retail trader/investor). \n\nAs such, I am trying to gather various drivers behind irrational investment behaviour (such as re-mortgaging your house to invest in Dogecoin, which, sadly, is our current reality). \n\nSo far, I am accounting for FOMO, hype (such as influencer tweets *wink wink Elon*), seeing huge gains in your social circles and a lack of time to DYOR. \n\nMy research is further focused on analysing how platforms such as Reddit serve as catalysts to drive such irrational behaviour, so any insight would be valuable. \n\nThank you in advance for any insight!"}, {"title": "The Gray Market: How a Brazen Hack of That $69 Million Beeple Revealed the True Vulnerability of the NFT Market (and Other Insights)", "score": 6, "url": "https://news.artnet.com/opinion/sleepminting-nftheft-monsieur-personne-1960744?utm_source=morning_brew", "selftext": ""}, {"title": "Is my strategy dumb?", "score": 5, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my7ziz/is_my_strategy_dumb/", "selftext": "Hi, I'm new to crypto, trying to figure out the best strategy for day trading. (Yeah, being new and straight jumping into day trading, what can go wrong?)\n\nFew weeks ago, I saw a post in Ekşi Sözlük, one of the most popular online discussion sites in Turkey.\n\n[https://eksisozluk.com/uc-ayda-2-bin-lirasini-3-milyon-lira-yapan-cocuk--6877757](https://eksisozluk.com/uc-ayda-2-bin-lirasini-3-milyon-lira-yapan-cocuk--6877757)\n\nIn a nutshell, it's about a teenager who earned about 3 million Turkish Liras(TRY) with an initial investment of 2000 TRY in three months without using any leverage.\n\nAt first i though it was a scam, to attract the newbies and rip them off (Considering the recent events involving Turkish crypto scams, it's quite possible.). Haven't checked his trading logs yet, but if you do the math, it kinda makes sense.\n\nAll you have to do is make a daily profit of 8.5 percent per day for three months, which is quite possible if things go well.\n\nSo my plan is this:\n\n1.Find a currency with a significant amount of volume and volatility (High enough to make profit, low enough to evade sharp losses)\n\n2.Make investment and wait\n\n3.Gain 1 percent profit minus 2\\*0.001 buy & sell commission fees (0.8 percent gain in total)\n\n4.Take that profit and get the hell out\n\n5.Repeat\n\nIf you do this 867 times, you eventually increase your portfolio about a thousand-fold, which is ridiculous.\n\nBonus:\n\n\\-No leverages & shorts (I cannot afford liquidation)\n\n\\-Switch to hard currency when you are not trading\n\n\\-Stop trading on weekends, when people tend to sell more\n\nI'm gonna start with 1000 TRY. (For context, minimum wage in Turkey is 2826 TRY per month)\n\nI'm aware that daily trading requires lots of patience and attention, but I have plenty of time. I'm unemployed, our economy was f.cked even before the Covid and there is nothing better to do while being stuck at home. I'm not doing this to \"live the high life\", buying lambos and villas and sh.t, I just want to have some financial support until things get better.\n\nIs this a feasible strategy? Am I dumb? Am I going insane? I already discussed this with some of my friends and they mocked me hard. You guys know much better than I do, so I need your advice.\n\nEdit:Typo"}, {"title": "Is Proof of Stake Fundamentally Flawed?", "score": 1, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my7y8t/is_proof_of_stake_fundamentally_flawed/", "selftext": "I’ve been thinking more and more about proof of stake security for popular smart contract platforms.\n\nAs it stands currently, proof of stake is relatively untested with enough volume and users to say it is secure. \n\nHow do proof of stake networks reconcile that every time someone uses their coins, network security is reduced?\n\nAs a proof of stake network becomes more popular, and gets more dapps and options to use coins, more people choose to do so instead of earning staking rewards. \n\nIt seems like a pretty fundamental flaw to me, so I’m hoping for some enlightenment.\n\nDoesn’t a proof of stake network lose network security as more people use their tokens instead of staking them for consensus? \n\nI’m sure this has been thought of and discussed before but I can’t find anything concrete."}, {"title": "Is there actually a significant environmental detriment to crypto?", "score": 8, "url": "https://www.reddit.com/r/CryptoCurrency/comments/my7mqw/is_there_actually_a_significant_environmental/", "selftext": "I have read some posts about crypto and the block chain being bad for the environment due to how energy intensive mining is and so and and so forth. I am still considerably green and trying to figure this all out.\n\nI see people talking about crypto being the future while others say it's helping destroy the planet. Is there actually an impact to the environment? If so how significant is it? Is there anything being done/that can do offset it?\n\nThanks to everyone willing to help noobs like me better understand this whole system."}]